[{"norwegian_name":"Webteknologi","code":"IT2805","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"I dette emnet er det fokus på World Wide Web som en plattform for interaktive applikasjoner, publisering av informasjon og sosiale tjenester. Utvikling av web-applikasjoner krever brei kunnskap om den underliggende teknologien, formater og standarder som World Wide Web bygger på og i dette emnet lærer du om den underliggende kommunikasjonsprotokollen HTTP, markup språk som HTML, XHTML og XML, språk for å spesifisere formattering og transformasjoner som CSS og XSLT, dokumentmodellen DOM, interaktiv grafikk og multimediainnhold på web, programmering på klient-siden med Javascript.","learning_goal":"Kunnskap om: \r\n- historikk og utvikling av World Wide Web og assosierte teknologier\r\n- klient-tjener arkitetkuren for web og kommunikasjonsprotokollen HTTP\/HTTPS.\r\n- formater og språk som benyttes i moderne web-sider og -applikasjoner; HTML, XHTML, CSS, XML, XSLT, Javascript, DOM\r\n- webprogrammering med Javascript\/DOM (klientside)\r\n- prinsipper for god design, universell utforming, multiplattform-applikasjoner\r\n\r\nFerdigheter i:\r\n- design og utvikling av websider og webapplikasjoner\r\n- bruk av verktøy \r\n\r\nGenerell kompetanse:\r\n- anvendelse av webteknologi\r\n- innhenting av informasjon, benytte dokumentasjon og spesifikasjoner"}
,{"norwegian_name":"Webutvikling","code":"IT2810","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset dekker teknologi og metoder brukt i utvikling av web-løsninger. Gjennom delprosjekter lærer studentene om rammeverk,  arkitekturer, sentrale språk, formater og standarder for web-applikasjoner og web-tjenester. Kurset er teknologi-orientert og prosjekter og delinnlevering evalueres ut fra kunnskapen og ferdighetene som er oppnådd.\t","learning_goal":"Har videregående kunnskaper i:  \r\n\u0095 teknologiene som ligger til grunn for moderne web-løsninger\r\n\u0095 arkitekturer, rammeverk, metoder og teknikker for utvikling av web-applikasjoner og web-tjenester\r\n\u0095 programmeringsspråk, teknikker og verktøy som brukes ved utvikling av web-løsninger\r\n\u0095 utvikling av dynamiske, interaktive, multi-plattform web-løsninger\r\n\u0095 formater og teknologier som brukes for å håndtere og formidle  data og informasjon i web-løsninger\r\nFerdigheter:\r\n\u0095 kan designe, utvikle og teste alle lag i en web-applikasjon \r\n\u0095 kan programmere og kode effektivt i språk og formater som benyttes\r\n\u0095 Kan evaluere egne og andres løsninger\r\nGenerell kompetanse\r\n\u0095 er i stand til å jobbe målrettet med kunnskapsinnhenting og kan utvikling egne ferdigheter i de teknologiene som inngår\r\n\u0095 kan jobbe i konstruktivt i grupper og kommunisere\/presentere meninger, vurderinger og løsninger\r\n\u0095 kan bidra til andres læring ved å gi gode tilbakemeldinger\r\n\u0095 kjenner til sentrale lover og regler som ofte må taes med i betrakning ved utvikling av web-løsninger"}
,{"norwegian_name":"Informatikk prosjektarbeid II","code":"IT2901","credits":15.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Studentene vil arbeide i grupper med et bestemt prosjekt innenfor informasjonsteknologi. Instituttet vil foreslå aktuelle oppgaver. Studentene forutsettes å arbeide selvstendig med sine prosjekter og delta i kollokvievirksomhet under veiledning av ansatte fra instituttet.","learning_goal":"Å gi studentene praktisk erfaring i å gjennomføre alle faser av et  systemeringsprosjekt med en kunde. Erfaring med systemutvikling i gruppe."}
,{"norwegian_name": "Objektorientert programmering","code":"TDT4100","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende algoritmer og datastrukturer, konstruksjoner og kontrollflyt i objektorienterte språk. Modularisering og gjenbruk. Standard programvarebibliotek. Enhetstesting, feilfinning og verktøy for dette.  Objektorientert design. Bruk av klasse-, sekvens- og samhandlingsdiagrammer i UML. Bruk av design patterns. Java brukes som implementasjonsspråk.","learning_goal":"Kunnskap:\r\nStudentene skal ha kunnskap om de viktigste begrepene og mekanismene i objektorienterte språk og om hvordan objektorienterte programmer struktureres og testes.\r\nFerdigheter:\r\nStudentene skal få ferdigheter i objektorientert programmering og bruk av relevante programmeringsmetoder (koding, testing og feilfinning) og moderne utviklingsverktøy.\r\nKompetanse:\r\nStudentene skal kunne bruke objektorientert programmering for å løse praktiske problemer og utnytte mulighetene i moderne utviklingsverktøy."}
,{"norwegian_name": "Prosedyre- og objektorientert programmering","code":"TDT4102","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende og praktisk orientert programmering med programmeringsspråket C++.\r\nEmnet dekker det viktigste i programmeringsspråket samt utvalgte deler av standardbiblioteket. Gjennom øvingene får studentene omfattende erfaring i konstruksjon, feilfinning og testing av programvare.","learning_goal":"Kunnskap: \r\n- Har bred og praktisk orientert kunnskap om programmeringsspråket C++. - Kan syntaks og regler for variabeldeklarasjoner og datatyper, typekonvertering, kontrollstrukturer, funksjoner og operatorer, overlagring, klasser, arv, templates, unntakshåndtering.\r\n- Har kunnskap om automatisk og dynamiske variabler og bruk av pekere. \r\n- Har kunnskap om rekursjon, enkle algoritmer og datastrukturer.\r\n- Har kunnskap om prosedural og objektorientert modularisering av koden og har kunnskap om hvordan kode kan organiseres i flere kildekodefiler, kompilering og lenking.\r\n- Har kunnskap om standarbiblioteket, inn\/ut datahåndtering, vanlig brukte funksjoner og template-klasser.\r\n- Har kunnskap om moderne utviklingsverktøy, teknikker for feilfinning og enkel testing av egen kode.\r\n- Har kunnskap om vanlige programmeringsfeil, validering av inndata, hvordan håndtere feil og uventet oppførsel.\r\n- Har kunnskap om diagramtyper for objektorienterte programmer.\r\n\r\nFerdigheter:\r\n- Kan utvikle et program fra problembeskrivelse til fungerende og feilfri løsning.\r\n- Kjenner vanlige brukte kodingsteknikker og kan jobbe iterativt og effektivt med konstruksjon av egen kode. \r\n- Kan programmere proseduralt hvor koden er fornuftig modularisert i funksjoner og objektorientert hvor koden er organisert i klasser. \r\n- Kan velge hvilke hvilken løsning som er best for et gitt problem.\r\n- Kan skrive kode som er gjenbrukbar, lesbar og enkel å vedlikeholde.\r\n- Kan lese kode og forstå hvordan koden oppfører seg i kjøretid.\r\n\r\nGenerell kompetanse:\r\n- Kan jobbe effektivt med å analysere et problem og konstruere en løsning.\r\n- Kan kommunisere og diskutere kodeløsninger og forklare hvordan et program fungerer. Kjenne til forskjeller mellom programmeringsspråk.\r\n- Kan finne frem til å benytte nødvendige hjelpemidler, kan bruke dokumentasjon for programmeringsspråket og standarbiblioteket.\r\n- Være klar over aspekter ved programmering som kan påvirke informasjonssikkerhet."}
,{"norwegian_name": "Informasjonsteknologi, grunnkurs","code":"TDT4105","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet består at to deler: IKT-teori (1\/3) og grunnleggende prosedyreorientert programmering i Matlab (2\/3).\r\n\r\nIKT-teori:\r\n- Grunnleggende om datamaskiners oppbygging og virkemåte.\r\n- Digital representasjon av informasjon.\r\n- Algoritmer.\r\n- Nettverk og kommunikasjon.\r\n- Systemutvikling (software engineering).\r\n\r\nProsedyreorientert programmering:\r\n- Variabler og datatyper.\r\n- Input og output.\r\n- Kontrollstrukturer: Sekvens, valg, og repetisjon.\r\n- Strukturering og oppdeling av programmer; funksjoner som byggeklosser.\r\n- Datastrukturer: Vektorer (lister), tabeller, tekststrenger og poster (structures).\r\n- Filbehandling og persistent lagring av informasjon.\r\n- Rekursjon, sortering og søking.\r\n- Formulering av algoritmer i pseudokode og flytskjema.\r\n- Matlab som programmeringsomgivelse.\r\n","learning_goal":"Kunnskaper: \r\n- Har grunnleggende kunnskap om følgende hovedelementer i informasjons- og kommunikasjonsteknologi (IKT): Datamaskiner, digital representasjon av informasjon, algoritmer, programvare, kommunikasjon og nettverk.\r\n- Har grunnleggende kunnskap om grunnelementene i prosedyreorientert programmering. \r\n- Har grunnleggende kunnskap om prosessen fra problem til fungerende program. \r\n\r\nFerdigheter: \r\n- Kan anvende grunnelementene i praktisk, prosedyreorientert programmering. \r\n- Kan bruke relevante programmeringsverktøy.\r\n- Kan analysere et problem, finne algoritmer og datastrukturer som løser problemet, formulere en løsning som pseudokode eller flytskjema, og programmere og teste en løsning i Matlab. \r\n- Kan gjennomføre mindre programmeringsprosjekter. \r\n- Kan gjøre enkle analyser av virkemåten til IKT systemer. "}
,{"norwegian_name": "Informasjonsteknologi, grunnkurs","code":"TDT4110","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet består at to deler: IKT-teori (1\/3) og grunnleggende prosedyreorientert programmering i Python (2\/3).\r\n\r\nIKT-teori:\r\n- Grunnleggende om datamaskiners oppbygging og virkemåte.\r\n- Digital representasjon av informasjon.\r\n- Algoritmer.\r\n- Nettverk og kommunikasjon.\r\n- Systemutvikling (software engineering).\r\n\r\nProsedyreorientert programmering:\r\n- Variabler og datatyper.\r\n- Input og output.\r\n- Kontrollstrukturer: Sekvens, valg, og repetisjon.\r\n- Strukturering og oppdeling av programmer; funksjoner og moduler.\r\n- Datastrukturer: Lister, tabeller, tekststrenger, mengder, tupler og poster (dictionary).   \r\n- Filbehandling, persistent lagring av informasjon, og unntak (exception).\r\n- Rekursjon, sortering og søking.\r\n- Formulering av algoritmer i pseudokode og flytskjema.\r\n- Python som programmeringsomgivelse.\r\n","learning_goal":"Kunnskaper: \r\n- Har grunnleggende kunnskap om følgende hovedelementer i informasjons- og kommunikasjonsteknologi (IKT): Datamaskiner, digital representasjon av informasjon, algoritmer, programvare, kommunikasjon og nettverk.\r\n- Har grunnleggende kunnskap om grunnelementene i prosedyreorientert programmering. \r\n- Har grunnleggende kunnskap om prosessen fra problem til fungerende program. \r\n\r\nFerdigheter: \r\n- Kan anvende grunnelementene i praktisk, prosedyreorientert programmering. \r\n- Kan bruke relevante programmeringsverktøy.\r\n- Kan analysere et problem, finne algoritmer og datastrukturer som løser problemet, formulere en løsning som pseudokode eller flytskjema, og programmere og teste en løsning i Python. \r\n- Kan gjennomføre mindre programmeringsprosjekter. \r\n- Kan gjøre enkle analyser av virkemåten til IKT-systemer. \r\n"}
,{"norwegian_name": "Programmeringslab for datateknologi","code":"TDT4112","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet skal gi erfaring i programmering og innovasjon, planlegging, utvikling og utprøving av teknologiske løsninger, samt evaluering av disse. Studentene skal jobbe med relevant teknologi og opparbeide mestring og erfaringer som er nyttige for det videre studiet i Datateknologi. ","learning_goal":"Grunnleggende kunnskap i programmering, planlegging av mindre prosjekt,  utprøving og uttesting av egne og andres løsninger. \r\nFerdigheter i å programmere interaktive løsninger som kan inkludere sensorer, bilder, lyd og annet multimedia innhold.  Grunnleggende ferdigheter i å teste ut, vurdere og gi konstruktive tilbakemeldinger til egne og andres løsninger. \r\nGenerell kompetanse i å forholde seg selvstendig og utprøvende til programmering og datateknologi. \r\n"}
,{"norwegian_name": "Datateknologi, programmeringsprosjekt","code":"TDT4113","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet skal gi erfaring i design og programmering av datasystemer som løser rimelig\r\nkomplekse problemer men krever rimelig lite teoretisk forståelse av avanserte \r\ndatavitenskapelig konsepter.  Fokus skal være på bunn-up utvikling og bruken av modularitet og abstraksjon for å bygge stor datasystemer.  Studentene skal lære relevant verktøy for programutvikling og de skal høste nyttig erfaring for \r\nvidere studiet i Datateknologi.","learning_goal":"Grunnleggende kunnskap i programmering kombinert med planlegging og gjennomføring av et programmeringsprosjekt med noe kompleksitet. Ferdigheter i å jobbe strukturert og modulært fra problem til fungerende løsning. Generell kompetanse i prosjektarbeid og selvstendig arbeid i utvikling og  programmering."}
,{"norwegian_name": "Informasjonsgjenfinning","code":"TDT4117","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet tar vare på den delen av informatikkfaget som omfatter automatisk lagring og gjenfinning av dokumenter. I denne sammenhengen inkluderer dokumentbegrepet også lyd og bilde. Emnet inneholder disipliner som filorganisering, queryoperasjoner, dokumentoperasjoner og kunnskapsbasert gjenfinning av tekstuelle og multimedia informasjon.","learning_goal":"Studentene skal lære og forstå prinsipper, teknikker og metoder bak informasjonsgjenfinning."}
,{"norwegian_name": "Algoritmer og datastrukturer","code":"TDT4120","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Metoder for å analysere effektiviteten av algoritmer, splitt- og hersk-teknikker, rekursive løsningsmetoder. Metoder for ordning, søking i og sortering av datamengder. Datastrukturer for effektiv gjenfinning av data, dynamisk programmering og grådighetsalgoritmer. Datastrukturer for etablering av grafer og nettverk, samt metoder for gjennomløping og leting. Algoritmer for å finne beste vei(er) og koplinger (matchinger), spenntrær og maksimal flyt. Teori for problemkompleksitet. Algoritmene uttrykkes mest mulig språkuavhengig.","learning_goal":"Kunnskaper \u0096 kandidaten skal ha kunnskap om:\r\n- Et bredt spekter av etablerte algoritmer og datastrukturer med nytteverdi på tvers av mange fagområder.\r\n- Klassiske algoritmiske problemer med kjente effektive løsninger.\r\n- Komplekse problemer uten kjente effektive løsninger.\r\n\r\nFerdigheter \u0096 kandidaten skal kunne:\r\n- Analysere algoritmers effektivitet for å oppnå best mulig løsning på et gitt problem.\r\n- Formulere et problem så det rasjonelt kan løses av en algoritme.\r\n- Bruke kjente designmetoder for å konstruere nye effektive algoritmer.\r\n\r\nGenerell kompetanse \u0096 kandidaten skal være i stand til:\r\n- Å bruke kjente algoritmer og tilgjengelige programmoduler på nye problemstillinger.\r\n- Utvikle og realisere nye datatekniske løsninger på komplekse problemstillinger med rot i en praktisk virkelighet."}
,{"norwegian_name": "Algoritmekonstruksjon","code":"TDT4125","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Avanserte algoritmiske teknikker, bl.a. for å løse og håndere spesielt vanskelige (for eksempel NP-komplette) problemer.","learning_goal":"Kunnskaper \u0096 kandidaten skal ha kunnskap om:\r\n- Videregående metoder for algoritmekonstruksjon.\r\n\r\nFerdigheter \u0096 kandidaten skal kunne:\r\n- Konstruere effektive algoritmer for algoritmiske problemer.\r\n- Konstruere tilnærmede løsninger for komplekse problemer.\r\n- Konstruere heuristiske løsninger for komplekse problemer.\r\n\r\nGenerell kompetanse \u0096 kandidaten skal være i stand til:\r\n- Å håndtere komplekse algoritmiske problemer, enten ved å konstruere en eksakt eller approksimert algoritme, eller ved å lage en heuristisk løsning.\r\n- Å vise at et problem har høy kompleksitet.\r\n- Å vurdere ulike algoritmiske løsninger opp mot hverandre."}
,{"norwegian_name": "Programmering og numerikk","code":"TDT4127","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet består at to deler: Grunnleggende prosedyreorientert programmering i Python (2\/3) og\r\nnumerikk (1\/3).\r\n\r\nProsedyreorientert programmering:\r\n- Variabler og datatyper.\r\n- Input og output.\r\n- Kontrollstrukturer: Sekvens, valg, og repetisjon.\r\n- Strukturering og oppdeling av programmer; funksjoner og moduler.\r\n- Datastrukturer: Lister, tabeller, tekststrenger, mengder, tupler og poster (dictionary).   \r\n- Filbehandling, persistent lagring av informasjon, og unntak (exception).\r\n- Rekursjon.\r\n- Python som programmeringsomgivelse.\r\n- Behandling av N-dimensjonale matriser\r\n- Plotting av funksjoner\r\n\r\nNumerikk:\r\n- Numerisk integrasjon av funksjoner: Trapes-metoden, Simpsons metode, Adaptiv Simpson metode\r\n- Newtons metode for å finne funksjoners nullpunkt \r\n- Gauss-eliminasjon for å løse lineære ligningssett\r\n- Numerisk løsning av ordinære differensialligninger","learning_goal":"Kunnskaper: \r\n- Har grunnleggende kunnskap om grunnelementene i prosedyreorientert programmering. \r\n- Har grunnleggende kunnskap om prosessen fra problem til fungerende program. \r\n- Har grunnleggende kunnskap om innen numeriske metoder.\r\n\r\nFerdigheter: \r\n- Kan anvende grunnelementene i praktisk, prosedyreorientert programmering. \r\n- Kan bruke relevante programmeringsverktøy.\r\n- Kan analysere et problem, finne prosess og datastrukturer som løser problemet, formulere en løsning som pseudokode eller flytskjema, og programmere og teste en løsning i Python. \r\n- Kan gjennomføre mindre programmeringsprosjekter. \r\n- Kan utføre numeriske beregninger i Python. "}
,{"norwegian_name": "Introduksjon til kunstig intelligens ","code":"TDT4136","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet starter med å beskrive metoder for problemløsning ved hjelp av heuristisk søk i tilstandsrom. Deretter beskrives forskjellige kunnskapspresentasjonsspråk og slutningsmekanismer for maskinell\r\nproblemløsning. Representasjon i form av predikatlogikk, regler, rammer og semantiske nett behandles, og knyttes til hovedformene for resonnering - særlig regelbasert resonnering. Emnet behandler videre arkitekturer som integrerer forskjellige resonneringsmetoder, agentbaserte arkitekturer, samt arkitekturer for interaktiv problemløsning i et menneske-maskin samspill. Det gis anvendelseseksempler underveis for å belyse metodene.","learning_goal":"Emnet skal gi en generell innføring i fagfeltet kunstig intelligens (AI) og dets grunnlag hentet fra matematikk, logikk og kognitive vitenskaper. Fagfeltet sikter mot å realisere aspekter av intelligent adferd i datamaskinsystemer."}
,{"norwegian_name": "Kognitive arkitekturer","code":"TDT4137","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kognitive arkitekturer bidrar til økt integrert forståelse om oppbyggingen av intelligente systemer og hvordan disse interakterer med den eksterne verden.\r\nEmnet tar opp underliggende infrastrukturer og hvordan forskjellige subsystemer samspillerer for å skape en koherent kognisjon.  Det fokuseres blant annet på korttids- og langtids-hukommelse, representasjon av mentale strukturer, funksjonelle prosesser, og læringsmekansimer.  I denne kontekst ser en også på evaluering av brukergrensesnitt som kognitiv kompleksitetsanalyse, og på avansert multimodal interaksjon.","learning_goal":"Kunnskaper: Emnet skal gi studenten en generell innføring i begrepsapparat, metoder og teknikker innen kognitive arkitekturer. \r\nFerdigheter: Studenten skal være i stand til å benytte aktuelle metoder og teknikker.\r\nGenerell kompetanse: Studenten skal skal gjennom praktiske og teoretiske oppgaver forstå og anvende kognitive arkitekturer og ha et helhetlig bilde av intelligente systemer. Kandidaten skal kjenne fagfeltets historikk og grunnlag hentet fra kunstig intelligens, kognitive vitenskaper og bla menneske-maskin interaksjon."}
,{"norwegian_name": "Programvareutvikling","code":"TDT4140","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Programvare-prosesser, Agile Software, prosjektledelse og planlegging, System-modellering og Unified Modeling Language, Architectural Design, Software Design, Software Testing, Software Evolution, Configuration Management, Software gjenbruk, Service Oriented Architecture, Sikkerhet, Software Quality og prosessforbedring.\r\n","learning_goal":"Kunnskap:\r\nStudentene vil få kunnskap om programvareutvikling-konsepter som prosessmodeller, metoder og teknikker for architecture design, testing, planlegging, konfigurasjonsstyring og kvalitetsstyring.\r\n\r\nFerdigheter:\r\nPlanlegge og administrere små programvareutviklings-prosjekter og delta som designer \/ programmerer \/ tester i større programvareprosjekter.\r\n\r\nGenerell kompetanse:\r\nStudentene skal kunne forstå betydningen av programvareutvikling som et yrke. Studentene skal kunne forstå og samtale om komplekse programvareutviklings-prosjekter og tilhørende tekniske og organisatoriske problemstillinger."}
,{"norwegian_name": "Datamodellering og databasesystemer","code":"TDT4145","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende innføring i datamodellering, med vekt på ER-modeller. Relasjonsmodellen, relasjonsalgebra og SQL. Databasekonstruksjon. Normalisering som designteori for relasjonsdatabaser. Andre databasemodeller. Lagringsteknologier, filorganisering og aksess-strukturer. Queryutføring. Databasehåndteringssystemer. Transaksjonsbegreper, samtidig utførelse og sikkerhet mot tap av data. Dataintegritet.","learning_goal":"Kunnskaper: \r\n1. Databasesystemer \u0096 generelle egenskaper og systemstruktur.\r\n2. Datamodellering med vekt på entity-relationship-modeller.\r\n3. Relasjonsdatabasemodellen for databasesystemer, databaseskjema og dataintegritet.\r\n4. Spørrespråk: Relasjonsalgebra og SQL.\r\n5. Designteori for relasjonsdatabaser.\r\n6. Systemdesign og programmering mot databasesystemer.\r\n7. Datalagring, filorganisering og indeksstrukturer.\r\n8. Utføring av databasespørringer.\r\n9. Transaksjoner, samtidighet og robusthet mot feil.\r\n\r\nFerdigheter:\r\n1. Datamodellering med entity-relationship-modellen.\r\n2. Realisering av relasjonsdatabaser.\r\n3. Databaseorientert programmering: SQL, relasjonsalgebra og database-programmering i Java.\r\n4. Vurdering og forbedring av relasjonsdatabaseskjema med utgangspunkt i normaliseringsteori.\r\n5. Analyse og optimalisering av ytelsen til databasesystemer.\r\n\r\nGenerell kompetanse:\r\n1. Kjennskap til anvendelser av databasesystemer og forståelse for nytte og begrensninger ved slike systemer.\r\n2. Modellering av og analytisk tilnærming til datatekniske problemer.\r\n"}
,{"norwegian_name": "Avanserte databasesystemer","code":"TDT4150","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Oppbygning av databasesystemer. Optimalisering av spørringer. Parallelle og distribuerte databasesystemer. NoSQL. Nye database-arkitekturer og spørre-operatorer.","learning_goal":"Kunnskaper: \r\nKandidaten skal ha kunnskap om: \r\n- Optimalisering av spørringer. \r\n- Parallelle og distribuerte databasesystemer. \r\n- Nye database-arkitekturer og spørre-operatorer.\r\n\r\nFerdigheter: \r\n- Være i stand til å utvikle nye metoder innen databaseteknikk basert på kjennskap til eksisterende teknikker.\r\n- Evne til å kunne anvende tilegnet kunnskap til å utvikle helhetlige løsninger der databasesystem\/databaseteknikker inngår."}
,{"norwegian_name": "Datamaskiner og digitalteknikk","code":"TDT4160","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet vil inneholde terminologi, prinsipper og begrep for konstruksjon og virkemåte for ulike typer moderne datamaskiner og annet datateknisk utstyr. Grunnleggende\r\ndigitale sekvensielle kretser inkludert metoder for analyse og konstruksjon av tilstandsmaskiner. Videre hvordan datamaskiner (og andre digitale maskiner) er bygget\r\nopp av kombinatoriske og sekvensielle byggeblokker. Kort historisk oversikt over datateknikkens utvikling. Oppbygging (organisering), virkemåte og realisering av\r\ndatamaskiner og datamaskinsystemer. Datamaskinkonstruksjon på forskjellige nivå, instruksjonsformat, adresseringsmodi, prosessorarkitekturer og -typer. Grensesnitt\r\nmellom maskinvare og programvare, sammenkobling av komponenter, avbrudd, busser, lagerhierarki og hurtigbuffer (Eng. cache). Gjennomgang av sentrale datatekniske\r\nutstyrsenheter (periferi-enheter). Kort introduksjon til distribuerte systemer, innvevde (\"embedded\") systemer, parallelle datamaskiner, nye teknologier og nye\r\nanvendelser (applikasjoner).","learning_goal":"Kunnskaper: \r\n- Studenten skal kjenne til datamaskiners konstruksjon og virkemåte \r\n- Studenten skal forstå prinsippene for konstruksjon og analyse av sekvensielle digitale kretser og tilstandsmaskiner \r\n- Studenten skal forstå hvordan en enkel prosessor fungerer \r\n- Studenten skal forstå grensesnittet mellom programvare og maskinvare \r\n- Studenten skal kjenne til sentrale periferienheter \r\n- Studenten skal forstå hvordan abstraksjon og struktur benyttes for å håndtere kompleksitet i datamaskinsystemer.\r\n\r\nFerdigheter: \r\n- Studenten skal kunne formulere enkle programmer i assemblykode \r\n- Studenten skal være i stand til å anvende digitale kretselement til å konstruere grunnleggende digitale sekvensielle kretser og tilstandsmaskiner \r\n- Studenten skal være i stand til å lese skjemategninger og blokkdiagrammer \r\n- Studenten skal kunne relatere blokkdiagrammer og skjemategninger til hverandre på ulike abstraksjonsnivå. \r\n\r\nGenerell kompetanse: \r\n- Studenten skal forstå den generelle virkemåten til en datamaskin og kunne anvende denne kunnskapen i prosjekter på alle abstraksjonsnivå \r\n- Studenten skal forstå den underliggende digitale logikken som datamaskiner består av.\r\n"}
,{"norwegian_name": "Programmeringsspråk","code":"TDT4165","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Introduksjon til språkparadigmer, semantikk og beregningsmodeller. \r\nSpråkmodeller som støtter deklarativ, funksjonell, logisk, lat, dataflytorientert, distribuert, paralell programmering. \r\nProgrammeringsspråks syntaks, analyse, oversetting, tolking og semantikk.\r\nSammenlikning av egenskaper i språk mht. trygghet, typing, analyserbarhet, kjøretidssystem, semantikk, anvendelsesområde og modularisering. ","learning_goal":"Emnet skal gi: (1) Forståelse for grunntrekkene i imperative, logiske, funksjonelle og objektorienterte programmeringsspråk. (2) Praktisk kjennskap til teknikker for å implementere språk og metoder for å beskrive deres mening. (3) Evne til å forstå og sammenlikne eksisterende og kommende språk."}
,{"norwegian_name": "Metoder i kunstig intelligens","code":"TDT4171","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet er en videreføring av TDT4136 Introduksjon til kunstig intelligens. De tre hovedformene for resonnering (regelbasert, modellbasert, og casebasert) behandles, med hovedfokus på modellbasert resonnering. Resonnering med usikker og delvis manglende informasjon, gis spesiell fokus, samt grunnlaget for lærende systemer (maskinlæring). I tillegg til de symbolprosesserende metodene (spesielt Bayesianske nettverk og beslutningsgrafer) gis det også en innføring i metoder basert på nevrale nettverk.","learning_goal":"Kunnskaper: \r\nKandidaten skal ha kunnskap om: \r\n- Generelle prinsipper for kunstig intelligens (AI)\r\n- Effektiv representasjon av usikker kunnskap \r\n- Prinsipper for rasjonell beslutningstakning\r\n- Lærende\/adapterende systemer.\r\n\r\nFerdigheter: \r\n- Vurdere forskjellige rammeverk for kunstig intelligens i spesifikke brukssituasjoner\r\n- Lage systemer som realiseres aspekter av intelligent adferd i datamaskinsystemer.\r\n\r\nGenerell kompetanse:  \r\n- Kjenne fagfeltet AIs grunnlag hentet fra matematikk, logikk og kognitive vitenskaper.\r\n\r\n\r\n"}
,{"norwegian_name": "Maskinlæring og case-basert resonnering","code":"TDT4173","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet behandler prinsipper og metoder for hvordan datasystemer selv kan oppdatere sin kunnskap og problemløsningsevne. Klassiske metoder for maskinell læring basert på observerte data, samt læring som også utnytter eksisterende kunnskap gjennomgås og analyseres. Hovedvekten legges på symbolprosesserende metoder, der eksplisitte begreper og sammenhenger læres. Andre metoder som omhandles er bl.a. statistiske generaliseringer, ensemble metoder, og dyp læring. Det legges vekt på de enkelte læringsmetoders sterke og svake sider, relatert til ulike mål for læringen.\r\nI case-basert resonnering integreres læring og problemløsning ved at konkrete problemer som løses tas vare på og gjenbrukes ved løsning av nye problemer, jfr. CBR-syklusen. Numeriske og kognitive modeller for similaritetsvurdering gjennomgås, og ulike systemarkitekturer diskuteres. Videre behandles metoder der både case-spesifikk og generell kunnskap integreres i lærings- og problemløsningsfasene.","learning_goal":"Emnet skal gi en innføring i prinsipper og metoder for hvordan datasystemer kan lære av egen erfaring. Det legges vekt på en fundamental forståelse av maskinlæring generelt, som en bakgrunn for ulike spesifikke metoder. I case-basert resonnering vektlegges forståelsen av hvordan maskinlæring og problemløsning integreres."}
,{"norwegian_name": "Informasjonssystemer","code":"TDT4175","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Taksonomier for ulike typer informasjonssystemer, ERP-systemer: typisk funksjonalitet, metodikk ved valg og innføring. IS strategi, prosessforbedring. Arbeidsmetodikk ved utvikling av informasjonssystemer: analyse av organisasjoners behov, modellering av arbeidsprosesser (nåsituasjon og ønsket situasjon), evaluering av kvalitet for modeller og systemer. ","learning_goal":"Kunnskaper:\r\nKandidaten skal ha kunnskap om:\r\n- Relasjon mellom foretningsstrategi, organisasjonsstrategi og IKT-strategi.\r\n- Taksonomier for ulike informasjonssystemer.\r\n- Metodikker for innføring av informasjonssystemer.\r\n- Metodikker for kravinhenting.\r\n- Etikk og bruk av informasjonssystemer.\r\n\r\nFerdigheter:\r\nKandidaten kan:\r\n- Innhente krav for informasjonsystemer\r\n- Modellere foretningsprosesser med bruk av BPMN.\r\n\r\nGenerell kompetanse:\r\nKandidaten kan: \r\n- bidra til konsulentsvirksomhet i forhold til innføring av informasjonssystemer i (store) organisasjoner."}
,{"norwegian_name": "Menneske\u0096maskin-interaksjon","code":"TDT4180","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Introduksjon til begreper, prinsipper og praksis for konstruksjon av brukervennlige menneske-maskin grensesnitt. Oppgaveanalyse, feltstudie-teknikker, scenariebygging, iterative designmetoder, brukbarhetstesting, mentale modeller, metaforbruk, gestaltprinsipper for visuell komposisjon, empiriske og formelle evalueringsmetoder, dialogteknikker, prototypingsteknikker. ISO standarder om brukskvalitet (spesielt ISO 9241-11 og ISO 9241-210). Konstruksjon av grafiske, vindusbaserte grensesnitt med objektorienterte rammeverk. Innføring i vindussystemer.","learning_goal":"Kunnskaper: \r\nEmnet skal gi studenten en innføring i begrepsapparat, metoder og teknikker for brukersentrert design av grafiske brukergrensesnitt. Det skal også gi kunnskap om objekt-orientert konstruksjon av slike.\r\n\r\nFerdigheter: \r\nStudenten skal være i stand til å benytte aktuelle metoder og teknikker for brukersentrert design av grafiske brukergrensesnitt, samt objekt-orientert konstruksjon av slike.\r\n\r\nGenerell kompetanse:\r\nStudenten skal gjennom prosjektarbeidet i emnet ha skaffet seg erfaring med brukbarhetstesting og papirprototyping. "}
,{"norwegian_name": "Operativsystemer","code":"TDT4186","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet vil etablere definisjoner, prinsipper, rammeverk og arkitekturer innen moderne operativsystemer. Emnet vil vektlegge prosesser, trådsystemer, synkronisering, CPU-tildeling, lagertildeling, filsystemer, inn\/utenheter, vranglåshåndtering, multiprosessorsystemer og sikkerhet. Viktige eksempler vil være WINDOWS, UNIX, ANDROID & MAC OS.","learning_goal":"Kunnskaper:\r\nEmnet skal gi studentene en forståelse av hvilke oppgaver et operativsystem løser, hvordan oppgavene løses og gi en forståelse av bruksegenskapene ved et operativsystem. Temaene er operativsystemkjerne, prosesser, tråder, synkronisering, tidsdeling, minnehåndtering, filsystemer, I\/O, vranglåshåndtering, multiprosessorsystemer og sikkerhet.\r\n\r\nFerdigheter:\r\nEmnet skal gjøre studentene i stand til å kunne utnytte operativsystemet effektivt, som systemutvikler, som administrator og som sluttbruker. Studentene skal kunne programmere med tråder og synkronisering.\r\n\r\nGenerell kompetanse:\r\nEmnet skal gi studentene en forståelse av utfordringer med og løsninger for håndtering av ressurser som prosessorer og minne og gjøre studentene i stand til å håndtere grensesnitt som programvare-maskinvare."}
,{"norwegian_name": "Grunnleggende visuell databehandling","code":"TDT4195","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet består av en halvdel med bildesyntese (datagrafikk) og en halvdel med bildeanalyse (bildebehandling). Grafikk: grafiske primitiver, geometriske transformasjoner, betrakningstransformasjoner, elliminering av ikke synlige objekter og flater del I, fargerepresentasjon, belysningsmodeller og algoritmer del I. Lab med C\/C++ og OpenGL. Bildebehandling: eksempler på anvendelser av bildebehandling, lineær filtrering, histogramteknikker, Fouriertransformasjonen, restaurering, segmentering, klassifikasjon, introduksjon til 3D bildevolumer. Lab med C\/C++ eller MATLAB.","learning_goal":"Kunnskaper: Kandidaten vil tilegne seg kunnskaper om prinsipper og algoritmer i grunnleggende bildesyntese og bildeanalyse.\r\n\r\nFerdigheter: Kandidaten vil tilegne seg ferdigheter i grafikkprogrammering og programmering i bildebehandling med verktøy som er i vanlig bruk.\r\n\r\nGenerell kompetanse: Kandidaten vil få kompetanse til å realisere potensialet som ligger i teknikker for grunnleggende grafikk og bildebehandling. Kandidaten vil sitte igjen med en oversikt over feltet visuell databehandling og ha evnen til å bygge betydelige anvendelser innen visuell databehandling og til å utvide sine kunnskaper på feltet."}
,{"norwegian_name": "Parallelle beregninger","code":"TDT4200","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Optimering av algoritmer og program for både en- og flerprosessorsystemer. Valg av numeriske algoritmer, bruk av optimerte bibliotek, kompilatoroptimeringer og profilering av program. Hvordan utnytte PC-klynger og skjermkort for store beregningsoppgaver som ikke kan kjøres på bare en prosessor\/PC vil også bli gjennomgått. Parallellprogrameringsøvinger inngår i emnet.","learning_goal":"Forståelse av parallellprogrammering blir bare viktigere og viktigere ettersom nyere PCer og arbeidsstajoner tar i bruk multicore og multichip flerprosessor teknologi. \r\n\r\nKunnskap:\r\nMålet for dette emnet er derfor: Å gi studentene god forståelse for optimering av serielle algoritmer og program innen beregningsvitenskap (computational science).\r\n\r\nFerdigheter:\r\nUtvikle programeringsferdighetene til studentene på nåtidens og fremtidens flerprosessorsystemer."}
,{"norwegian_name": "Kompilatorteknikk","code":"TDT4205","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Kompilatorer er en nødvendig forusetning for all moderne programvare.  Kompilatorteknikk er et av de områdene i informatikken som tidligst ble modent og fikk en sunn teoretisk og metodisk basis. Elementer av disse teknikkene benyttes også på de fleste andre områder der man gjør inngående analyse av tekster på datamaskin.  Kurset tar opp grammatikker, leksikalsk og syntaktisk analyse, semantisk analyse, optimalisering, kodegenerering, tolkere og abstrakte maskiner, lenking og kjøretidssystemer.  Det legges vekt på konkret utforming av en kompilator som genererer kode for reelle datamaskiner. ","learning_goal":"Kunnskaper:\r\nÅ gi en grundig innsikt i teknikker for konstruksjon av kompilatorer (språkoversettere) og noe kunnskap om hvordan man utformer system-programvare i sin alminnelighet.\r\n\r\nFerdigheter:\r\nUtvikle grundig forståelse for hvordan moderne kompilatorer fungerer. I tillegg til mye programmering i C på øvingene er målet at studentene også sitter igjen med økte programmeringsferdigheter."}
,{"norwegian_name": "Helseinformatikk","code":"TDT4210","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"","learning_goal":""}
,{"norwegian_name": "Web-intelligens","code":"TDT4215","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Forvaltning av kunnskaper i web-baserte løsninger.  Semantisk Web og ontologier. Åpne, lenkede data for deling og samarbeid. Lingvistiske og statistiske teknikker for tekstmining og innholdsanalyse. Semantiske anbefalingssystemer. ","learning_goal":"Kunnskaper: Basisteknikker og semantiske språk for konstruksjon av ontologier og åpne data.  RDF(S) og OWL. SPARQL spørrespråk.  POS\/NER-tagging, sentimentanalyse og andre teknikker i innholdsanalyse.  Innholdsbaserte anbefalingssystemer. \r\n\r\nFerdigheter:  Evne til å bruke semantiske teknologier og åpne data til å analysere ustrukturert innhold på web og lage semantiske anbefalingssystemer og andre intelligente løsninger.  Evne til å definere ontologier som kan utvides og gjenbrukes av andres applikasjoner.\r\n\r\nGenerell kompetanse: Studentene skal få innsikt i hvordan semantikk og åpne data brukes til å ekstrahere, representere og tilgjengeliggjøre kunnskap på web, samt hvordan de kan brukes i intelligente applikasjoner."}
,{"norwegian_name": "Store, distribuerte datamengder","code":"TDT4225","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Introduksjon til store og distribuerte datamengder. Introduksjon til distribuerte teknikker, P2P, tid og koordinering. Moderne, effektive filsystemer med støtte for konsistens. Nøkkel\/verdi-datalagre. Aksessmetoder. Sortering av store datamengder. Utføringsstrategier for relasjonsalgebra. Eksempler på store, distribuerte datalagre\/databaser fra kjente tjenesteleverandører.","learning_goal":"Kunnskaper:\r\n- Kunnskap om distribuerte og store datamengder\r\n- Innsikt i metoder for organisering og søking i store datamengder for hurtig framhenting av informasjon\r\n- Innsikt i metoder for håndtering\/lagring av multidimensjonale data\r\n- Innsikt i metoder for sortering av store datamengder\r\n- Innsikt i utføringstrategier av relasjonsalgebra\r\n- Innsikt i forskjellige eksisternde løsninger brukt til distribuert lagring\r\n\r\nFerdigheter:\r\n- Evaluere eksisterende systemer og løsninger for lagring og forvaltning av data\r\n- Være med på utvikling av nye systemer for lagring og forvaltning av data\r\n\r\nGenerell kompetanse:\r\n- Distribuert systemer\r\n"}
,{"norwegian_name": "Grafikk og visualisering","code":"TDT4230","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Geometriske modeller og forenklinger av dem. Modellering med parametriske kurver og flater. Modellering med flateoppdeling. Hierarkisk modellering av scener. Elliminering av ikke synlige objekter og flater del II. Belysningsmodeller og algoritmer del II. Bruk av teksturer. Strålesporing. Animasjonsteknikker. Generering av skygger. Prinsipper for visualisering. Algoritmer for visualisering.","learning_goal":"Kunnskaper: Kandidaten vil tilegne seg avanserte kunnskaper om prinsipper og algoritmer i grafikk og visualsiering.\r\n\r\nFerdigheter: Kandidaten vil heve sine ferdigheter i programmering innen grafikk og visualisering gjennom arbeid med praktiske oppgaver.\r\n\r\nGenerell kompetanse: Kandidaten skal oppnå en dypere forståelse av avanserte prinsipper og algoritmer i datagrafikk og visualisering. Kandidaten skal forstå potensialet i bruken av datagrafikk og visualisering. Kandidaten skal besitte grunnlaget for ut å utføre forskningsoppgaver eller for å involvere seg i kommersielle anvendelser på feltet."}
,{"norwegian_name": "Programvaresikkerhet","code":"TDT4237","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Kurset fokuserer på sikkerhet i programvare  tar for seg sikkerhet i alle deler av utviklingsprosessen for programvare: kravinnhenting, design, implementasjon og testing. Vi vil i kurset ta for oss hvilke trusler og angrep programvare er utsatt for og hvordan man kan ta i bruk teknikker og forsvarsmekanismer for å utvikle programvare som i størst mulig grad er motstandsdyktig mot eksisterende, og nye, angrep. Kurset har et hovedfokus på web-baserte systemer. ","learning_goal":"Studentene skal i kurset lære om sikkerhet (security) i programvare og hvordan man lager sikrere programvaresystemer."}
,{"norwegian_name": "Programvarearkitektur","code":"TDT4240","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"I emnet lærer studentene å definere og forklare sentrale konsepter innen programvarearkitektur, og å kunne bruke og beskrive design- og arkitekturmønster, metoder for å designe programvarearkitekturer, metoder og teknikker for å oppnå ulike programvarekvaliteter, metoder for å dokumentere programvarearkitekturer, og metoder for å evaluere programvarearkitekturer.\r\nEmnet gir kunnskap om ulike design- og arkitekturmønster for ulike domener, og om programvarearkitektur og dataspill.\r\nEmnet gir også praktisk innføring i bruk av metoder og teknikker relatert til programvarearkitektur gjennom et prosjekt som følger en hel utviklingsprosess, samt implementering av en programvarearkitektur.\r\n","learning_goal":"Kunnskaper:\r\n- Sentrale begreper relatert til programvarearkitektur\r\n- Kvalitetskrav og kvalitetsattributter\r\n- Metoder for evaluering av programvarearkitekturer (ATAM og CBAM)\r\n- Utviklingsprosesser som inkluderer arkitekturdesign\r\n- Ulike arkitekturmønster og designmønster\r\n- Metoder for å designe programvarearkitekturer\r\n- Metoder for å spesifisere kvalitetskrav til et system\r\n- Sammenheng mellom krav, arkitektur, prosess og kvalitet\r\n- Metode for å generere en arkitektur fra et eksisterende system\r\n- Games and software architectures.\r\n\r\nFerdigheter:\r\n- Bruke design- og arkitekturmønster\r\n- Dokumentere kvalitetskrav\r\n- Dokumentere programvarearkitekturer\r\n- Evaluere programvarearkitekturer\r\n- Designe programvarearkitekturer\r\n- Implementere programvarearkitekturer\r\n\r\nGenerell kompetanse:\r\n- Forbedret ferdigheter innen generell systemutvikling\r\n"}
,{"norwegian_name": "Avansert programvareutvikling","code":"TDT4242","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kravspesifikasjon, med fokus på overgang fra brukerkrav til teknisk kravspesifikasjon og tilhørende vurderinger av realiserbarhet og testbarhet. Estimering. Testing, testplanlegging og test-drevet utvikling, ulike testtyper og testteknikker, andre valideringsteknikker, kvalitetssikring og prosessforbedring. Smidige metoder. Utviklingsmetodikk spesifikt for komponentbasert og tjenesteorientert utvikling, outsourcing og offshoring, åpen kildekode og programvare-økosystemer. Metodikk for forvaltning og vedlikehold av store programsystemer, håndtering av legacy-kode. ","learning_goal":"Kunnskaper: Innsikt i moderne prosesser og metoder for utvikling og kvalitetssikring av programvaresystemer, kjenne styrker og svakheter ved ulike teknikker og hvilke som passer å bruke i hvilke situasjoner. Dyp forståelse for koblingen mellom kravspesifikasjon, design og testing.\r\n\r\nFerdigheter: Kunne gjøre gode og velbegrunnede valg av prosesser og teknikker basert på prosjektkontekst. Kunne mestre overgangen mellom ulike deloppgaver og samhandling mellom ulike aktører i programvareutvikling.\r\n\r\nGenerell kompetanse: Evne til å forstå forskningsresultater innen programvareutvikling og kunne nyttiggjøre seg disse i videreutvikling av egen praksis.\r\n"}
,{"norwegian_name": "Samhandlingsteknologi og sosiale medier","code":"TDT4245","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Sosiale medier, datastøttet samarbeid, koordinering, delte arbeidsrom, delte informasjonsrom, samarbeidsstøtte for nomadisk brukere, samarbeidsstøtte i systemutvikling, design og evaluering av samhandlingsteknologi.","learning_goal":"Emnet skal gi studentene innsikt i datastøttet samarbeid og sosiale medier slik at de er i stand til både å vurdere mulige anvendelser og selv kunne anvende teknologien i systembygging og kunnskapsforvaltning."}
,{"norwegian_name": "Avansert programvaredesign","code":"TDT4250","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Generelle teknikker for modellering, design og realisering av modulær programvare, med fokus på industrielle teknikker og anvendelser. Komponentbasert design, komponentbaserte arkitekturer og rammeverk, distribuerte komponentbaserte systemer. Modell-drevet utvikling av programvare, kode-generering og domenespesifikk språk.\r\nTesting, kontinuerlig integrasjon og forvaltning.","learning_goal":"Kunnskaper:\r\nStudenten skal kunne generelle metoder for modellering, design og realisering av modulær programvare og modell-drevet utvikling av programvare, og hvordan disse brukes i ulike faser av utvikling og vedlikehold.\r\n\r\nFerdigheter:\r\nStudenten skal ha praktiske ferdigheter i modellering, design og realisering modulær programvare, med moderne rammeverk og verktøy, også med modell-baserte teknikker.\r\n\r\nGenerell kompetanse:\r\nStudenten skal kjenne til og kunne velge mellom ulike metoder og teknikker for utvikling av modulær programvare."}
,{"norwegian_name": "Virksomhets-arkitektur og -innovasjon","code":"TDT4252","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet fokuserer på rollen som informasjonssystemer har i en organisatorisk sammenheng, både internt i organisasjoner, og der organisasjonene er involvert i digitale økosystem og andre sammarbeidskonstellasjoner. Det vil ta for seg årsakene til at informasjonssystemer er utformet som de er ved å utforske behovene til organisasjoner og brukere, prosesser og dessuten hvilke roller systemene støtter i en organisatorisk og arbeidssammenheng. Det vil bli lagt vekt på hvordan IT kan bidra til innovasjon og verdi gjennom tjenesteutvikling og digital virksomhetsutvikling. Emnet inneholder metoder for virksomhetsmodellering, tjenestemodellering og forretningsmodellering  som vil være komplementære til modellering av datasystemer. Metoder knyttet til modellering og kvalitetssikring av modeller samt virksomhetsarkitektur vil bli presentert.","learning_goal":"Kunnskap: Kandidaten skal etablere teoretisk innsikt i forretnings-modellering, tjenesteinnovasjon, virksomhetsmodellering og metodene for å analysere og modellere organisatoriske situasjoner. \r\n\r\nFerdigheter: Kandidaten skal etablere praktiske ferdigheter i å skape gode forretnings og virksomhetsmodeller som kan øke forståelsen av design av IT systemer og utvide de perspektivene som datasystem-modeller gir. \r\n\r\nKompetanse: Kandidaten skal kunne sette emnet inn i en bredere teknologisk, forretningsmessig og sosial kontekst i forhold til den virkningen informasjonssystemer har i samfunnet.\r\n"}
,{"norwegian_name": "Datamaskinkonstruksjon","code":"TDT4255","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Avanserte emner innen konstruksjon av maskinvare. Konstruksjonsutfordringer som styrende og utførende enhet,  samlebånd og implementasjonsutfordringer som assemblyprogrammering, høynivå-programmering,  maskinvarebeskrivende språk, spesifikasjon, partisjonering, testing og verifisering.\r\nInnebygde systemer, Field-Programmable Gate Arrays (FPGAs) og instruksjonssett for mikroprosessorer.","learning_goal":"Kunnskaper:\r\n- Studenten skal ha grundig forståelse av enkle prosessorers konstruksjon og virkemåte.\r\n- Studenten skal forstå hvordan en prosessor bygges ved hjelp av byggeblokker på forskjellige abstraksjonsnivåer som registre, registerfiler, multipleksere, porter, ALUer, etc.\r\n- Studenten skal kjenne til avanserte teknikker for ytelsesøkning i en skalar prosessorkjerne.\r\n- Studenten skal forstå sentrale avveininger innen utvikling av instruksjonssett.\r\n- Studenten skal ha en grundig forståelse av hurtigbufferes (eng: cache) konstruksjon og virkemåte.\r\n\r\nFerdigheter:\r\n- Studenten skal kunne konstruere enkle prosessorer ved hjelp av et maskinvarebeskrivende språk.\r\n- Studenten skal kunne analysere problemstillinger knyttet til oppbygning av instruksjonssett.\r\n\r\nGenerell kompetanse:\r\n- Studenten skal beherske enkel datamaskinkonstruksjon og kunne anvende denne kunnskapen i prosjekter på alle abstraksjonsnivå."}
,{"norwegian_name": "Digital tjenesteinnovasjon","code":"TDT4257","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Private så vel som offentlige virksomheter leverer i økende grad tjenester heller enn å produsere varer. Eksempelvis handler avis mindre om å produsere et papirprodukt og mer om presentasjon for browser\/ mobil, målrette reklame, etablere nye tilleggstjenester for abonnentene, åpne for anbefalings tjenester basert på brukeroppførsel eller \u0096preferanser.\r\n\r\nIKT kjennetegnes av egenskaper som programmerbarhet, utvidbarhet og lagvis komponerbarhet som inviterer til utvikling av nye tjenester. IKT skaper dermed unike muligheter for tjenesteinnovasjon.\r\n\r\nKurset fokuserer på tre aspekter ved digital tjenesteinnovasjon:\r\n\r\nTjenesteøkosystem (rollefordeling, forretningsmodell, institusjonell ramme)\r\nTjenesteplattform (teknisk plattform, arkitektur, lagdelt modell)\r\nSamskapt verdi (verdi for hvem? opplevd verdi? Sitasjonsavhengig verdi?)\r\n\r\nKurset tar for seg relevante teoretiske begrep og modeller. Kurset diskuterer utvalgte case\/ eksempler\r\n","learning_goal":"Kunnskap: Kandidaten skal etablere dyp kunnskap om begrep for, modeller av og erfaringer med digital tjenesteinnovasjon\r\n\r\nFerdigheter: Kandidaten skal utvikle god evne til å identifisere, utvikle og evaluere nye tjenesteplattformer i virkelighetsnære situasjoner. \r\n\r\nKompetanse: Kandidaten skal etablere tverrfaglig kompetanse for å forstå forretningsmessige, strategiske, teknologiske og sosiale betingelser for å realisere digital tjenesteinnovasjon i praksis. "}
,{"norwegian_name": "Maskinnær programmering","code":"TDT4258","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"(a) Introduksjon: Mikrokontrollere, programvare, programmerbar logikk, perifere enheter. \r\n(b) Maskinvare: Mikrokontrollere og system der mikrokontroller er en sentral komponent eller en alternativ delløsning i systemet. Aktuelle komponenter og system:  AVR-mikrokontroller, PowerPC-prosessor integrert i FPGA, utviklingskort med mikrokontroller\/FPGA,  brikker med mikrokontroller. \r\n(c) Maskinnær programmering: Programmering i system med begrensete ressurser. Kompilatorer, C og assembler. HW\/SW-interaksjoner. Hardkode\/operativsystem for mikrokontrollersystem. \r\n(d) Grensesnitt og periferienheter: Metoder for å bruke eksterne enheter og eventuelle spesielle maskinvareressurser, samt system der prosessorer brukes som en tilleggsressurs.\r\n","learning_goal":"Kunnskaper:\r\n- Studenten skal vite hvordan utvikling for innebygde systemer (Eng. embedded systems) skiller seg fra utvikling for tradisjonelle datamaskiner\r\n- Studenten skal kjenne til forskjellige mikrokontrollere og deres vanlige periferienheter\r\n- Studenten skal kjenne til vanlige teknikker og løsninger innen maskinvarenær programmering og deres fordeler og ulemper\r\n- Student skal vite hvordan vanlige energisparingsteknikker fungerer og deres fordeler og ulemper\r\n\r\nFerdigheter:\r\n- Studenten skal beherske maskinvarenær programmering av mikrokontrollere på ulike abstraksjonsnivå (assembly vs. høynivåspråk  med og uten operativsystem)\r\n- Studenten skal kunne bruke utvalgte energisparingsteknikker \r\n\r\nGenerell kompetanse:\r\n- Studenten skal beherske maskinvarenær programmering og kunne anvende denne kunnskapen i prosjekter på alle abstraksjonsnivå"}
,{"norwegian_name": "Datamaskinarkitektur","code":"TDT4260","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Fundamentale begrep innen datamaskinarkitektur, trender, måling av ytelse, kvantitative prinsipper. Instruksjonssett-arkitektur og kompilatorens rolle. Parallellitet på instruksjonsnivå, hopp-prediksjon, tråd-nivå parallellitet, VLIW og eksempler. Konstruksjon av minne-hierarki, hurtigbuffer, lagringssystemer. Multiprosessorer, trådnivå parallellitet, delt minne arkitekturer, distribuert delt lager, synkronisering, og multithreading. Sammenkoplingsnettverk, topologier, klynger, og eksempel.","learning_goal":"Kunnskaper:\r\n- Studenten skal ha en grundig forståelse av hvordan høynivå byggeblokker som prosessorer av ulik art, hurtigbuffere, sammenkoblingsnettverk (Eng. interconnect), busser, etc. bør settes sammen til et komplett datamaskinssystem.\r\n- Studenten skal ha en grundig forståelse av moderne minnesystemers konstruksjon og virkemåte.\r\n- Studenten skal ha kjennskap til maskinvaresikkerhetstiltak som virtuelt minne og pålitelige maskinvaresoner.\r\n- Studenten skal ha en grundig forståelse av hvordan flere prosessorkjerner kan settes sammen til parallelle datamaskinarkitekturer, deriblant homogene og heterogene flerkjerneprosessorer og multiprosessorer.\r\n- Studenten skal ha kjennskap til hvorledes samspillet mellom arkitektur, systemprogramvare og applikasjon påvirker ytelsen i parallelle datamaskinsystemer.\r\n\r\nFerdigheter:\r\n- Studenten skal kunne evaluere arkitekturvalg ved hjelp av simulatorer og trekke fornuftige konklusjoner basert på disse studiene.\r\n\r\nGenerell kompetanse:\r\n- Studenten skal kunne bruke sin kunnskap om datamaskinarkitektur i utviklingsprosjekter på alle abstraksjonsnivå."}
,{"norwegian_name": "Prototyping av interaktive media","code":"TDT4262","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende begreper om software og hardware; new media art; multimediainnhold som bilder, video og lyd; åpen kildekode og åpent innhold. Sykluser av prototyping og evaluering.\r\nMetoder for å sette sammen hardwarekomponenter som prosessorer, sensorer og aktuatorer, å programmere interaktive atferd, og organisere multimediainnhold som bilder, video og lyd. Grunnleggende evalueringsprosedyrer basert på både estetisk og teknisk kvalitet. Interaktive brukeropplevelser, som immersive spaces, videospill, interaktive kampanjer. ","learning_goal":"Studentene skal lære å: \r\n\r\n- lage neste generasjons interaktive brukeropplevelser\r\n- forstå Internet of Things(IoT)\r\n- sette sammen hardwarekomponenter som prosessorer, sensorer og aktuatorer\r\n- gjøre produkter interaktive og koblet til internett ved å programmere dem\r\n- organisere multimediainnhold som bilder, video og lyd\r\n- bruke åpen kildekode og åpent innhold\r\n- samarbeide om å lage god kode\r\n- lage stadig bedre interaktive produkter med en iterativ designprosess med prototyping og brukertesting\r\n"}
,{"norwegian_name": "Datasyn og dyp læring","code":"TDT4265","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Datasyn danner grunnlaget for en automatisk forståelse av digitale bilder som i dag kan tas opp med mange forskjellige kameraenheter (f.eks. mobiltelefoner, webkameraer, dybde-bilder, MR, Ultralyd...).\r\nInnholdet i kurset varierer fra den klassiske tilnærmelsen til datasyn hvor egenskaper blir trukket ut og klassifisert til mer moderne metoder for bilde forståelse basert på maskin læring og dype nett. Kurset inneholder også en kort gjennomgang av nødvendig programmerings kunnskap og matematikk, i tillegg til basis metoder innenfor bildebehandling\/analyse, dette for at alle skal ha den nødvendige ballast for å gå videre med de mer avanserte delene av kurset. \r\nTemaer som blir adressert i kurset er det menneskelige øye og bildedannelse, filtrering i både romlig og frekvens domenet, hierarkiske strukturer og scale space, principal components analysis (PCA), egenskapsuttrekking (f.eks. Harris, SIFT) og matching (f.eks. RANSAC), unsupervised and supervised klassifisering & gjenkjenning så vel som ulike maskinlæringsmetoder, stereosyn, den essensielle og den fundamentale matrisen, optisk flow og tracking, og sist men ikke minst dype nett for datasyn.\r\nEksempler vil bli hentet fra ulike applikasjonsdomener som medisin, autonomi (droner, biler, skip) & robotikk, industriell inspeksjon osv. ","learning_goal":"Kurset gir en oversikt og forståelse av flere grunnleggende teknikker i Datasyn (Computer Vision). Avansert kunnskap på dette feltet blir stadig viktigere. Dette er spesielt sant i lys av den stadig økende tall av kameraer og annet bildebehandlingsenheter i nesten alle områder av vårt samfunn. Kurset bidrar til å bygge kompetanse for å designe og konstruere datasynsmoduler som fungerer i et totalsystem for å løse relevante problemer.  Bruksområder inkluderer industri anvendelser, autonomi (droner, biler og skip), robotikk og medisinsk bildeanalyse. Disse emnene kan være basis for ansettelse i industri eller offentlig sektor, eller de kan følges videre i forskning på doktorgradsnivå i Norge eller utenlands."}
,{"norwegian_name": "Algoritmer for bioinformatikk","code":"TDT4287","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet tar for seg algoritmiske metoder med anvendelser innen bioinformatikk, med et spesielt fokus på algoritmer og datastrukturer for søk, sammenligning og mønsteroppdaging i strenger. Emnet bruker eksempler på biologiske problemstillinger for å motivere algoritmer og løsninger, men emnets fokus er på de algoritmiske problemstillingene.","learning_goal":"Kunnskap:\r\n- Vet hvordan strengsammenligningsproblem som \"longest common subsequence\", \"edit distance\", \"local alignment\" og \"global alignment\" kan løses ved dynamisk programmering (DP).\r\n- Vet hvordan DP-løsningen for sammenligning av to strenger kan utvides til sammenligning av flere strenger (\"multiple alignment\").\r\n- Vet hvordan k-mer indekser kan brukes for eksakt og approksimativt strengsøk.\r\n- Vet hva et nøkkelordtre er, og hvordan denne indeksstrukturen bygges og brukes for strengsøk.\r\n- Vet hva et suffikstre er, hvordan denne indeksstrukturen kan bygges på lineær tid ved hjelp av Ukkonens algoritme, og hvordan suffikstre kan brukes for å løse ulike strengsøk og -sammenligningsproblem. \r\n- Vet hvordan mønster i strenger kan finnes med eksakte metoder (ved branch-and-bound) og heuristiske metoder (ved simulated annealing). \r\n- Vet sammenhengen mellom sekvenssammenstilling (assembly) og korteste superstreng-problemet og hvorfor Euler-sykel-problemet er et spesialtilfelle av sekvenssammenstilling.\r\n- Vet hva hidden Markov-modeller (HMM) er, hvordan disse kan brukes til å modellere og identifisere egenskaper med strenger, og hvordan de sentrale HMM-algoritmene \"Viterbi\", \"forward\", og \"backward\" fungerer.\r\n- Vet hva en RNA sekundærstruktur er, hvordan denne relateres til palindrom, og hvordan DP kan brukes til å finne optimale og suboptimale RNA sekundærstrukturer.\r\n\r\nFerdigheter:\r\n- Implementere kjente algoritmer og datastrukturer og bruke disse på reelle data.\r\n- Gjenkjenne varianter av kjente problemstillinger og tilpasse kjente algoritmer til å løse disse.\r\n\r\nGenerell kompetanse:\r\n- Vurdere alternativer og velge løsninger som er hensiktsmessige til å løse problemstillinger med reelle data. \r\n- Presentere egne løsninger og resultat muntlig og skriftlig."}
,{"norwegian_name": "Kundestyrt prosjekt","code":"TDT4290","credits":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Hver gruppe får en oppgave fra en kunde\/oppdragsgiver som skal gjennomføres som et prosjekt. Alle faser ved gjennomføring av et IS\/IT prosjekt skal dekkes: forstudie, kravspesifikasjon, konstruksjon, programmering og evaluering, men vekten skal legges på de tidlige fasene. Det er viktig at gruppene har god dialog med kunden. Det skal lages en prosjektrapport og holdes en avsluttende presentasjon og demonstrasjon av et kjørbart program med kunde og sensor til stede. Det er obligatorisk oppmøte til emnets oppstartsmøte som holdes tirsdag i semesterets 2. uke, til gjesteforelesninger og kurset i gruppedynamikk, og til den ukentlige veiledningen. Manglende oppmøte kan medføre at studentene ikke får anledning til å ta emnet.","learning_goal":"Kunnskaper: Å gi studentene praktisk erfaring i å gjennomføre alle faser av et større IS\/IT-prosjekt.\r\n\r\nFerdigheter:  Evne til å organisere og gjennomføre større IS\/IT-prosjekter, samt til å dokumentere og presentere resultatene til en reell kunde.\r\n\r\nGenerell kompetanse: Innsikt i prosjektarbeid og hvordan grupper kan brukes til å løse komplekse, datatekniske problemer."}
,{"norwegian_name": "Datamaskinprosjekt","code":"TDT4295","credits":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Innføring i moderne metoder, teknikker og verktøy for utvikling av datamaskinsystemer. Innledningsvis gis det forelesninger og orienteringer om de verktøy og hjelpemidler som er tilgjengelige i datamaskinlaboratoriet for spesifikasjon, konstruksjon, verifikasjon og utprøving av kretser, kretskort og systemer. Gjennomføring av et realistisk utviklingsprosjekt som gruppearbeid. Arbeidet innebærer spesifikasjon, kretskortutlegg, mikrokontrollerprogrammering, FPGA-utvikling, testing, verifikasjon og dokumentasjon.","learning_goal":"Kunnskaper:\r\n- Studenten lærer designprosessen for et innebygd system. Dette inkluderer utvikling av maskinvarenær programvare, maskinvare og kretskort samt nødvendig dokumentasjon og prosjektstyring.\r\n\r\nFerdigheter:\r\n- Studenten lærer å jobbe i gruppe med en vagt definert problemstilling\r\n- Studenten lærer utvikling, feilsøking og feilretting rettet mot rekonfigurerbar logikk, mikrokontrollere og kretskort \r\n- Studenten lærer feilsøking og feilretting på systemnivå (integrasjon).\r\n\r\nGenerell kompetanse:\r\n- Studenten lærer å jobbe i prosjekt. Dette innebærer å ta valg basert på begrenset informasjon, å leve med disse der de viste seg å være suboptimale og å evaluere valgene når bedre informasjon blir tilgjengelig.\r\n"}
,{"norwegian_name": "Datavarehus og datagruvedrift","code":"TDT4300","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet omhandler metoder og teori for å utvikle datavarehus og utføre dataanalyse vha. datagruvedrift. Datakvalitet og teknikker for preprosessering av data. Modellering og design av datavarehus. Algoritmer for klassifisering, klynging, og assosiasjonsregeldeteksjon. Praktisk bruk av programvare for dataanalyse.","learning_goal":"Kunnskaper: \r\nKandidaten skal ha kunnskap om: \r\n- Preprosessering av data og datakvalitet.\r\n- Modellering og design av datavarehus.\r\n- Generelle algoritmer for datagruvedrift.\r\n\r\nFerdigheter: \r\n- Være i stand til å designe datavarehus.\r\n- Evne til å kunne anvende tilegnet kunnskap til å vurdere data og velge hensiktsmessige metoder for dataanalyse. \r\n"}
,{"norwegian_name": "Big Data-arkitektur","code":"TDT4305","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet tar for seg hovedaspekt ved Big Data. Sentrale tema er rammeverk for Big Data-prosessering (MapReduce, Spark, Storm, etc.), datagruvedrift av Big Data, datastrømmer og analyse av tidsserier, anbefalingssystemer, og analyse av sosiale nettverk. ","learning_goal":"Kunnskaper: \r\nKandidaten skal ha kunnskap om: \r\n- Big Data rammeverk. \r\n- Dataguvedrift av Big Data. \r\n- Prosessering av datastrømmer. \r\n- Analyse av tidsserier.\r\n- Anbefalingssystemer. \r\n- Analyse av sosiale nettverk. \r\n\r\nFerdigheter: \r\n- Forstå problemstillinger rundt Big Data. \r\n- Evne til å anvende tilegnet kunnskap til å vurdere data og velge hensiktsmessige metoder for å prosessere og analysere Big Data."}
,{"norwegian_name": "Intelligent tekstanalyse og språkforståelse","code":"TDT4310","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet omfatter: menneskelige språk og språkbehandling, maskinlæring og statistiske metoder for språkførståelse og tekstanalyse, sentimentanalyse og meninggruvedrift, informasjonaksess og tekstgruvedrift, konverserende agenter, maskinoversettelse, semantikk for naturlige språk, datamaskinell lingvistisk kreativitet.","learning_goal":"Studentene skal ha en grunnleggende og praktisk forståelse av aktuelle rammeverk og metoder for tekstanalyse og naturlig språk-forståelse."}
,{"norwegian_name": "Datateknologi, fordypningsprosjekt","code":"TDT4501","credits":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Prosjektarbeid som omhandler aktuelle problemstillinger i datateknologi.\r\n\r\nOversikt over prosjektoppgaveforslag: http:\/\/www.idi.ntnu.no\/education\/fordypningsprosjekt.php \r\n\r\nFor valg av fordypningsprosjekt og informasjon om praktisk gjennomføring se siden «fordypning i datateknologi» på Innsida: https:\/\/innsida.ntnu.no\/wiki\/-\/wiki\/Norsk\/Fordypning+i+datateknologi\r\n\r\n","learning_goal":"Kunnskap: Innsikt i hvordan forskningsresultater genereres og rapporteres innen valgt spesialområde, forståelse for avansert teori og praksis innen prosjektrapportens tema. Kjenne til viktige prinsipper for forskningsetikk \/ akademisk ærlighet. \r\n\r\nFerdigheter: Evne til å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap og resultater fra egne undersøkelser. \r\n\r\nGenerell kompetanse: Kunne gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en prosjektrapport i hht. gitte retningslinjer."}
,{"norwegian_name": "Datateknologi, fordypningsemne","code":"TDT4506","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Studenten skal velge to tema à 3,75 studiepoeng. \r\nListe over aktuelle tema: http:\/\/www.idi.ntnu.no\/education\/emner.php?&p=alle&v=tema\r\nAndre tema\/emner kan velges etter avtale med instituttet.\r\nRegistrering av fordypning for datateknologi (MTDT\/MIDT) og information systems (MSINFOSYST): https:\/\/innsida.ntnu.no\/wiki\/-\/wiki\/Norsk\/Fordypning+i+datateknologi\r\nRegistering av tema for andre studieprogram og utvekslingsstudenter: www.idi.ntnu.no\/education\/mine_teorimoduler.php","learning_goal":"Kunnskap: Dyp innsikt i et teoretisk emne, fortrinnsvis med sterk relevans til det fordypningsprosjektet som studenten har valgt. \r\n\r\nFerdigheter: Evne til å fordype seg i avansert vitenskapelig litteratur og anvende denne i prosjektforskning og rapportskriving. \r\n\r\nGenerell kompetanse: Evne til å gjøre rede for og diskutere teoretisk kunnskap i relasjon til forskningsprosjekt og i en bredere samfunnskontekst. "}
,{"norwegian_name": "Eksperter i team - ICT-Enabled Social Innovation for Social Good","code":"TDT4850","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name": "Eksperter i team - Storskala CO2-lagring","code":"TDT4855","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name": "Eksperter i team - IT-styring av moderne lastebiler","code":"TDT4856","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjons om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name": "Eksperter i team - Big Data Analytics and Business Intelligence","code":"TDT4857","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjons om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name": "Datateknologi, masteroppgave","code":"TDT4900","credits":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"","learning_goal":"Kunnskap: Innsikt i hvordan forskningsresultater genereres og rapporteres innen valgt spesialområde, forståelse for avansert teori og praksis innen masteroppgavens tema. Kjenne til viktige prinsipper for forskningsetikk \/ akademisk ærlighet. \r\n\r\nFerdigheter: Evne til å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap og resultater fra egne undersøkelser. \r\n\r\nGenerell kompetanse: Kunne gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en masteroppgave i hht. gitte retningslinjer."}
,{"norwegian_name":"Fysikk","code":"TFY4102","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Hovedtema: Dynamikk, bølgefysikk, termodynamikk, elektrisitet. Detaljert innhold: Dynamikk: Kinematikk. Newtons lover. Arbeid og energi. Bølgefysikk: Lydbølger og andre mekaniske bølger. Lys. Termodynamikk: Termisk utvidelse. Varmekapasitet. Termodynamiske prosesser: Adiabatiske prosesser i ideell gass, sykliske varmekraft- og kjøleprosesser. Varmelærens 1. og 2. hovedsetning. Elektrisitet: Elektrisk felt og potensial. Elektrostatisk energi. Strøm i elektriske kretser.","learning_goal":"Overordnet læringsmål: Gjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram.\r\nDetaljerte læringsmål: Gjennom basisemnet i fysikk skal studenten:\r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning).\r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode.\r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser.\r\n- Lære et relevant begreps- og formelapparat.\r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på.\r\n- Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger.\r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning.\r\n- Lære å gjøre rede for grunnleggende fysiske fenomener.\r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse.\r\n- Få trening i å skrive en vitenskapelig rapport."}
,{"norwegian_name":"Fysikk","code":"TFY4104","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Hovedtema: Dynamikk, elektromagnetisme. Detaljert innhold: Dynamikk: Kinematikk. Newtons lover. Arbeid og energi. Dreiemoment. Treghetsmoment. Dreieimpuls. Konserveringslover. Harmonisk svingning, resonans. Elektromagnetisme: Elektrostatikk, magnetisme, elektromagnetisk induksjon, DC- og AC-kretser.","learning_goal":"Overordnet læringsmål: Gjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. Detaljerte læringsmål: Gjennom basisemnet i fysikk skal studenten: - Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning). - Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode. - Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser. - Lære et relevant begreps- og formelapparat. - Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på. - Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger. - Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning. - Lære å gjøre rede for grunnleggende fysiske fenomener. - Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse. - Få trening i å skrive en vitenskapelig rapport."}
,{"norwegian_name":"Fysikk","code":"TFY4106","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Hovedtema: Dynamikk inkl mekaniske bølger, termodynamikk. \r\nDetaljert innhold: Dynamikk: Kinematikk. Newtons lover. Arbeid og energi. Dreiemoment. Treghetsmoment. Dreieimpuls. Svingninger. Resonans. Bølgefysikk: Mekaniske bølger. Lydbølger. Dopplereffekt. Interferens. Termodynamikk: Termisk utvidelse. Varmekapasitet. Varmetransport. Ideell gass. Sykliske varmekraft- og kjøleprosesser. Carnot-prosessen. Varmelærens 1. og 2. hovedsetning.","learning_goal":"Overordnet læringsmål: Gjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. Detaljerte læringsmål: Gjennom basisemnet i fysikk skal studenten:\r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning).\r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode.\r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser.\r\n- Lære et relevant begreps- og formelapparat.\r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på.\r\n- Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger.\r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning.\r\n- Lære å gjøre rede for grunnleggende fysiske fenomener.\r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse.\r\n- Få trening i å skrive en vitenskapelig rapport. "}
,{"norwegian_name":"Fysikk","code":"TFY4109","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Generell innføring i newtonmekanikk inkludert svingninger og mekaniske bølger, samt spesiell relativitetsteori. Newtons bevegelsesligninger. Bevarelse av energi, impuls og dreieimpuls. Mekaniske svingninger. Mekaniske bølger, lyd.  Eksperimentelle arbeidsmåter, metoder for måling av fysiske størrelser, databehandling, tolkning og dokumentasjon. ","learning_goal":"Overordnet læringsmål: \r\nGjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. \r\n\r\nDetaljerte læringsmål: \r\nGjennom basisemnet i fysikk skal studenten: \r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning). \r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode. \r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser. \r\n- Lære et relevant begreps- og formelapparat. \r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på. - Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger. \r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning. \r\n- Lære å gjøre rede for grunnleggende fysiske fenomener. \r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse. \r\n- Få trening i å skrive en vitenskapelig rapport."}
,{"norwegian_name":"Fysikk","code":"TFY4115","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Hovedtema: Mekanikk, varmelære. Detaljert innhold: Mekanikk: Punktpartikkeldynamikk. Statikk og dynamikk for stive legemer. Konserveringslover for energi, bevegelsesmengde og spinn. Svingninger. Varmelære: Varmelærens hovedsetninger. Temperatur, indre energi, entropi. Kinetisk gassteori. Varmetransport (varmeledning, konveksjon og stråling).","learning_goal":"Overordnet læringsmål: \r\nGjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. \r\n\r\nDetaljerte læringsmål: \r\nGjennom basisemnet i fysikk skal studenten: \r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning). \r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode. \r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser. \r\n- Lære et relevant begreps- og formelapparat. \r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på. \r\n- Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger. \r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning. \r\n- Lære å gjøre rede for grunnleggende fysiske fenomener. \r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse. \r\n- Få trening i å skrive en vitenskapelig rapport."}
,{"norwegian_name":"Fysikk ","code":"TFY4125","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Hovedtema: Dynamikk, bølgefysikk, termodynamikk, elektromagnetisme. Detaljert innhold: Dynamikk: Bevegelse. Arbeid og energi. Rotasjon. Dreieimpuls. Bevarelseslover. Bølger og svingninger: Harmonisk bevegelse. Tvungne svingninger og resonans. Harmoniske bølger. Dopplereffekten. Termodynamikk: Kinetisk gassteori. Første og andre hovedsetning. Entropi. Carnotsyklusen. Varmepumpe. Elektromagnetisme: Ladning. Elektrisk potensial. Elektrostatikk og kapasitans. Elektrisk strøm og likestrømskretser. Magnetisk felt. Magnetisk induksjon.","learning_goal":"Overordnet læringsmål: \r\nGjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. \r\n\r\nDetaljerte læringsmål: \r\nGjennom basisemnet i fysikk skal studenten: \r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning). \r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode. \r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser. \r\n- Lære et relevant begreps- og formelapparat. \r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på. \r\n- Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger. \r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning. \r\n- Lære å gjøre rede for grunnleggende fysiske fenomener. \r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse. \r\n- Få trening i å skrive en vitenskapelig rapport."}
,{"norwegian_name":"Termisk fysikk","code":"TFY4165","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Termodynamikkens hovedsetninger. Arbeid, varme og indre energi. Tilstandsligninger, reversible og irreversible prosesser, entropi, termodynamiske potensialer. Maxwells hastighetsfordeling, midlere fri veilengde, varmeledning, diffusjon. Boltzmannfordelingen.","learning_goal":"Emnet skal ved en teoretisk og eksperimentell tilnærming gi studenten en grunnleggende forståelse av hvordan systemer i termisk likevekt kan beskrives med termodynamikk. Dette innebærer hvordan første og andre hovedsetning fører til begrepet entropi og gir sammenhenger mellom termodynamiske størrelser. Videre skal en lære prinsippene for varmekraftmaskiner\/kjølemaskiner, blandinger av forskjellige stoffer, energioverføring ved varmeledning og hvordan partikler på molekylnivå beveger seg (diffunderer) i et medium. Videre skal studentene lære å analysere ulike problemstillinger innen termisk fysikk med matematiske metoder samt IKT-baserte\/numeriske metoder gjennom bruk av Python."}
,{"norwegian_name":"Fysikk 2","code":"TFY4170","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Bølger: Bølgefunksjon; kompleks notasjon; planbølger; kulebølger. Interferens og diffraksjon. Dopplereffekt. Bølgelikning. Mekaniske bølger, lydbølger. Lys. Dispersjon. Bølgefart og gruppefart. Bølgepakker. Fouriermetoder. Båndbredder. Kvantemekanikk: Eksperimentelt grunnlag. Bølger og partikler. Schrödingerlikningen. Bokspotensial. Harmonisk oscillator. Atomfysikk: Atomspektra. En-elektron-atom. Orbitaler. Mange-elektron-atom. Periodesystem for elementene. Materialfysikk: Molekyl og faste stoff. Elektronmodell av metall. Båndmodellen, isolator, halvleder og leder. Halvledermateriale. Dielektriske, optiske og magnetiske materialer. Superledere.","learning_goal":"Studenten skal ha grunnleggende kunnskap om bølger, kvantemekanikk, atomer, molekyler og faste stoff. I delen om bølger inngår kompleks notasjon, planbølger, kulebølger, interferens, diffraksjon, dopplereffekt, bølgeligningen, mekaniske bølger, lydbølger, lys, dispersjon, bølgefart, gruppefart, bølgepakker, Fouriermetoder og båndbredde. Når det gjelder kvantemekanikk skal studenten kunne det eksperimentelle grunnlaget, bølger og partikler, Schrødingerligningen, partikkel i boks, harmonisk oscillator. Innen atom- og molekyl-fysikk skal studenten ha kunnskap om en-elektron-atomer, orbitaler, mange-elektron atom, periodesystemet for elementene. Studenten skal kjenne til elektronmodellen av metall, isolatorer, halvledere og ledere, dielektriske, optiske, magnetiske og superledere innen faste stoffer.\r\n"}
,{"norwegian_name":"Måleteknikk","code":"TFY4185","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Elektroniske kretselementer: Enkle passive kretser. Halvleder kretselementer. Aktive kretser, operasjonsforsterkere. Digitale kretser. Laboratorium i kretsteknikk: Bygging og utprøving av et utvalg av elektroniske kretser. Datamaskinlaboratorium: Simulering av kretser med dataverktøy (PSpice).","learning_goal":"Emnet skal lære studentene å bruke og konstruere elektroniske kretser, spesielt med henblikk på målinger og løsning av måleproblemer.\r\nStudentene skal lære å bygge og analysere passive kretser med hensyn på tidsforløp og frekvensrespons vha regning med komplekse tall.\r\nStudentene skal lære å bygge og analysere aktive kretser basert på operasjonsforsterkere og transistorer, samt analysere disse vha numerisk verktøy. Studentene skal lære å bygge elektroniske kretser for praktiske formål i labben, og skal lære å beherske analoge såvel som digitale\/logiske kretser, samt kjenne til oppbygging av mikrokontrollere. "}
,{"norwegian_name":"Instrumentering","code":"TFY4190","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Datamaskinorientert måleteknikk: Grensesnitt, omformere, sensorer. Tilkobling av måleinstrumenter til datamaskiner. Datamaskin laboratorium: Grafisk programmering med virtuell instrumentering og programmering i LabVIEW. Et utvalg av måle- og styringsoppgaver med bruk av PC. Planlegging av eksperimenter, datapresentasjon og rapportering fra eksperimenter.","learning_goal":"Studenten skal lære prinsipper for og bruk av datamaskinassistert måleteknikk med styring av instrumenter, måleutstyr og datainnsamling. Studenten skal selvstendig kunne bedømme begrensninger som måleutstyr påfører eksperimentene. Studenten skal selvstendig kunne planlegge, gjennomføre og rapportere fra eksperimenter. Laboratorieøvingene skal gjøre studenten i stand til selv å benytte dette i måletekniske anvendelser."}
,{"norwegian_name":"Optikk","code":"TFY4195","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Elektromagnetiske bølger.\r\nGeometrisk optikk. Matrisebeskrivelse av avbildningssystem. Abberasjon.  Bølgeteori og polarisasjon. Optisk bølgeledning og fiberoptikk. Koherens, korrelasjon og interferens. Fourieroptikk og diffraksjon. Optiske avbildningssystemer: øyet, kamera, teleskop, mikroskop. Introduksjon til optisk spektroskopi, lyskilder og lysdeteksjon. ","learning_goal":"Studenten skal få en introduksjon til optikk som fagdisiplin og dens rolle i det moderne samfunnet. \r\n\r\nStudenten skal beherske den geometriske optikktilnærmelsen, inkludert Fermats prinsipp, strålebaneligningen, og paraksial matriseformalisme for brytende og reflekterende optiske flater. Studenten skal få grunnleggende kjennskap til design av optiske systemer og aberrasjon, med vekt på avbildende systemer. \r\n\r\nBølgeoptikkdelen av kurset skal gi studenten solide grunnkunnskaper innen interferometri, koherens, polarisasjon og diffraksjon. Studenten skal kunne analysere og forstå interferens mellom planbølger og kulebølger, refleksjon og transmisjon av planbølger, og optisk bølgeledning innen tynne flater og optiske fibrer. Studenten skal oppnå inngående kunnskap om lysets polarisasjon og dets forandring ved refleksjon og transmisjon, og kunne analysere polarisasjonen i optiske system ved hjelp av Jones-formalismen. \r\n\r\nStudenten vil bli kjent med Fresnels og Fraunhofers diffraksjonsintegral og  deres gyldighetsområder. Studenten skal kunne utlede Braggs diffraksjonslov. Studenten skal kunne grunnleggende Fourieroptikk og bølgebeskrivelsen av bildedannelse, inkludert å bruke konvolusjonsteoremet til å analysere komplekse systemer. Studenten skal forstå sammenhengen mellom pupiller og bølgeoptikk med hensyn til oppløsning og bildekvalitet for optiske system. \r\n\r\nStudenten vil bli introdusert for ulike lyskilder inkludert lasere. Endelig vil studenten få en grundig innføring i optiske bildedannende systemer med vekt på det menneskelige øyet, kamera, teleskop og mikroskop.\r\n"}
,{"norwegian_name":"Optikk, videregående kurs","code":"TFY4200","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet omhandler vekselvirkning mellom lys og materie, avansert beskrivelse av polarisasjon, modellering av klassisk tynnfilmoptikk og en introduksjon til Computational Electro-Magnetics (CEM).\r\nFor ytterligere detaljer, se beskrivelse på engelsk under academic content.","learning_goal":"Emnet skal gi studentene innsikt i vekselvirkningen mellom lys og materie, anvendelse av optiske måleteknikker. Se komplett engelsk beskrivelse under learning outcome."}
,{"norwegian_name":"Kvantemekanikk II","code":"TFY4205","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Approksimasjonsmetoder i kvantemekanikk. Spredningsteori. Atomer og elektroner i magnetfelt. Koherente tilstander. Tetthetsmatrisen. Kvantisert strålingsteori. Kvante-statistikk. Målinger og fortolkninger i kvantemekanikk.","learning_goal":"Etter fullført kurs skal studentene være fortrolige med grunnbegrepene og den matematiske formalismen i kvantemekanikken: lineær algebra og sannsynlighetstolkning, Schrødinger-ligningen, stasjonære og ikke-stasjonære tilstander, rene og blandete tilstander. De skal kunne formulere problemer og løse dem både i Schrødingers formalisme med bølgefunksjoner, i Heisenbergs formalisme med matriser og i Diracs formalisme med ket-vektorer i et abstrakt Hilbert-rom. De skal ha gode regneferdigheter og god forståelse av eksempler som er gjennomgått både i dette kurset og i tidligere kurs i kvantemekanikk.\r\n"}
,{"norwegian_name":"Kvanteteori for mangepartikkelsystemer","code":"TFY4210","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Klein-Gordon og Dirac-likninga. Feltkvantisering. Okkupasjonstals-representasjon for ikkje-relativistiske fermioniske og bosoniske mangepartikkelsystem. Vekselverkande elektrongass. Gittermodellar for fermion og spinn. Spinnbølgjeteori for ferro- og antiferromagnetar. Symmetriar og bevarte storleikar. Brotne symmetriar, Goldstone-moder. Green-funksjonar. Matsubara-formalisme. Mangepartikkel perturbasjonsteori og Feynman-diagram. Diverse bruksdøme.","learning_goal":"Emnet skal gi studentane ei vidareføring og utfylling av stoffet i emna FY2045\/TFY4250 Kvantemekanikk I og TFY4205 Kvantemekanikk II, der teorien blir nytta i atomfysikk, relativistisk kvantemekanikk og faststoffysikk. Studentane skal få kjennskap til sentrale eksempel på  \r\nfeltteoriar og gittermodellar for system av vekselvirkande fermion, boson, og spinn, og lære å bruke relevante teoretiske begrep og metodar til å analysere forskjellige aspekt av desse modellane. Meir spesifikt skal studentane bl.a.: \r\n- lære om relativistisk kvantemekanikk (Klein-Gordon og Dirac-likninga); \r\n- beherske bruk av kreasjons- og annihilasjonsoperatorar for  \r\nfermion- og bosonsystem; \r\n- mestre Fourier- og Bogoliubov-transformasjonar for diagonalisering av kvadratiske Hamilton-operatorar; \r\n- bli introdusert til mangepartikkel Green-funksjonar og korleis desse er relatert til diverse storleikar av interesse; \r\n- få ei innføring i perturbasjonsteori for mangepartikkelsystem, inkludert Feynman-diagram; \r\n- få kjennskap til diverse andre metodar, t.d. spinnbølgjeteori; \r\n- lære om sentrale begrep, inkl. kvasipartiklar, ordensparametrar, (brotne) symmetriar og Goldstone-moder."}
,{"norwegian_name":"Innføring i kvantefysikk","code":"TFY4215","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Innføring i kvantemekanikk. Schrödingerligningen. Kvantemekaniske postulater. Partikkel i boks og brønnpotensial. Harmonisk oscillator. Endimensjonal spredning, tunneleffekt. Dreieimpuls. Hydrogenatomet. Atomer og molekyler. Molekylfysikk.","learning_goal":"Studenten skal: \r\n- kjenne til hovedtrekkene i historikken rundt utviklingen av kvantemekanikken, \r\n- mestre sentrale begrep som operatorer, egenfunksjoner, egenverdier og Schrödingerligningen, og vite hvordan disse inngår i den kvantemekaniske teorien, \r\n- lære hvordan en kan formulere teorien ved hjelp av et sett med grunnpostulater og sentrale teoremer, der utvikling i egenfunksjoner, stasjonære og ikke-stasjonære tilstander og kompatible observable og simultane egenfunksjoner spiller en sentral rolle, \r\n- lære å bruke formalismen, først på enkle endimensjonale systemer som potensialbrønner, harmonisk oscillator og spredning i en dimensjon, senere på tredimensjonale systemer, f.eks tredimensjonal oscillator og hydrogenatomet,\r\n- lære å anvende kvantemekanikk på atomer og molekyler."}
,{"norwegian_name":"Faste stoffers fysikk","code":"TFY4220","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Atomær struktur, krystallografi, symmetrier, orden og uorden. Direkte og resiprokt rom, Brillouin-soner, strukturbestemmelse ved diffraksjon. Gittervibrasjoner, kontinuumstilnærmelsen, fononer, varmekapasitet. Fri elektrongass, Fermi-Dirac fordeling, elektroner i periodiske materialer, nesten-fri-elektron-modeller, energibånd. Intrinsikke og ekstrinsikke halvledere. Kort om magnetisme.","learning_goal":"Studentene skal få grunnleggende innsikt i faste stoffers fysikk. Dette innebærer at studentene skal: \r\n- kunne gjøre rede for krefter og bindinger mellom atomer \r\n- ha grunnleggende kjennskap til krystallsystemer og romlige symmetrier \r\n- kunne redegjøre for hvordan vi studerer krystallinske materialer med diffraksjon, inkludert konsepter som Ewaldkule, formfaktor, strukturfaktor og spredningsamplitude\r\n- kunne utføre strukturbestemmelse på enkle strukturer\r\n- forstå det resiproke rommet som konsept og kunne bruke det som et verktøy\r\n- vite betydningen av Brillouinsoner \r\n- vite hva fononer er, og være i stand til å gjøre estimat av deres dispersive og termiske egenskaper\r\n- kunne regne på termiske og elektriske egenskaper i fri-elektronmodellen \r\n- kunne Blochs teorem og vite hva energibånd er\r\n- kjenne de grunnleggende prinsippene for halvledere, inkludert pn-overganger, og kunne estimere ladningsbærermobilitet og \u0096tetthet\r\n- kunne redegjøre for hva en Fermiflate er, samt hvordan den kan måles \r\n- kjenne til grunnleggende modeller for magnetisme \r\n- kort kunne redegjøre for betydningen av faststoff-fysikk i det moderne samfunnet.\r\n"}
,{"norwegian_name":"Kjerne- og strålingsfysikk","code":"TFY4225","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet beskriver modeller for kjerners oppbygging, generelle egenskaper, reaksjoner og radioaktivitetsprosesser. Videre behandles de forskjellige mekanismer for vekselvirkning mellom ioniserende stråling og materie, og grunnleggende strålingsdosimetri. Emnet inneholder anvendelser som deteksjon av stråling, analytiske metoder, kjernekraft, miljømessige strålingsbelastninger, risikobedømmelse og strålevern.","learning_goal":"Studenten skal ha kunnskap om atomkjerners oppbygging, egenskaper og reaksjoner og tilhørende strålingsegenskaper, samt strålingens vekselvirkningsmekanismer med materie. I dette inngår: modeller for kjerners oppbygging og generelle egenskaper, kjerneprosesser med vekt på alfa-, beta- og gamma-stråling knyttet til sterk, svak og elektromagnetisk vekselvirkning, mekanismer for vekselvirkning mellom ioniserende stråling og materie, strålingsdosimetri, biologiske effekter av ioniserende stråling, strålevern, kjernekraft, fusjonsreaksjoner, samt industrielle og medisinske anvendelser av kjernefysiske metoder og ioniserende stråling.\r\nStudenten skal kunne nyttiggjøre seg tabellverk og databaser for kjernefysiske prosesser og strålings vekselvirkning med materie til å beregne og vurdere forekomst og effekter av kjerneprosesser og ioniserende stråling, samt beregne doser og vurdere helseeffekter av ioniserende stråling. Studenten skal opparbeide ferdigheter i spektroskopisk analyse av beta og gamma radioaktivitet, og strålingens vekselvirkning med materie, basert på bruk av NaI-detektor og høyoppløsnings HPGe detektor koplet til computerbasert mangekanalsanalysator. Studenten skal opparbeide ferdigheter i analyse og tolkning av registrerte strålingsspektra, samt skriftlig formidle resultatet av slike spektroskopiske undersøkelser."}
,{"norwegian_name":"Statistisk fysikk","code":"TFY4230","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Sannsynlighetsfordeling av mikrotilstander i termisk likevekt. Mikrokanonisk, kanonisk og storkanonisk ensemble. Sammenhengen med termodynamikk. Ideell gass, vekselvirkende klassiske gasser. Enkle spinnsystemer. En-dimensjonal Ising-modell i ytre felt. Gittervibrasjoner, fotoner og Plancks strålingslov. Kvante-statistikk. Ikke-relativistiske og relativistiske fermioner og bosoner ved høye og lave temperaturer. Bose-Einstein kondensasjon. Første og andre ordens faseoverganger. Kritiske indekser og skalalover. Bruk av numeriske pakker for simulering og analyse av utvalgte modeller fra statistisk fysikk. ","learning_goal":"Kunnskaper:\r\nEmnet gir studentene en innføring i statistisk fysikk, hovedsaklig for systemer i termisk likevekt. Studenten skal forstå kvantemekanisk og klassisk statistisk mekanikk for ideelle system, og kunne vurdere når kvanteeeffekter er viktig for oppførselen. Studenten skal forstå sammenhengen mellom mikrofysikk og termodynamikk.\r\n\r\nFerdigheter:\r\nStudenten skal kunne utføre kvantitative beregninger på ideelle systemer, kunne formulere modeller for mer realistiske systemer i statistisk fysikk, og kunne bruke standard numeriske pakker for simulering og analyse av slike.\r\n\r\nGenerell kompetanse:\r\nStudenten skal ha bygd grunnlag for videregående fysikkemner, spesielt slike som involverer mangepartikkelfysikk. Studenten skal kunne analysere og debattere samfunnsmessige problemstillinger om energi, miljø og klima basert på fundamentale prinsipper fra termodynamikk og statistisk fysikk."}
,{"norwegian_name":"Numerisk fysikk","code":"TFY4235","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Lineær algebra, endelig differansemetoder, stokastiske metoder, ordinære differensialligninger, partielle differensialligninger, optimalisering, lineær programmering, genetiske algoritmer, simulert størkning, Fouriermetoder, wavelet-analyse, Monte Carlo-metoder, molekylærdynamikk, kvantemekanikk, cellulære automater.\r\n","learning_goal":"Kunnskaper: \r\nStudenten har kunnskap om et utvalg av numeriske metoder og hvordan disse kan anvendes for å løse problemer innen ulike områder av fysikk. \r\n\r\nFerdigheter og generell kompetanse: \r\nStudenten kan, med utgangspunkt i et gitt problem, formulere en strategi for å løse problemet med en eller flere relevante numeriske metoder, konkretisere denne strategien ved hjelp av prosedyreorientert programmering i et egnet programmeringsspråk, kompilere og kjøre programmet, foreta en kritisk analyse av oppnådde resultater, vurdere hvordan resultatene best kan presenteres, og kommunisere sitt arbeid skriftlig i et format som ligger nært opp til standarden for artikler i internasjonale fysikktidsskrifter. \r\n "}
,{"norwegian_name":"Elektromagnetisk teori","code":"TFY4240","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Elektrostatikk. Speilingsmetoden, separasjon av variabler, Green-funksjoner. Multipolutviklinger. Elektrisk felt i stoff. Magnetostatikk. Magnetfelt i stoff. Elektromotorisk kraft, elektromagnetisk induksjon. Maxwells ligninger. Bevaringslover for ladning, energi, impuls og dreieimpuls. Elektromagnetiske bølger. Potensial og felt, gaugetransformasjoner. Stråling fra dipoler og ladninger i bevegelse. Relativitetsteori.","learning_goal":"Kandidaten har videregående kunnskaper om fenomener, beregningsmetoder og teknologiske anvendelser basert på klassisk elektrodynamikk. Kandidaten har styrket sine ferdigheter i såvel analytiske som numeriske metoder."}
,{"norwegian_name":"Faststoff-fysikk, videregående kurs","code":"TFY4245","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Elektrodynamikk, superledning, dielektriske og magnetiske egenskaper, piezoelektrisitet, ferroelektrisitet, dia- og paramagnetisme, ferro- og antiferromagnetisme, magnetisk resonans, redusert dimensjonalitet, struktur, faseoverganger, kritiske fenomener, midlere feltteori, lineær respons-teori, felt og susceptibiliteter, mikroskopisk dynamikk.  \r\n","learning_goal":"Studentene skal: \r\n- Få grunnleggende innsikt i ulike vekselvirkninger mellom faste stoffer og eksterne felt (elektromagnetiske, mekaniske, termiske)\r\n-  Forstå grunnleggende elektrondynamikk i ledende materialer, inklusivt elektrostatisk skjerming, metall-isolator overganger, elektron-elektron og elektron-fonon vekselvirkninger.\r\n- Forstå vekselvirkninger mellom eksterne elektriske felt og interne responsvariabler i faste stoffer, deriblant fonon-foton kobling og plasmaoscillasjoner.\r\n - Tilegne seg kunnskap om ulike eksperimentelle metoder for studier av båndstrukturer, fononer og magnoner.\r\n- Forstå makroskopisk elektrostatisk tilnærming til beregning av lokalt elektrisk felt og dielektriske responsfunksjoner. \r\n- Få innsikt i første- og andre ordens faseoverganger og kritiske fenomener i ikke-ledende, elektrisk ledende og magnetiske materialer.\r\n- Få innføring i Landau-teori, og kobling av eksterne felt og interne responsfunksjoner gjennom faststoff-termodynamikk.   \r\n- Forstå piezo-, pyro- og ferroelektrisitet, ferroelektriske domener og hysterese.\r\n- Tilegne seg grunnleggende kunnskaper om (lavtemperatur) superledning i type I og type II superledere, samt få innføring i ulike teoretiske tilnærminger til superledning (Ginzburg-Landau, BCS). \r\n- Få forståelse for diverse fenomener relatert til superledning, så som Meissner effekten, flukskvantisering, Giæver- og Josephson-tunnelering.\r\n- Få en innføring i diamagnetisk og paramagnetisk repsons i faste stoffer gjennom semi-klassisk tilnærming.\r\n- Forstå magnetiske faseoverganger og magnetiske strukturer (ferromagnetiske, ferrimagnetiske, anti-ferromagnetiske), gjennom mean-field og spinn-bølge modeller.\r\n- Forstå fenomener relatert til magnetiske faseoverganger, så som domenedannelse og hysterese.\r\n- Tilegne seg grunnleggende kunnskaper om magnetisk resonans (NMR). \r\n"}
,{"norwegian_name":"Materialfysikk","code":"TFY4255","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"i) Krystallografi: Elementær innføring. Punkt- og romgrupper. International Tables for Crystallography. ii) Diffraksjon: Kinematisk teori for elektron-, nøytron- og røntgendiffraksjon. Ordnede materialer i polykrystallinsk og en-krystallinsk form. Krystallstrukturbestemmelse. Uordnede materialer. Nano- og mikrostruktur. Småvinkel-spredning. Overflater. iii) Avbildning og spektroskopi:  Elektronmikroskopi, SEM, TEM. Røntgenmikroskopi. iv) Inhomogeniteter: Defekter, dislokasjoner; flerkomponentmaterialer. Fasediagram.\r\nMetodene vil bli illustrert med eksempler, som keramer, halvledermaterialer, organiske strukturer og \"modulerte\" strukturer, overflate-rekonstruksjoner og adsorbater; amorfe stoff, lav-dimensjonale strukturer. Utfellinger. Faseoverganger.","learning_goal":"Studenten skal kunne:\r\n- Forstå betydningen av avanserte karakteriseringsteknikker i nano- og materialvitenskap.\r\n- Tolke to-komponent fasediagrammer for faste løsninger og eutektiske blandinger.\r\n- Forstå punktgrupper, romgrupper og bruken av The International Tables for Crystallography og link gruppeteorie og krystallografi.\r\n- Bruke fourierteknikker og konvolusjonsteoremet for (delvis) krystallinske materialer.\r\n- Gjøre rede for produksjon av og egenskaper til elektron-, røntgen- og nøytronstråling, med tanke på bruk i materialforskning.\r\n- Utføre kinematiske diffraksjonsberegninger av korrelasjoner i rom og tid for materialer med varierende grad av orden.\r\n- Utføre hands-on spredningseksperimenter, inklusive dataanalyser og rapportskriving, på materialer i fast (bulk og overflater)fase.\r\n- Utnytte forskjellene knyttet til spredning ved små og store vinkler.\r\n- Forklare sammenhengen mellom diffraksjon og avbildning, med fokus på transmisjonselektronmikroskopi (TEM).\r\n- Gjøre rede for grunnprinsippene av eksempel spektroskopi teknikker i røntgen- og elektronenstrål.\r\n- Vurdere mulighetene for å benytte de ulike eksperimentelle teknikkene for å angripe strukturrelaterte problemstillinger for en rekke organiske og uorganiske materialer."}
,{"norwegian_name":"Cellebiologi og cellulær biofysikk","code":"TFY4260","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet kan deles i tre områder: \r\n1) Cellens struktur og funksjon som omfatter: cellemembranen og transport over cellemembranen, cellens organeller, kjernen, cytoskjelettet, intracellulær transport og soertering av molekyler, cellesyklus og celledeling, regulering av genekspresjon, cellesignalisering og intracellulær signaloverføring, celle-cellekontakt og ekstracellulær matrix, immunologi.  \r\n2) En kvantitativ beskrivelse av cellulære prosesser som: Transportprosesser: Diffusjon, konveksjon, ionetransport, osmose. Membranpotensial. Mekaniske påkjenninger. Cellekinetikk.  \r\n3) Eksperimentelle metoder, både teoretisk og praktiske laboratorieoppgaver: Celledyrking, ulike former for mikroskopering, fraksjonering, væskestrømcytometri, elektriske egenskaper til membraner.","learning_goal":"Studenten skal ha kunnskap om cellers struktur og funksjon. Dette omfatter: cellemembranen og transport over cellemembranen, cellens organeller, kjernen, cytoskjelettet, intracellulær transport og sortering av molekyler, cellesyklus og celledeling, regulering av genekspresjon, cellesignalisering og intracellulær signaloverføring, celle-celle-kontakt, ekstracellulær matrix, og basiskunnskap innen rekombinant DNA teknologi og immunologi. Studenten skal ha kunnskap om noen sentrale eksperimentelle teknikker både den teoretiske bakgrunnen for teknikkene og praktisk bruk av dem. Cellebiologi er et fag i endring og studentene skal være i stand til å lese og forstå vitenskapelige artikler og oppdatere seg faglig innen cellebiologi. Studenten skal kunne nyttiggjøre seg kunnskapen for å drive god eksperimentell forskning der bruk av celler inngår som en sentral del. Studenten skal ha ferdigheter og beherske sentrale eksperimentelle teknikker, i første rekke lysmikroskopi."}
,{"norwegian_name":"Biofysiske mikroteknikker","code":"TFY4265","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet gir en grundig innføring i virkeprinsippet til et utvalg måleinstrument som er viktige for studier av biologiske makromolekyler, celler og andre myke materialer. Kurset har som målsetting å gi en forståelse av virkeprinsippet til og oppbygning av de essensielle komponentene måleutstyret består av samt en teoretisk og praktisk innføring i hvordan instrumentet opereres, inkludert kalibreringsprosedyrer og vedlikehold. For hvert instrument vil presentasjonen av måleutstyret og dets virkeprinsipp bli etterfulgt av eksempler på nylig publiserte forskningsdata  av høy kvalitet oppnådd ved bruk av instrumentet. ","learning_goal":"Studenten skal ha kunnskap om mekanismer for molekylær eksitasjon og deeksitasjon samt forståelse av vekselvirkningen lys - biologisk prøve.\r\n\r\nStudenten skal ha kunnskap om sentrale teknikker innen lysmikroskopi samt ha praktiske ferdigheter knyttet til bruk av et utvalg av disse teknikkene. Dette innebærer en forståelse av oppbygning, virkeprinsipp samt anvendelsesområde for følgende teknikker: \r\n- Lysfeltmikroskopi med ulike kontrastteknikker (Fasekontrast-, Differensiell interferens kontrast-, Polarisasjons- og Mørkefeltsmikroskopi).\r\n- Epiillumineringsmikroskopi, herunder Fluoresensmikroskopi, Konfokal laser scanning mikroskopi, Multifotonmikroskopi.\r\n- Total indre refleksjons interferens mikroskopi.\r\n- Stimulated emission depletion microscopy (STED).\r\n- Nærfeltmikroskopi.\r\n\r\nStudenten skal ha kunnskap om design og virkeprinsipp for væskestrømscytometri. \r\n\r\nStudenten skal ha kunnskap om virkeprinsippet til følgende detektorer: \r\nDet menneskelige øye, Fotonmultiplikatorrør (PMT), Fotodioder, Videokamera, CCD kamera.\r\n\r\nStudenten skal ha kunnskap om oppbygning, virkeprinsipp og anvendelsesområde for optiske pinsetter. Dette inkluderer forståelse av prosessene som ligger til grunn for fanging av partikler med lys samt forståelse av kraftbestemmelse med optiske pinsetter.\r\n\r\nStudenten skal ha kunnskap om oppbygning, virkeprinsipp og anvendelsesområde for atomær kraft mikroskopi. Dette innebærer kunnskap om intermolekylære krefter, ulike avbildningsmoder samt dynamisk kraftspektroskopi.\r\n\r\nStudenten skal ha kunnskap om elektronmikroskopi benyttet for studier av biologiske prøver. Dette innebærer kuknnskap om vVekselvirkning elektron - biologisk prøve, elektronoptikk, transmisjon elektronmikroskopi (TEM), scanning elektronmikroskopi (SEM), scanningtransmisjons elektronmikroskopi (STEM) samt prepareringsteknikker for elektronmikroskopi.\r\n\r\nStudenten skal ha ferdigheter knyttet til tolkning av og presentasjon av vitenskapelige data oppnådd selv i forbindelse med laboratorieøvelser. Studenten skal ha ferdigheter knyttet til lesning av forskningslitteratur og formidling av denne både skriftlig og muntlig."}
,{"norwegian_name":"Klassisk transportteori","code":"TFY4275","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet dreier seg om sentrale begreper i klassisk transportteori og dens anvendelser.  Følgende tema behandles: stokastiske variabler, Markovprosesser, korrelasjonsfunksjoner, Wiener-Khinchinteoremet, fluktuasjon-dissipasjonsteoremet, Chapman-Kolmogorov-Smoluchowskiligningen, masterligningen, Langevinligningen og diverse såkalte mikroskopiske ligninger for å beskrive partikkeltransport. Hovedvekten vil bli lagt på det fysiske innholdet og noen moderne anvendelser av transportteori i kjemisk reaksjonskinetikk, komplekse nettverk.","learning_goal":"Emnet gir studentene en generell innsikt i fundamentale begreper og prinsipper i klassisk transportteori, samt moderne anvendelser."}
,{"norwegian_name":"Signalanalyse","code":"TFY4280","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kurset fokuserer på grunnleggende verktøy for analyse av analoge og digitale signaler og systemer. Beskrivelse av signaler som funksjon av tid og frekvens. Bruk av Laplace, Fourier og Z-transformer. Grunnleggende analog og digital filterdesign, frekvensrespons, datasampling. Eksitasjon-respons-analyse av lineære systemer. Beskrivelse og analyse av stokastiske signaler og målte signaler med støy, korrelasjoner og energispektrumanalyser. Analyse av signaler og systemer ved hjelp av matematiske metoder som involverer differensial- og integralregning, samt numeriske metoder ved hjelp av Matlab eller python. ","learning_goal":"Studenten skal: 1. Gjennom en kombinert teoretisk og eksperimentell tilnærming til faget oppnå grunnleggende forståelse for signalanalyse, samt med teoretisk og matematisk kunnskap for å beskrive signaler og systemer, analyse av målesignaler og tidsrekker.  2. Lære å analysere ulike problemstillinger innen signalanalyse med matematiske metoder som involverer differensial- og integralregning,  samt IKT-baserte\/numeriske metoder gjennom bruk av Matlab eller python. "}
,{"norwegian_name":"Laserfysikk og ulineær optikk","code":"TFY4291","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Fysiske prinsipper laser, ikke-lineære optikk, laser fysikk og samspillet av vekselvirkning mellom lys og materie.  For ytterligere detaljer, se beskrivelse på engelsk under academic content.","learning_goal":"Kunnskapsmål\r\nStudentene skal:\r\n- være fortrolige med virkemåte og oppbygning av lasere \r\n- vite om egenskapene til laserstråling, og hvordan laserstråler propagerer gjennom optiske materialer og komponenter\r\n- kjenne til forskjellige lasertyper\r\n- være fortrolige med hvordan andreordens ulineær respons i krystaller kan brukes til å konvertere laserstråling fra en bølgelengde til en annen. Det vil legges vekt på intuitiv forståelse gjennom enkle matematiske beskrivelser\r\n\r\nFerdighetsmål\r\nStudentene skal kunne:\r\n- beregne egenskaper til sortlegemestråling ved forskjellige temperaturer\r\n- estimere linjebredder og effektive tverrsnitt for ulike overganger\r\n- bruke matriseoptikk til å beregne strålegang gjennom optiske komponenter\r\n- beregne stabilitetsområder, linjebredder, og resonansfrekvenser til optiske resonatorer\r\n- beregne terskler og uteffekter i forskjellige lasermedier, og estimere pulsenergier og pulsvarigheter i Q-svitsjede lasere\r\n- beregne hvordan dispersjon påvirker ultrakorte laserpulser i optiske materialer\r\n- beregne hvordan gaussiske stråler propagerer i fritt rom\r\n- beregne fasetilpasningsvinkler og parametriske forsterkningsbåndbredder for andreordens ulineariteter\r\n"}
,{"norwegian_name":"Kvanteoptikk","code":"TFY4292","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet danner en basis for den kvantemekaniske beskrivelsen av optikk, lasere og koherente optiske prosesser. Tema som dekkes inkluderer: lysets kvantemekaniske natur, fotoner, fotondeteksjon, koherente og \"squeezed\" tilstander, lasere og ikkelineær optikk. Videre beskrives eksperimentelle teknikker i kvanteoptikk, som enkelt-frekvens-lasere, enkelt-foton-kilder, foton-tellere, \"squeezed\" tilstand generatorer. Framtidige realiseringer av kvantedatamaskiner, teleportering og kryptografi vil bli diskutert.","learning_goal":"Etter å ha fullført emnet forventes det at studenten har oversikt over fagfeltet kvanteoptikk - er i stand til å formulere og behandle matematiske beskrivelser av grunnleggende fenomener i kvanteoptikk, ved hjelp av det kvantiserte elektromagnetiske felt - er i stand til å formulere og behandle matematiske beskrivelser av kvanteoptisk koherens og inkoherens, samt åpne kvantesystemers dynamikk - er i stand til å forstå hvordan moderne eksperimenter i kvanteoptikk gjennomføres, spesielt med tanke på fotondeteksjon, samt beregninger, kryptografi og teleportering innenfor kvantemekanikkens rammer."}
,{"norwegian_name":"Energi- og miljøfysikk","code":"TFY4300","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Jordas energibudsjett, drivhuseffekt, strålingspådrag, atmosfæriske forandringer på grunn av antropogen virksomhet.  Metoder og det fysiske grunnlaget for å utnytte tradisjonelle (fossile brensler og kjernekraft) og fornybare energikilder (sol, vind, biomasse, havbølger, tidevann og geotermisk energi). ","learning_goal":"Studentene skal kunne beskrive og forklare opphavet til globale effekter på miljøet som skyldes menneskelige aktiviteter. Studentene skal kunne beskrive det fysiske grunnlaget for utnyttelse av ulike energikilder, og kunne bruke dette til vurdering av de ulike energiteknologiene (potensiale, fordeler og ulemper). Studentene skal også kunne beskrive energiteknologiene og gjøre beregninger av virkningsgrad\/utbytte for dem."}
,{"norwegian_name":"Ikkelineær dynamikk","code":"TFY4305","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Grafiske løsningsmetodar for ikkje-lineære differensiallikningar. Faseportrett, fikspunktanalyse, bifurkasjonar, grensesyklar, kaotiske attraktorar, Poincare- og Lorenz-avbildningar, fleirskala-perturbasjonsteori. Iterative avbildningar. Periodedobling, kaos, skalering og universalitet. Fraktalar.  Fysiske eksempel.          ","learning_goal":"Emnet er ein introduksjon til ikkjelineære system og kaos. Studenten skal ha grunnleggjande kunnskap om ikkjelineære differensiallikningar og iterative avbildningar. Studenten skal vere istand til å finne fikspunkt og avgjere om dei er stabile eller ustabile, analysere dei ulike typane bifurkasjonar i ein dimensjon (sadelnode, transkritisk og høygaffel)og to dimensjonar (homoklinisk, degenerert og Hopf), \r\nkonstruere bifurkasjonsdiagram og stabilitetsdiagram. For todimensjonale system skal studenten i tillegg kunne lage faseportrett og finne nedslagsfelt. Studenten skal i tillegg ha kunnskap om grensesyklar og stabiliteten deires.\r\nStudenten skal kunne analysere diskrete avbildningar, finne fikspunkt\r\nog forstå mekanismen for periodedobling. Studenten skal kjenne til dei viktigaste fraktalane, og dei topologiske og metriske eigenskapane deires. Likeeins skal studentane kjenne til dei viktigaste bisarre\r\nattraktorane i kaotiske system med diskret og kontinuerleg tid.\r\nStudentane skal få trening i å leggje fram øvingsoppgåver på tavla\r\nog løyse ikkjelineære problem med numeriske metodar. \r\n"}
,{"norwegian_name":"Molekylær biofysikk","code":"TFY4310","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet fokuserer på anvendelse av utvalgte tema innen fysikk, for å beskrive molekylære egenskaper til biologiske molekyler og systemer, og noen av de mest brukte teknikkene som brukes for å bestemme disse egenskapene. ","learning_goal":"Etter gjennomført emne skal studenten være i stand til:\r\n\r\n- Å beskrive hovedtypene av intra- og intermolekylære vekselvirkninger, og forklare hvordan disse påvirker (i) konformasjon og andre dynamiske egenskaper til makromolekyler, og (ii) vekselvirkningene mellom makromolekyler og andre stoffer i vannløsning.\r\n\r\n- Å forklare teorien bak de viktigste teknikkene som brukes til å studere fysikalske, termodynamiske, hydrodynamiske og spektroskopiske egenskaper, samt spredningsegenskaper, til biologiske molekyler og molekylære systemer, samt å angi fordeler og ulemper knyttet til disse teknikkene.\r\n\r\n- Å forutsi og diskutere anvendbarheten av de studerte teknikkene på et utvalg av biofysiske systemer.\r\n\r\n- Å bruke et utvalg av instrumentelle oppsett, tolke oppnådde data, og oppsummere resultatet i skriftlige rapporter."}
,{"norwegian_name":"Strålingsbiofysikk","code":"TFY4315","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en innføring i sentrale temaer innen energideponering i biologiske materialer ved bestråling med ioniserende stråling, inkludert: direkte og indirekte effekter av stråling, strålingsindusert DNA-skade og \u0096reparasjon, mekanismer for celledød etter stråling, kvantitative modeller for celledød og \u0096overlevelse, dose-respons-relasjoner, tumor- og normalvevsresponser, hovedprinsipper for bruk av ioniserende stråling i kreftbehandling, de 5 R'ene bak rasjonalet om fraksjonering, tid-dose-fraksjonering, terapeutisk ratio, den lineær-kvadratiske modell, modeller for tumorkontrollsannsynlighet- og normalvevs komplikasjonssannsynlighet, dose-rate-effekt, volumeffekt, oksygeneffekt, tumormikromiljø og hypoksi, kombinasjon av stråling med kjemoterapi og biologisk målrettede medikamenter, strålesensibiliserende og -beskyttende forbindelser, hypertermi, proton- og ioneterapi. \r\n\r\n","learning_goal":"Studenten opparbeider inngående kunnskap om vekselvirkning mellom ioniserende stråling og biologisk materiale, med hovedvekt på mekanismer for induksjon og reparasjon av strålingsinduserte molekylære og cellulære effekter, samt bruk av ioniserende stråling i kreftbehandling.\r\n\r\nStudenten opparbeider ferdigheter i bruk av ulike matematiske modeller for estimering av strålingsindusert celledød og celleoverlevelse. \r\n\r\nStudenten opparbeider ferdigheter innen tolkning og presentasjon av vitenskapelige data ervervet gjennom praktiske laboratorieoppgaver og gruppearbeid. Studenten opparbeider ferdigheter innen lesing og presentasjon av forskningslitteratur. \r\n\r\n"}
,{"norwegian_name":"Fysikk i medisinsk avbildning","code":"TFY4320","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Apparatur for nukleærmedisinsk bildediagnostikk, emisjons-tomografi (SPECT, PET). Apparatur for røntgen-diagnostikk, digital radiografi, transmisjonsdatatomografi (CT). Anvendelser av ultralyd i medisinsk diagnostikk. Magnetresonans-tomografi (MRI). Teoretisk beskrivelse av bildedannelse, støy i medisinske bilder, rekonstruksjonsalgoritmer for tomografi, medisinsk bildebehandling. Kvalitetssikring i medisinsk bildediagnostikk. \r\n","learning_goal":"Studentene skal ha kunnskap om fysiske prinsipper og metoder som anvendes i medisinsk diagnostikk basert på medisinsk avbildning. Dette omfatter å kunne forklare prinsipper og framgangsmåter for computerbasert tomografi (CT) ved nukleærmedisinsk avbildning, røntgenavbildning og avbildning ved magnetisk resonans. Studenten skal også kunne redegjøre for ulike former for ultralydavbildning, og hvordan slik avbildning prinsippielt er forskjellig fra avbildningsprinsippene ved CT.\r\nStudenten opparbeider ferdigheter i å vurdere ytelsesparametre, anvendelsesområder, samt fordeler og ulemper ved de ulike formene for medisinsk avbildning.\r\n"}
,{"norwegian_name":"Nanoverktøy","code":"TFY4330","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet behandler karakteriserings- og strukturingsteknikker med en høy romlig (mindre enn 100 nm) oppløsning, som er relevant for nanoteknologi. Aktuelle teknikker kan være sveipe- og transmisjonselektronmikroskopi, focused ion beam og atomkraftmikroskopi.\r\nI tillegg blir bilde- og databehandling diskutert. Teori og teknikker blir anvendt i labøvinger.\r\n\r\n","learning_goal":"Etter kurset skal studenten være i stand til å trekke ut og validere eksperimentelle resultater fra diskuterte teknikker. Resultatene kan bli innhentet selv eller av andre.\r\nStudenten skal kunne planlegge og optimalisere et typisk eksperimentelt oppsett som brukes i nanoteknologi, basert på gitt oppgave eller forkunnskap."}
,{"norwegian_name":"Bionanovitenskap","code":"TFY4335","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet vil behandle oppbyggingen av biologiske molekyler med særlig fokus på strukturell form, dannelse, bio-identifikasjon og selvorganisering. Biofysikalske fenomen av betydning innenfor bionanovitenskap som Brownske bevegelser, diffusjon, transport, intermolekylære prosesser, cooperativ transitions, enkle polymer kjeders egenskaper, molekylære maskiner og motorer, nanoroboter vitenskap og science fiction& vil bli diskutert. Videre vil anvendelse av biologiske molekyler og prosesser i utvikling av sensorer og komponenter, for eksempel bionanosensorer, elektroniske komponenter for interaksjon med celler, mikro- og nanofluidkomponenter bli behandlet.\r\n","learning_goal":"Etter fullført kurs skal studenten kunne: \r\n\r\n(1) bruke forenklede fysiske modeller for å beskrive ulike prosesser som er viktig for forståelsen av cellulære funksjoner. Spesielt, forstå fysiske krefter nødvendig for å forstå og beskrive intermolekylære krefter, betydningen av entropi, elektrostatiske vekselvirkninger i løsning, entropi krefter, transport fenomena som diffusjon og betydningen av brownske bevegelser\r\n(2) vite hvordan man kan beskrive, modellere og måle mekaniske egenskaper til polymer kjeder og intermolekylære vekselvirkninger, forstå hvordan inter- og intra-molekylære vekselvirkninger påvirker mekaniske egenskaper til biopolymerer, proteiner og nukleær syrer\r\n(3) forstå egenskapene til vann på micro- og nanometer skala, noe som er viktige for cellulære funksjoner og design av biosensorer; forstå  konseptet av mikrofluid devices og fysiske fenomener som er viktige for deres funksjon. Være i stand til å designe og lage enkle \"mikrofluidic devices\"\r\n(4) forstå hvordan levende organismer omgjør kjemisk energi til mekanisk arbeid\r\n(5) implementere noen av de fysiske modellene diskutert i kurset til datasimuleringer i Matlab\r\n"}
,{"norwegian_name":"Nanofysikk","code":"TFY4340","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Nanoteknologi gjør det mulig å lage elektroniske kretser på en lengdeskala der både partikkel- og bølgeegenskapene til elektronene er viktige. Dette har banet veien for oppdagelsen av en rekke nye fysiske effekter der noen brukes i moderne nanoelektronikk. Dette kurset vil ta for seg noen av de mest sentrale nano-skala-fenomenene, der både klassisk fysikk og kvantemekanikk benyttes i forståelsen. Aktuelle tema er bl.a: kvantisert konduktans, Coulomb-blokkade, Büttiker-Landauer-formalisme, svak lokalisering, universelle konduktansfluktuasjoner, kvante-Hall-effekt, Aharonov-Bohm-effekt, gigantisk magnetmotstand, grafen.","learning_goal":"Studenten skal, med relativt enkle fysiske modeller anvendt på nye eksperimentelle resultater, lære hvordan grunnleggende fysikk kan brukes til å beskrive og forstå oppførselen til elektroner i nano-skala materialer. Kurset vil forhåpentlig motivere for både teoretisk og eksperimentell fordypning av elektrontransport i nanomaterialer.\r\nKunnskaper: Studenten skal kjenne til sentrale effekter og fenomener relatert til elektrontransport i nanofysikk.\r\nFerdigheter: Studenten skal lære å analysere effekter og fenomener i nanofysikk med bruk av grunnleggende klassisk fysikk og kvantemekanikk, standard matematiske metoder og enkle numeriske beregninger.\r\nGenerell kompetanse: Studenten lærer å søke opp, lese og formidle litteratur nær forskningsfronten i nanofysikk."}
,{"norwegian_name":"Klassisk mekanikk","code":"TFY4345","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Føringer og generaliserte koordinater. Virtuelle forskyvninger, Lagranges ligninger. Variasjonsregning, Hamiltons prinsipp. Lagrangefunksjon for partikkel i elektromagnetisk felt. Bevegelseskonstanter og symmetriegenskaper. Virialteoremet. Sentrale krefter. Litt om stive legemers kinematikk og dynamikk. Spesiell relativitetsteori. Normalkoordinater. Hamiltons ligninger. Kanoniske transformasjoner. ","learning_goal":"Etter å ha gjennomført emnet skal studenten kunne:\r\n- Forklare nytten av å utnytte symmetrier og bevaringslover i fysiske systemer samt kunne benytte seg av disse i praktiske beregninger. Dette inkluderer roterende og oscillerende systemer.\r\n- Kjenne til ulike problemløsningsstrategier innenfor mekanikk samt vurdere hvilken av disse strategiene som er mest hensiktsmessig å bruke for et gitt problem.\r\n- Forstå det fysiske prinsippet bak utledningen av Lagrange's og Hamilton's likninger samt fordelene med disse formuleringene.\r\n- Presentere de grunnleggende prinsippene i spesiell relativitetsteori og kunne bruke Lorentztransformasjoner samt 4-vektor formalisme i konkrete beregninger som for eksempel partikkelkollisjoner. "}
,{"norwegian_name":"Nanoteknologi, introduksjon","code":"TFY4350","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Undervisningen omfatter en analyse av problemstillinger som har anvendelse innen forskjellige områder som nanomaterialer, bionanoteknologi, nanoelektronikk. Det vil bli lagt vekt på å identifisere felles teknologier av betydning for å forstå mulighetene ved nanoteknologi. Videre vil en innføring i HMS og etiske spørsmål knyttet til nanoteknologi bli diskutert. ","learning_goal":"Emnet gir en innføring i sentrale tema innen nanoteknologi, med fokus på hvordan denne tverrfaglige teknologien kan fremme innsikt og nye produkter.\r\n\r\nKunnskaper:\r\nForstå muligheter og begrensninger av nanoteknologi i bionanoteknologi, nanoelektronikk og nanostrukturerte materialer. Forstå etiske dilemma innen nanoteknologi.\r\n\r\nFerdigheter:\r\nUtføre enkle beregninger for å løse og analysere utvalgte problemer innen nanoteknologi.\r\n\r\nGenerell kompetanse:\r\nSamarbeide for å løse oppgaver.\r\nMuntlig presentere resultater av egne studier.\r\n "}
,{"norwegian_name":"Biofysikk, fordypningsprosjekt","code":"TFY4500","credit":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Fordypningsprosjektet innebærer et arbeid tilsvarende 15 sp. Institutt for fysikk legger fram prosjektoppgaver som er relevante for studieretningen Biofysikk og medisinsk teknologi.","learning_goal":"Studenten skal lære å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap. Videre skal studenten lære å gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en prosjektrapport i hht. vedtatte standarder. Studenten skal også få trening i muntlig presentasjon av eget arbeid."}
,{"norwegian_name":"Biofysikk, fordypningsemne","code":"TFY4505","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"I samråd med sin veileder på fordypningsprosjektet velger studenten et emne på masternivå (eller høyere) som (normalt) støtter faglig opp om temaet i fordypningsprosjektet. Et alternativ til et ordinært masteremne på 7,5 sp er å velge moduler på til sammen 7,5 sp fra følgende liste:\r\nFY8408 Innføring i MR-avbildning (3,75 sp) som ordinært emne.\r\nTFY1a Videregående emner innen MRI og PET (3,75 sp).\r\nTFY4265 Biofysiske mikroteknikker (7,5 sp) som ordinært emne, eller\r\nTFY2a Lysmikroskopi og optiske teknikker (3,75 sp),\r\nTFY2b Teknikker for enkeltmolekylstudier (3,75 sp).\r\n(Man kan ikke ta både TFY2a og TFY2b, da må man heller ta TFY4265)\r\nFY8409 Klinisk fysikk for stråleterapi (3,75 sp) som ordinært emne.\r\nFY8412 Ioniserende stråling \u0096 vekselvirkningsmekanismer og dosimetri (3,75 sp).\r\n\r\nFor nærmere beskrivelse av temaene, se nettsiden http:\/\/www.ntnu.edu\/physics\/courses\/specialmodules.\r\nAktuelle tema fra TFY4525 Bionanoteknologi, fordypningsemne kan også velges.","learning_goal":"Emnet skal gi studentene fordypning i aktuelle problemstillinger innen biofysikk og medisinsk teknologi. Dette vil normalt være problemstillinger som er relevante for det valgte fordypningsprosjektet. Forøvrig henvises det til læringsmålene som er spesifisert for det enkelte emnet."}
,{"norwegian_name":"Fysikk, fordypningsprosjekt","code":"TFY4510","credit":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Fordypningsprosjektet innebærer et arbeid tilsvarende 15 sp. Institutt for fysikk legger fram prosjektoppgaver som er relevante for studieretningen Teknisk fysikk.","learning_goal":"Studenten skal lære å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap. Videre skal studenten lære å gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en prosjektrapport i hht. vedtatte standarder. Studenten skal også få trening i muntlig presentasjon av eget arbeid."}
,{"norwegian_name":"Fysikk, fordypningsemne","code":"TFY4515","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"I samråd med sin veileder på fordypningsprosjektet velger studenten et emne på masternivå (eller høyere) som (normalt) støtter faglig opp om temaet i fordypningsprosjektet. Et alternativ er å velge såkalt(e) spesialmodul(er), se http:\/\/www.ntnu.edu\/physics\/courses\/specialmodules. Aktuelle tema fra TFE4575 Fysiske metoder for nanostrukturering og karakterisering, fordypningsemne, kan også velges.","learning_goal":"Emnet skal gi studentene fordypning i aktuelle problemstillinger innen fysikk. Dette vil normalt være problemstillinger som er relevante for det valgte fordypningsprosjektet. Forøvrig henvises det til læringsmålene som er spesifisert for det enkelte emnet."}
,{"norwegian_name":"Nanoteknologi, fordypningsprosjekt ","code":"TFY4520","credit":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Fordypningsordningen er satt sammen av et prosjektarbeid med belastning 15 sp samt fordypningsemne på 7,5 SP. Prosjektarbeidet vil vanligvis være knyttet til pågående forskningsprosjekter relatert til nanoteknologi ved instituttet. Det legges vekt på at studentene skal lære å arbeide systematisk innenfor det aktuelle tema, samt lære å skaffe seg detaljkunnskaper gjennom litteraturstudier og praktisk arbeid.","learning_goal":"Studenten skal lære å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap. Videre skal studenten gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en prosjektrapport i hht. vedtatte standarder. Studenten skal også få trening i muntlig presentasjon av eget arbeid."}
,{"norwegian_name":"Bionanoteknologi, fordypningsemne","code":"TFY4525","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet består av moduler utført ved NTNU Nanonolab innen følgende teknikker:\r\n\r\n- HMS kurs NTNU NanoLab\r\n- SEM grunnkurs\r\n- Litografi \r\n- Mikrofluidics\r\n- Partikkelsyntese\r\n- Partikkelkarakterisering\r\n- Atomærkraft mikroskopi\r\n- Biofunksjonalisering (Surface plasmon resonance)\r\n\r\n","learning_goal":"Studentene skal ha kunnskap om HMS aspekter knyttet til arbeid i renrom og nanoteknologisk forskning. Studentene skal videre ha kunnskap om virkemåten til utvalgte teknikker for forskning innenfor bionanoteknologi. Studentene skal ha videregående kunnskap innenfor faglig domene av valgbart tema. Studentene skal ha ferdigheter til å selvstendig kunne benytte utvalgte state-of-the art eksperimentelle teknikker til bionanoteknologisk forskning og skriftlig kunne kommunisere det faglige innholdet i dette.\r\n\r\n"}
,{"norwegian_name":"Fysikk, prosjekt","code":"TFY4560","credit":15.0,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emne for studenter med spesielle behov for tilpasset prosjekt, typisk av hensyn til hjemmeinstitusjonens krav.","learning_goal":""}
,{"norwegian_name":"Eksperter i team - Aluminium for en lettere verden","code":"TFY4851","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name":"Eksperter i team - Myke teknologier","code":"TFY4852","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name":"Eksperter i team - Nanoteknologi","code":"TFY4853","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name":"Fysikk, masteroppgave","code":"TFY4900","credit":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Veiledet forskningsprosjekt på 30 sp innen fysikk eller fysikkbasert vitenskap.","learning_goal":"Kunnskaper: \r\nStudenten skal oppnå dybdekunnskap innen fagområdet for masteroppgaven.\r\nFerdigheter:\r\nStudenten får trening i systematisk innhenting av informasjon gjennom bl.a. litteratursøk. Studenten får trening i å planlegge og gjennomføre et større selvstendig forskningsprosjekt med bruk av vitenskapelige arbeidsmetoder. Studenten lærer å skrive en omfattende vitenskapelig rapport.\r\nGenerell kompetanse:\r\nStudenten får trening i å kommunisere om faglige problemstillinger."}
,{"norwegian_name":"Nanoteknologi, masteroppgave","code":"TFY4905","credit":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Veiledet forskningsprosjekt på 30 sp innen nanoteknologi.","learning_goal":"Kunnskaper: Studenten skal oppnå dybdekunnskap innen fagområdet for masteroppgaven. Ferdigheter: Studenten får trening i systematisk innhenting av informasjon gjennom bl.a. litteratursøk. Studenten får trening i å planlegge og gjennomføre et større selvstendig forskningsprosjekt med bruk av vitenskapelige arbeidsmetoder. Studenten lærer å skrive en omfattende vitenskapelig rapport. Generell kompetanse: Studenten får trening i å kommunisere om faglige problemstillinger."}
,{"norwegian_name":"Biofysikk, masteroppgave","code":"TFY4910","credit":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Veiledet forskningsprosjekt på 30 sp innen biofysikk eller medisinsk teknologi.","learning_goal":"Kunnskaper: Studenten skal oppnå dybdekunnskap innen fagområdet for masteroppgaven. Ferdigheter: Studenten får trening i systematisk innhenting av informasjon gjennom bl.a. litteratursøk. Studenten får trening i å planlegge og gjennomføre et større selvstendig forskningsprosjekt med bruk av vitenskapelige arbeidsmetoder. Studenten lærer å skrive en omfattende vitenskapelig rapport. Generell kompetanse: Studenten får trening i å kommunisere om faglige problemstillinger."}
,{"norwegian_name":"Matematikk 1","code":"TMA4100","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Grenser, kontinuitet, derivasjon og integrasjon av funksjoner av én variabel. Skjæringssetningen, sekantsetningen (middelverditeoremet), maksima og minima, transcendente funksjoner, implisitt derivasjon, relaterte vekstrater, ubestemte former, Newtons metode. Riemann-summer, bestemt integral og analysens fundamentalteorem, integrasjonsteknikker og numerisk integrasjon. Areal, volum, buelengde, og areal av rotasjonsflater. Følger, rekker og potensrekker. Taylorrekker, Taylors formel. Førsteordens separable og lineære differensialligninger. Eulers metode. Eksempler på matematisk modellering og anvendelser innenfor naturvitenskap, teknologi og økonomi.","learning_goal":"1. Kunnskap. Studenten forstår og kan gjenkjenne og anvende grunnleggende begreper, resultater og metoder fra envariabel matematisk analyse som omhandler grenser, kontinuitet, derivasjon, integrasjon, konvergens av følger og rekker, Taylor-polynom og Taylor-rekker. Studenten forstår og kan anvende grunnleggende numeriske metoder for løsning av ikke-lineære ligninger, differensialligninger og integrasjon. Studenten kjenner til hvilke muligheter og begrensninger som ligger i bruk av matematisk programvare.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om énvariabel matematisk analyse til å formulere og løse enkle problemer i matematikk og  naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare."}
,{"norwegian_name":"Matematikk 2","code":"TMA4105","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Romkurver. Funksjoner av flere variable. Taylors setning i to dimensjoner, maksima og minima i flere variable, Lagranges multiplikatormetode. Dobbelt- og trippelintegral, linje- og flateintegral. Vektoranalyse. Greens, Stokes' og Gauss' teoremer. ","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra flervariabel matematisk analyse. Herunder multippel integrasjon, linjeintegral, flateintegral og vektoranalysens integralteoremer.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om flervariabel analyse til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
,{"norwegian_name":"Matematikk 3","code":"TMA4110","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Komplekse tall og kompleks eksponentialfunksjon. Lineære differensialligninger av andre orden. Lineære ligningssystemer, Gauss-Jordan-eliminasjon, redusert trappeform, matrisealgebra, determinanter. Vektorrom, underrom, lineær avhengighet og uavhengighet. Indreprodukt, ortogonalitet, ortogonale projeksjoner, Gram-Schmidts ortogonaliseringsalgoritme og minste kvadraters metode. Egenverdier og egenvektorer, diagonalisering, symmetriske matriser og kvadratiske former. Førsteordens systemer av differensialligninger.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra lineæralgebra i Euklidske rom og system av differensialligninger. \r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om lineæralgebra og system av differensialligninger til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
,{"norwegian_name":"Matematikk 3","code":"TMA4115","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Komplekse tall og kompleks eksponentialfunksjon. Lineære differensialligninger av andre orden. Lineære ligningssystemer, Gauss-Jordan-eliminasjon, redusert trappeform, matrisealgebra, determinanter. Vektorrom, underrom, lineær avhengighet og uavhengighet.   Indreprodukt, ortogonalitet, ortogonale projeksjoner, Gram-Schmidts ortogonaliseringsalgoritme og minste kvadraters metode. Egenverdier og egenvektorer, diagonalisering, symmetriske matriser og kvadratiske former. Førsteordens systemer av differensialligninger.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra lineæralgebra i Euklidske rom og system av differensialligninger. \r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om lineæralgebra og system av differensialligninger til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
,{"norwegian_name":"Matematikk 4K","code":"TMA4120","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Komplekse funksjoner, kompleks integrasjon, Laurentrekker og residueregning. Laplacetransformasjon og løsning av ordinære differensial- og integralligninger. Fourierrekker, Fouriertransformasjon og løsning av lineære partielle differensialligninger.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra kompleks funksjonsteori, teorien for Fourierrekker, Fouriertransformasjonen \r\nog Laplacetransformasjonen. Spesielt i forbindelse med løsning av ordinære og partielle differensialligninger.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om kompleks funksjonsteori, integraltransformasjoner og differensialligninger til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
,{"norwegian_name":"Matematikk 4N","code":"TMA4125","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Fourierrekker, Fouriertransformasjon og løsning av lineære partielle differensialligninger. Laplacetransformasjonen og løsning av ordinære differensial- og integralligninger. Numeriske metoder: Interpolasjon, derivasjon og integrasjon. Teknikker for løsning av lineære og ikkelineære ligningssystem. Runge-Kutta-metoder for løsning av system av ordinære differensialligninger. Differensmetoder for løsning av partielle differensialligninger. Innføring i beregningsverktøy med eksempler.\r\n","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra teorien for Fourierrekker, Fouriertransformasjonen, Laplacetransformasjonen, ordinære og partielle differensialligninger og numerisk løsning av ligningssystem og differensialligninger. \r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om Fourierteori, ordinære og partielle differensialligninger og numerikk til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
,{"norwegian_name":"Matematikk 4N","code":"TMA4130","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Laplacetransformasjonen og løsning av ordinære differensial-og integralligninger. Fourierrekker, Fouriertransformasjon og løsning av lineære partielle differensialligninger. Numeriske metoder: Interpolasjon, derivasjon og integrasjon. Teknikker for løsning av lineære og ikkelineære ligningssystem. Runge-Kutta-metoder for løsning av system av ordinære differensialligninger. Differensmetoder for løsning av partielle differensialligninger. Innføring i beregningsverktøy med eksempler.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra teorien for Fourierrekker, Fouriertransformasjonen, Laplacetransformasjonen, ordinære og partielle differensialligninger og numerisk løsning av ligningssystem og differensialligninger.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om Fourierteori, ordinære og partielle differensialligninger og numerikk til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare."}
,{"norwegian_name":"Matematikk 4D","code":"TMA4135","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Partiellderiverte. Laplacetransformasjonen og løsning av ordinære differensial- og integralligninger. Fourierrekker, Fouriertransformasjonen og løsning av lineære partielle differensialligninger. Diskret Fouriertransformasjon. Numeriske metoder: Interpolasjon, derivasjon og integrasjon. Teknikker for løsning av lineære og ikkelineære ligninger. Runge-Kutta-metoder for løsning av system av ordinære differensialligninger. Differensmetoder for løsning av partiell differensialligninger. Innføring i beregningsverktøy med eksempler.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra teorien for Fourierrekker, Fouriertransformasjonen, Laplacetransformasjonen, ordinære og partielle differensialligninger og numerisk løsning av ligningssystem og differensialligninger.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om Fourierteori, ordinære og partielle differensialligninger og numerikk til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare."}
,{"norwegian_name":"Diskret matematikk","code":"TMA4140","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet gir en innføring i matematisk logikk og mengdelære, og elementær tallteori \r\nmed modulær aritmetikk. Andre sentrale tema er: Følger, rekurrensrelasjoner, matematisk induksjon og kombinatoriske tellemetoder med anvendelser. I tillegg gis en innføring i teorien for relasjoner,  grafer og trær, samt formelle språk, grammatikker og endelige automater.","learning_goal":"1. Kunnskap. Studenten har grunnleggende kunnskaper innen matematisk logikk, mengdelære og kombinatoriske tellemetoder.  Studenten har kjennskap til elementær tallteori, inkludert det kinesiske restteorem og Fermats lille teorem. Studenten har kunnskap om rekursjon og \r\ninduksjon, samt om relasjoner, grafer og trær. Studenten har også grunnleggende kunnskaper om formelle språk, grammatikker og endelige automater.\r\n\r\n2. Ferdigheter. Studenten kan gjøre praktisk bruk av elementær logikk og mengdelære, kan bruke Euklids algoritme, og behersker modulær aritmetikk. Studenten kan løse systemer av lineære kongruenser ved hjelp av det kinesiske restteorem, kan føre enkle induksjonsbevis og kan gjenkjenne, forstå og bruke begreper som relasjoner, grafer og trær i anvendelser, f.eks. innen informasjonsteknologi. Videre kan studenten anvende kombinatoriske tellemetoder til å løse praktiske problemer, og kan gjøre praktisk bruk av endelige automater."}
,{"norwegian_name":"Lineære metoder","code":"TMA4145","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Lineære og normerte rom. Kompletthet, Banachrom og Banachs fikspunktteorem.  Picards teorem. Lineære transformasjoner. Indreproduktrom, projeksjoner og Hilbertrom.  Ortogonale utviklinger og approksimasjoner. Lineære funksjonaler, duale rom og Riesz' representasjonsteorem. Spektralteoremet, Jordan kanonisk form, og matrisedekomposisjoner.","learning_goal":"1. Kunnskap. Studenten har kunnskap om sentrale begreper i teorien om vektorrom, normerte rom og Hilbertrom. I teorien for vektorrom er hovedmålet at studenten forstår overgangen fra Euklidske rom til generelle vektorrom.  Dette inkluderer forståelse av isomorfier og basiser i endeligdimensjonale vektorrom og forholdet mellom lineærtransformasjoner og matriser.  Studenten er kjent med matrisefaktoriseringsprinsipper.  I teorien for normerte rom er det et primært mål at studenten forstår Banachs fikspunktteorem. Dette inkluderer kunnskap om konvergens av følger og kontinuerlige funksjoner. Studenten behersker de grunnleggende begreper fra teorien for Hilbertrom, inkludert ortogonalitet, nærmeste punkt og dualitet. Studenten forstår Riesz' representasjonsteorem.\r\n\r\n2. Ferdigheter. Studenten er i stand til å anvende sine kunnskaper om teorien for  vektorrom, normerte rom og Hilbertrom til å løse konkrete problemer.  En nøkkelferdighet er at studenten kan kombinere resultater og konstruere nye beviser ut fra den teorien de har tilegnet seg i kurset.\r\n"}
,{"norwegian_name":"Algebra ","code":"TMA4150","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir eksempler på aksiomatisk oppbygging av matematikken, og emnet tar opp grupper, undergrupper, homomorfier av grupper, sykliske grupper, permutasjonsgrupper, endelige abelske grupper, fundamentalteoremet for endelig abelske grupper, normale undergrupper, faktorgrupper, gruppevirkninger på en mengde, Sylowteori, elementær ringteori og endelige kropper, vektorrom over vilkårlige kropper, elementær tallteori med anvendelser på lineære kongruenser og hemmelige koder.\r\n","learning_goal":"1. Kunnskap. Studenten kjenner til grunnleggende begreper og metoder i gruppeteorien, inkludert normale undergrupper og faktorgrupper, permutasjonsgrupper og sykliske grupper. Studenten har kunnskap om klassifisering av sykliske grupper og av abelske grupper, om Lagranges og Cayleys teorem, samt Burnsides teorem om gruppevirkninger. Studenten kjenner til det fundamentale isomorfiteoremet for gruppehomomorfier, samt Sylowteoremene. Studentenl kjenner også til grunnleggende begreper fra elementær ringteori, med vekt på kommutative ringer, og kroppsteori, med vektorrom over vilkårlige kropper. Studenten skal ha kjennskap til anvendelser av gruppeteori for telleresultater og tallteori for hemmelige koder (RSA). Studenten skal ha kunnskap om aksiomatisk oppbygging av matematikken, samt logiske grunnbegreper og bevisstrukturer. \r\n\r\n2. Ferdigheter. Studenten kan gjenkjenne gruppe- og ringstrukturer og gruppevirkninger, og være i stand til analysere enkle egenskaper ved disse. Videre behersker studenten teorien bak anvendelser av gruppeteori på telleresultater og tallteorien for hemmelige RSA-koder. I tillegg kan studenten føre elementære matematiske bevis. "}
,{"norwegian_name":"Kryptografi","code":"TMA4160","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet gir en innføring i moderne kryptografi og algebraen som ligger til grunn. Det gis en kort oversikt over klassiske chiffer og moderne symmetrisk kryptografi og algebraen som ligger bak. Algoritmer for primtallstesting. Grunnleggende algoritmer for beregning av diskrete logaritmer i vilkårlige sykliske grupper. Indeks-kalkulus-algoritmer for å beregne diskrete logaritmer i endelige kropper. Elliptiske kurver over endelige kropper. Algoritmer for faktorisering av heltall. Latticer og LLL-algoritmen. Diffie-Hellman, offentlig-nøkkel-kryptering (ElGamal, RSA, lattice-basert), digitale signaturer (RSA, Schnorr).\r\n","learning_goal":"1. Kunnskap. Studenten har oversikt over algebraen som ligger til grunn for moderne symmetrisk og asymmetrisk kryptografi, og en viss kjennskap til klassisk og moderne symmetrisk kryptografi. Studenten skal ha kjennskap til teorien for beregninger i generelle endelige sykliske grupper, endelige kropper, elliptiske kurver og latticer. Studenten har også kjennskap til motivasjonen for, bruken av og angrep på asymmetrisk kryptografi, samt kjenne til de viktigste systemene.\r\n\r\n2. Ferdigheter: Studenten behersker de viktigste algoritmene for å beregne diskrete logaritmer i generelle endelige sykliske grupper, endelige kropper, de viktigste faktoriseringsalgoritmene, og algoritmer for å avgjøre om heltall er primtall. Studenten kan anvende teorien for nullpunkter til polynomer over endelige kropper til å resonnere om sikkerheten til relevante kryptosystemer. Studenten har opparbeidet seg en intuisjon for hvordan man angriper forskjellige kryptosystemer."}
,{"norwegian_name":"Differensialligninger og dynamiske systemer","code":"TMA4165","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en innføring i differensialligninger og dynamiske systemer med vekt på analytiske og kvalitative metoder for lineære og ikke-lineære differensialligninger. Temaer som behandles: Lineære og ikke-lineære systemer, eksistens og entydighet, kontinuerlig avhengighet, faseplansanalyse, likevektspunkter, grensesykler, stabilitet, Lyapunovs direkte metode, indeksteori, Poincaré-Bendixsons teorem og eksempler på anvendelser. Spesialpensum som kan variere fra år til år kan være bifurkasjoner, diskrete dynamiske system og kaos, emner fra variasjonsregning og klassisk mekanikk.","learning_goal":"1. Kunnskap. Studenten har kunnskap om grunnleggende begreper og metoder fra teorien for differensialligninger og dynamiske systemer, inkludert analytiske og geometriske teknikker for å studere kvalitative egenskaper ved løsningene. Spesielt har studenten kjennskap til lineære og ikke-lineære systemer, eksistens og entydighet, kontinuerlig avhengighet, faseplansanalyse, likevektspunkter, grensesykler, stabilitet, Lyapunovs direkte metode, indeksteori, Poincare-Bendixsons teorem, spesialpensum og eksempler på anvendelser.\r\n\r\n2. Ferdigheter. Studenten kan anvende sine kunnskaper til å studere konkrete eksempler. Studenten mestrer sentrale bevisteknikker og kan anvende disse på beslektede problemer.\r\n"}
,{"norwegian_name":"Fourieranalyse","code":"TMA4170","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet skal gi studentene en grundig innføring i analytiske og anvendte metoder innen Fourieranalysen. Temaer som behandles: Fourierrekker; innføring i distribusjonsteorien eller Lebesgueintegralet og teorien for Hilbertrom; Fourierintegralet; konvolusjon; diskret Fouriertransform; hurtig Fouriertransform; signalbehandling og filterteori; anvendelser i matematikk eller teknologi, som f.eks.  bildebehandling. ","learning_goal":"1. Kunnskap. Studenten har kunnskap om begreper og metoder fra Fourieranalysen, som spesifisert under \u0094faglig innhold\u0094.  \r\n\r\n2. Ferdigheter. Studenten kan anvende sine kunnskaper i Fourieranalyse til å løse matematiske og teknologiske problemer.\r\n"}
,{"norwegian_name":"Kompleks analyse","code":"TMA4175","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en innføring i grunnleggende teori for kompleks integrasjon, konforme avbildninger og harmoniske funksjoner. Utvalgte videregående emner som f.eks. analytisk fortsettelse, analytisk tallteori, harmoniske funksjoner, interpolasjon og approksimasjon, og anvendelser innen fluidmekanikk.","learning_goal":"1. Kunnskap. Studenten har kunnskap om sentrale begreper og idéer i kompleks analyse, blant annet potensrekker, kompleks integrasjon, konforme avbildninger og harmoniske funksjoner. Videre kjenner studenten til utvalgte videregående emner som f.eks. analytisk fortsettelse; analytisk tallteori; meromorfe funksjoner; interpolasjon og approksimasjon; anvendelser innen fluidmekanikk.\r\n \r\n2. Ferdigheter. Studenten kan anvende sine kunnskaper i kompleks analyse til å løse matematiske og naturvitenskapelige\/teknologiske problemer."}
,{"norwegian_name":"Optimering I","code":"TMA4180","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Første og andre ordens nødvendige og tilstrekkelige (Karush-Kuhn-Tucker) optimalitetsbetingelser for ubegrensede og begrensede optimeringsproblemer i endelig-dimensjonale vektorrom.  Grunnleggende konveksanalyse og Lagranges dualitetsteori og deres anvendelser for optimeringsproblemer og algoritmer.   Oversikt over moderne optimeringsteknikker og algoritmer for glatte problemer (inklusive line-search\/trust-region, kvasi-Newton, indre punkt og aktive sett metoder, SQP og augmented Lagrangian teknikker). Grunnleggende metoder for derivat-fri og ikke-glatte optimeringsproblem.\r\n","learning_goal":"Studenten som møter læringsmålene for kurset skal kunne:\r\n(i) vurdere eksistens og entydighet av løsninger til et gitt optimeringsproblem;\r\n(ii) validere konveksitet av funksjoner, sett, og optimeringsproblemer;\r\n(iii) utlede nødvendige og tilstrekkelige optimalitetsbetingelser for et gitt optimeringsproblem;\r\n(iv) løse små optimeringsproblemer analytisk;\r\n(v) forklare de underliggende prinsipper og begrensninger av moderne teknikker og algoritmer for optimering;\r\n(vi) anslå konvergenshastigheten og kompleksitetskrav i ulike optimeringsalgoritmer;\r\n(vii) implementere optimeringsalgoritmer på en datamaskin;\r\n(viii) bruke optimeringsalgoritmer for å løse modellproblemer i ingeniør- og realfag.\r\n"}
,{"norwegian_name":"Optimering II","code":"TMA4183","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Eksempler på optimale kontrollproblemer for partielle differensialligninger (PDEer). Eksistens av optimale løsninger. Kontroll-tilstandsoperatorer og adjungerte tilstander. Første og andre ordens optimalitetsbetingelser.  Kontroll av lineære og semilineære elliptiske PDEer.  Resultater fra funksjonsanalyse (adjungerte operatorer, deriverbarhet i Banachrom) og PDEer (svake løsninger, Sobolevrom). Grunnleggende numeriske metoder.","learning_goal":"Studenten som møter læringsmålene for kurset skal kunne: (i) analysere kontroll-tilstand operatører for modell kontroll problemer; (ii) utlede nødvendige og tilstrekkelige optimalitetsbetingelser for optimal kontroll problemer med eller uten tilstandsbegrensninger; (iii) vurdere eksistens av løsninger til modell optimal kontroll problemer; (iv) implementere optimeringsalgoritmer på en datamaskin; (v) bruke optimeringsalgoritmer for å løse modellproblemer"}
,{"norwegian_name":"Kodeteori","code":"TMA4185","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en innføring i algebraisk kodeteori for lineære blokkoder, sykliske koder og konvolusjonskoder, samt i den underliggende matematikken. Blant annet behandles følgende temaer: Skranker for kodeparametere; egenskaper, koding og dekoding for Hamming-koder;\r\nReed-Muller-koder; BCH-koder og Reed-Solomon-koder;\r\nBerlekamp-Massey-algoritmen og Viterbi-algoritmen for bruk i dekoding.\r\nEndelige kropper. Lineæralgebra over endelige kropper.  Potensringer. Undervises annethvert år, neste gang vår 2019.","learning_goal":"1. Kunnskap. Studenten kjenner egenskaper ved og algoritmer for koding og dekoding av lineære blokkoder, sykliske koder og konvolusjonskoder. Studenten har oversikt\r\nover teorien for aritmetikk i endelige kropper, lineæralgebra over endelige kropper og potensringer.\r\n\r\n2. Ferdigheter: Studenten behersker aritmetikk i endelige kropper og lineæralgebra over endelige kropper. Studenten kan bruke forskjellige algoritmer og teknikker for koding og dekoding av koder."}
,{"norwegian_name":"Introduksjon til topologi","code":"TMA4190","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kurset introduserer grunnleggende begreper og eksempler i differensialtopologi og idéen å bruke algebraiske invarianter for å studere geometriske objekt. På kurset diskuteres det inverse funksjonsteoremet, differensiable strukturer og mangfoldigheter, tangentbunter, imbeddinger, submersjoner og regulære\/kritiske punkter. \r\nViktige eksempler er flater, sfærer og projektive rom. Et annet viktig begrep er homotopi og fundamentalgruppen. Anvendelser som blir presentert på kurset kan variere fra Brouwers fixpunktteorem til vektorfelter på sfærer. Disse metodene og idéene har vært innflytelsesrike i mange deler av matematikk og blir også brukt i fysikk og andre fag. ","learning_goal":"1. Kunnskap. Studenten kjenner grunnleggende begrep og metoder innen differensial- og algebraisk topologi, og eksempler på mangfoldigheter.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap i differensial- og algebraisk topologi til å formulere og løse problemer av geometrisk natur innen matematikk, teoretisk fysikk og kybernetikk, bl.a. ved bruk av dynamiske system på mangfoldigheter. \r\n"}
,{"norwegian_name":"Matematisk modellering","code":"TMA4195","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset gir en innføring i generiske prinsipper og metoder for å formulere og analyse matematiske modeller av systemer og prosesser innen ingeniørfag og naturvitenskap.\r\nEmner som dekkes er bl.a. dimensjonsanalyse, skalering, perturbasjonsanalyse, dynamiske modeller, bevarelseslover og anvendelser.\r\n","learning_goal":"1. Kunnskap. Studenten behersker generiske prinsipper og metoder for å formulere og analyse matematiske modeller av systemer og prosesser innen ingeniørfag og naturvitenskap. Dette omfatter kjennskap til dimensjonsanalyse, skalering, perturbasjonsanalyse, dynamiske modeller og bevarelseslover. Studenten har en viss innsikt i hvilke muligheter som finnes for å gjennomføre analytiske og numeriske beregninger basert på modellen.\r\n\r\n2. Ferdigheter. Studenten er i stand til formulere og kvalitativt analysere matematiske modeller for et bredt spektrum av systemer og prosesser.\r\n\r\n3. Generell kompetanse. Studenten kan arbeide i tverrfaglige grupper, og er i stand til å kommunisere resultatene skriftlig og muntlig."}
,{"norwegian_name":"Numerisk lineær algebra","code":"TMA4205","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"I kurset vektlegges iterative teknikker for løsning av store, glisne ligningssystemer som typisk kan stamme fra diskretisering av partielle differensialligninger. I tillegg vil kurset omhandle egenverdi-beregninger, minste kvadraters problem og noe feilanalyse.","learning_goal":"Studenten som møter alle læringsmålene for kurset skal kunne:  (1) forklare og bruke flytende grunnleggende lineære algebraiske begreper som matrix-normer, egen- og singulærverdier og vektorer; (2) estimere stabiliteten av løsningene til lineære algebraiske ligninger og egenverdiproblemer; (3) gjenkjenne matriser av viktige spesialklasser , for eksempel normal, ortogonale, Hermitiske, positiv definite og velge effektive beregningsalgoritmer basert på denne klassifiseringen; (4) transformere matriser til trekantet, Hessenberg, tri-diagonal, eller ortogonal form ved hjelp av elementære transformasjoner; (5) utnytte faktoriseringer og kanoniske former av matriser for effektivt løsning av systemer av lineære algebraiske ligninger, minste kvadraters problemer, og for å finne egenverdier og singulærverdier; (6) forklare de underliggende prinsipper for flere klassiske og moderne iterative metoder for lineære algebraiske systemer, slik som matriks-splitting, projeksjon, og Krylov subrom metoder, analysere deres kompleksitet og konvergens hastighet basert på strukturen og spektrale egenskapene til matrisene; (7) forklare de underliggende prinsippene for iterative algoritmer for å beregne egenverdier av små og få egenverdiene av store egenverdiproblemer;  (8) forklare ideen om prekondisjonering og fleksibel prekondisjonering; (9) forklare de grunnleggende ideene bak multigrid og domenenedbrytings metoder; (10) estimerere  konvergens hastigheten og beregningskompleksitet av utvalgte numeriske algoritmer; (11) implementere utvalgte algoritmer på en datamaskin."}
,{"norwegian_name":"Numerisk løsning av differensialligninger med differansemetoder","code":"TMA4212","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Differanseskjema for ulike typer av partielle differensialligninger, med analyse av konsistens, orden, stabilitet og konvergens. Løsning av lineære ligningsystemer med iterative teknikker og prekondisjonering. Endelig elementmetode.","learning_goal":"1. Kunnskap. Studenten har kunnskap om den grunnleggende teorien bak numerisk løsning av partielle differensialligninger. Studenten behersker feilanalyse av differansemetoder, og forstår begrepene konsistens, stabilitet og konvergens. Studenten har basiskunnskaper om endelig elementmetode og iterative teknikker for løsning av ligningssystemer. \r\n\r\n2. Ferdigheter. Studenten er i stand til å velge egnet metode for elliptiske, parabolske og hyperbolske partielle differensialligninger. Studentene er i stand til å sette opp, implementere og analysere diskretiseringsmetoder på et utvalg partielle differensialligninger. Studenten er i stand til å sette opp numeriske eksperimenter for å verifisere om en PDE-løser er korrekt implementert. Studenten er i stand til å velge og anvende egnede iterative metoder for løsning av ligningssystemer.\r\n\r\n3. Generell kompetanse. Studenten behersker skriftlig og muntlig presentasjon av vitenskapelige problemer og av resultatene studenten oppnår i sin prosjektoppgave. Studenten er i stand til å bruke forkunskaper i lineær algebra og kalkulus for å nå de øvrige mål i kurset.\r\n"}
,{"norwegian_name":"Numerisk matematikk","code":"TMA4215","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Feilanalyse. Approksimasjon av funksjoner.  Numerisk kvadratur.   Numerisk lineær algebra. Numerisk løsning av ikke-lineære ligninger. Numerisk løsning av ordinære differensialligninger.","learning_goal":"1. Kunnskap. Studenten har kunnskap om grunnleggende numeriske metoder for approksimasjon av funksjoner, numerisk kvadratur, numerisk løsning av ordinære differensialligninger og numerisk løsning av lineære og ikke-lineære ligninger. Studenten behersker feilanalyse av numeriske metoder, og forstår begrepene stabilitet og konvergens.\r\n \r\n2. Ferdigheter. Studenten behersker grunnleggende teknikker for å analysere et stort utvalg numeriske algoritmer. Studenten er i stand til å implementere algoritmene i et valgt programmeringsspråk, sette opp numeriske eksperimenter og tolke resultatene. Studenten har etablert gode rutiner for kvalitetssikring av implementerte algoritmer.\r\n\r\n3. Generell kompetanse. Studenten kan beskrive valgt vitenskapelig metode og \r\nkommunisere sine funn i en skriftlig rapport i et presist vitenskapelig språk.\r\n"}
,{"norwegian_name":"Numerisk løsning av partielle differensialligninger med elementmetoden","code":"TMA4220","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet gir en innføring i numerisk løsning av partielle differensialligninger ved hjelp av elementmetoden. Temaer som behandles er: Minimaliseringsprinsipp, svak formulering, grensebetingelser, kvadratur, feilanalyse, stabilitet, konvergens, elementformuleringer, implementering, direkte og iterativ løsning av de resulterende algebraiske ligningssystemene og anvendelser på Poissonligningen og konveksjons-diffusjonsligningen.","learning_goal":"1. Kunnskap: Studentene kjenner til sterke og svake formuleringer av\r\nlineære partielle differensialligninger,\r\nDe kjenner det matematiske grunnlaget for endelig elementmetoder.\r\n\r\n2. Ferdigheter: Studentene er i stand til å formulere og implementere\r\nendelig elementmetoden anvendt på reelle problemer i 1,2 og 3 dimensjoner,\r\ninkludert tidsavhengige problemer, og vurdere kvaliteten av det\r\nnumeriske resultatet.\r\n\r\n3. Generell kompetanse: Studenten får erfaring med skriftlig og muntlig\r\npresentasjon av vitenskaplige problemstillinger og resultater.\r\n"}
,{"norwegian_name":"Analysens grunnlag","code":"TMA4225","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Det moderne integralbegrepet ble presentert i en kort artikkel den 29. april 1901 av Henri Lebesgue, og dette innledet et nytt kapittel i analysen. Manglene ved det klassiske Riemann-integralet blir påpekt, og Lebesgue-integralet blir introdusert. Stikkord for emnet er målteori inkludert sigma-algebraer, målrom, målbare funksjoner, ytre mål, konstruksjon av Lebesgue-mål og produktmål. De klassiske konvergensteoremene, Fubinis teorem, funksjoner av begrenset variasjon, integralregningens fundamentalteorem.\r\n","learning_goal":"1. Kunnskap. Studenten behersker grunnleggende begreper fra målteori, herunder: mengder av mål null, målbare funksjoner, Lebesgue-integralet og Lebesgue-rom. Studenten har oversikt over sentrale resultater i Lebesgueteori, inkludert konvergenssetninger og Fubinis teorem. Videre har studenten kjennskap til sannsynlighetsrom som et eksempel på målrom.  \r\n\r\n2. Ferdigheter. Studenten er i stand til å utføre operasjoner med Lebesgueintegralet og Lebesgue-rom. Videre kan studenten anvende integrasjonsteori, i en eller flere variable, til å formulere og løse problemer i matematikk og teknologi, herunder problemer som involverer ikke-kontinuerlige data.\r\n"}
,{"norwegian_name":"Funksjonalanalyse","code":"TMA4230","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en introduksjon til funksjonalanalyse som gjør studentene i stand til å bruke resultater og begreper fra funksjonalanalyse på andre områder av matematikken, og som kan danne grunnlag for videre studier i funksjonalanalyse.\r\n\r\nTemaer som behandles er blant annet Hahn-Banachs teorem, teoremene om åpen avbildning og lukket graf, Banach-Steinhaus' teorem, duale rom, svak konvergens, Banach-Alaoglus teorem og spektralteoremet for kompakte operatorer.","learning_goal":"1. Kunnskap. Studenten har kjennskap til sentrale begreper i funksjonalanalyse, herunder Hahn-Banachs teorem, teoremene om åpen avbildning og lukket graf, Banach-Steinhaus' teorem, duale rom, svak konvergens, Banach-Alaoglus teorem, begrensede lineæroperatorers spektra og spektralteoremet for begrensede selvadjungerte operatorer.\r\n\r\n2. Ferdigheter. Studenten kan anvende sine kunnskaper i funksjonalanalyse til å løse matematiske problemer.\r\n"}
,{"norwegian_name":"Statistikk","code":"TMA4240","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Deskriptiv statistikk. Sannsynlighet for hendelser og stokastiske variabler. Uavhengige og\r\navhengige stokastiske variabler. Betinget sannsynlighet. En- og flerdimensjonale sannsynlighetsfordelinger. De viktigste klasser av endimensjonale sannsynlighetsfordelinger. Ekstremvariabler. Parameterestimering, intervallestimering og hypotesetesting for et- og to-utvalgsdata. Enkel lineær regresjon\r\n","learning_goal":"1. Kunnskap. Studenten kjenner de grunnleggende begrepene og prinsippene for sannsynlighetsregning og statistisk inferens. Videre kjenner studenten til enkle statistiske modeller og prosesser ofte brukt innen teknologi og naturvitenskap, og vet hvordan slike situasjoner best kan analyseres. Studenten forstår også begreper innen statistikk og sannsynlighetsregning tilstrekkelig til å kunne kommunisere med fagstatistikere om mer kompliserte situasjoner.\r\n\r\n2. Ferdigheter. Studenten kan regne ut sannsynligheter for hendelser i enkle situasjoner. Studenten kan videre anvende sin kunnskap om sannsynlighetsregning og statistikk til å gjenkjenne og analysere data fra enkle statistiske situasjoner innen teknologi og naturvitenskap, om nødvendig med bruk av matematisk programvare og deskriptive metoder. Videre er studenten i stand til å kommunisere med fagstatistikere om mer kompliserte situasjoner."}
,{"norwegian_name":"Statistikk","code":"TMA4245","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Deskriptiv statistikk. Sannsynlighet for hendelser og stokastiske variabler. Uavhengige og\r\navhengige stokastiske variabler. Betinget sannsynlighet. En- og flerdimensjonale sannsynlighetsfordelinger. De viktigste klasser av endimensjonale sannsynlighetsfordelinger. Ekstremvariabler. Parameterestimering, intervallestimering og hypotesetesting for et- og to-utvalgsdata. Enkel lineær regresjon.\r\n","learning_goal":"1. Kunnskap. Studenten kjenner de grunnleggende begrepene og prinsippene for sannsynlighetsregning og statistisk inferens. Videre kjenner studenten til enkle statistiske modeller og prosesser ofte brukt innen teknologi og naturvitenskap, og vet hvordan slike situasjoner best kan analyseres. Studenten forstår også begreper innen statistikk og sannsynlighetsregning tilstrekkelig til å kunne kommunisere med fagstatistikere om mer kompliserte situasjoner.\r\n\r\n2. Ferdigheter. Studenten kan regne ut sannsynligheter for hendelser i enkle situasjoner. Studenten kan videre anvende sin kunnskap om sannsynlighetsregning og statistikk til å gjenkjenne og analysere data fra enkle statistiske situasjoner innen teknologi og naturvitenskap, om nødvendig med bruk av matematisk programvare og deskriptive metoder. Videre er studenten i stand til å kommunisere med fagstatistikere om mer kompliserte situasjoner."}
,{"norwegian_name":"Romlig statistikk","code":"TMA4250","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Parameterestimering, simulering og anvendelser av gaussiske felt, punktfelt og diskrete markovfelt.\r\nEksempler blir hentet fra bildeanalyse, miljø- og naturressursproblematikk.\r\n","learning_goal":"1. Kunnskap. Studenten har kunnskap om de sentrale begreper i teorien om gaussiske felt, inkludert romlig interpolasjon ved hjelp av ulike former for kriging, og teknikker for ubetinget og betinget simulering. Studenten har videre kunnskap om de sentrale begreper i teorien om punktmodeller, inkludert K- og L-funksjonene, romlige poisson-, cox- og hard-core-prosesser, samt simulering av slike punktmodeller. Studenten har kunnskap om de sentrale begreper i teorien om diskrete markovfelt, inkludert begreper som naboskap, klikker, potensialfunksjoner og Hammersley-Clifford teorem, samt simulering av markovfelt ved hjelp av MCMC-algoritmer. Studenten har dessuten kjennskap til parameterestimering i romlige felt.\r\n\r\n2. Ferdigheter. Studenten kan formulere statistiske modeller for enkle romlige fenomener, samt utføre parameterestimering for disse modellene ved hjelp av passende programvare. Videre kan studenten evaluere betingede romlige modeller ved bruk av simulering."}
,{"norwegian_name":"Anvendt statistikk","code":"TMA4255","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Hypotesetesting. Enkel og multippel lineær regresjon. Modellvalg. Forsøksplanlegging med\r\nto-nivå faktorielle forsøk. Feilforplantningsformelen. Variansanalyse.\r\nProsesskontroll. Kontingenstabeller. Ikke-parametriske metoder. Bruk av statistisk programpakke.\r\n","learning_goal":"1. Kunnskap. Studenten har god forståelse av de grunnleggende statistiske modeller og metoder som benyttes innen naturvitenskap og teknologi. Dette inkluderer hypotesetesting, lineær regresjon, forsøksplanlegging, variansanalyse, feilforplantningsformelen, prosesskontroll, analyse av kontingenstabeller og ikke-parametriske metoder.\r\n\r\n2. Ferdigheter. Studenten kan planlegge et eksperiment for å studere et gitt fenomen. Videre har han eller hun kunnskap om innsamling av informative data av høy kvalitet og analyse av dataene ved hjelp av statistisk programvare. Studenten er i stand til å presentere resultater fra statistiske analyser for kolleger innenfor sitt fagområde, og til å bruke resultatene til å trekke konklusjoner om fenomenet som studeres."}
,{"norwegian_name":"Stokastisk modellering","code":"TMA4265","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Viktige modeller for multivariate stokastiske variable: Markovkjeder, poissonprosesser, fødsels- og dødsprosesser i kontinuerlig tid, brownske bevegelser og gaussiske prosesser. Prosedyrer for simulering av stokastiske modeller.\r\n","learning_goal":"1. Kunnskap. Studenten har basiskunnskaper om multivariat statistisk modellering og stokastiske prosesser med referanse i tid. \r\nStudenten har mer detaljert kunnskap om markovkjeder, poissonprosesser, fødsels- og dødsprosesser, og gaussiske prosesser. Studenten kan kjenner også til de grunnleggende prinsippene for simulering av stokastiske prosesser.\r\n2. Ferdigheter. Studenten kan formulere enkle stokastiske prosesser med referanse i tid og kan analysere slike prosesser kvantitativt og kvalitativt. Studenten kan bruke simulering til å studere egenskapene til multivariate statistiske modeller.\r\n"}
,{"norwegian_name":"Lineære statistiske modeller","code":"TMA4267","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Multippel lineær regresjon. Variansanalyse. Multivariabel normalfordeling. \r\nForsøksplanlegging. Generalisert lineær regresjon.","learning_goal":"1. Kunnskap. Studenten har gode teoretiske kunnskaper om de mest populære statistiske modeller og metoder som benyttes i vitenskap og teknologi, dette inkluderer spesielt regresjonsmodeller. De statistiske egenskapene til multivariabel normalfordeling er godt kjent for studenten, og studenten er fortrolig med rollen til den multivariate normafordeingen i lineære statistiske modeller. \r\n2. Ferdigheter. Studenten vet hvordan han\/hun kan planlegge et eksperiment og hvordan han\/hun kan samle inn informative data av høy kvalitet. Videre kan studenten velge en egnet statistisk modell og metode, og utføre statstiske analyser ved hjelp av statistisk programvare. Studenten vet hvordan resultatene fra de statistiske analysene skal presenteres, og kan trekke konklusjoner.\r\n"}
,{"norwegian_name":"Statistisk læring","code":"TMA4268","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Statistisk læring, multippel lineær regresjon, klassifikasjon, resamplingmetoder, modellseleksjon\/regularisering, ikke-linearitet, trebaserte metoder.","learning_goal":"1. Kunnskap. Studenten kjenner godt til de mest populære statistiske modeller og metoder som benyttes i prediksjon i vitenskap og teknologi, dette inkluderer spesielt regresjons- og klassifikasjonsmodeller.\r\n2. Ferdigheter. Studenten vet hvordan han\/hun for et eksisterende datasett kan velge en egnet statistisk modell og metode, og utføre statistiske analyser ved hjelp av statistisk programvare. Studenten vet hvordan resultatene fra de statistiske analysene skal presenteres, og hvilke konklusjoner som kan trekkes fra analysene.\r\n"}
,{"norwegian_name":"Levetidsanalyse","code":"TMA4275","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende begreper i levetidsmodellering. Sensurerte observasjoner. Ikke-parametrisk estimering og grafisk plotting for levetidsdata (Kaplan-Meier plott, Nelson-plott). Estimering og\r\ntesting i parametriske levetidsfordelinger. Analyse av levetider med kovariater (Cox-regresjon,\r\nakselerert levetidstesting). Modellering og analyse av rekurrente hendelser. Ikke-homogene\r\npoissonprosesser. Nelson-Aalen estimatorer.\r\n","learning_goal":"1. Kunnskap. Studenten har grundig kjennskap til den grunnleggende teorien for stokastisk modellering og statistisk analyse av levetidsdata, med vekt på tilhørende grafiske teknikker. Dette inkluderer så vel parametrisk som ikke-parametrisk analyse av sensurerte levetidsdata og data for rekurrente hendelser, samt tilhørende regresjonsmodeller, for eksempel Cox-regresjon.\r\nDe grafiske teknikker omfatter Kaplan-Meier plott, Nelson-Aalen plott og enkle plott for sjekk av modelltilpasning.\r\n\r\n2. Ferdigheter. Studenten er i stand til å anvende sin kunnskap på ulike problemstillinger fra teknisk pålitelighetsanalyse, risikoanalyse, medisin og andre relevante anvendelsesområder,\r\nder begrepet overlevelse i vid forstand inngår. Slike anvendelser omfatter etablering av modell, løsning ved hjelp av statistisk programvare, samt formulering av konklusjoner i form av estimater, prediksjoner og anbefalinger."}
,{"norwegian_name":"Superdatamaskiner, innføring i bruk ","code":"TMA4280","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Litt om moderne datamaskinarkitektur, innføring i bruk av MPI \r\n(Message Passing Interface) for parallelle beregninger, numeriske metoder for partielle differensialligninger (med fokus på Poisson-problemet), direkte og interativ løsning av store ligningssystemer, modellering av ytelse på en og flere prosessorer, samt litt om Monte Carlo metoder, parallell IO og OpenMP. \r\n","learning_goal":"1. Kunnskap. Studenten har en grunnleggende forståelse for moderne datamaskinarkitektur og trender innen utviking av nye beregningssystemer. Spesielt har studenten en forståelse av hva som kan påvirke ytelsen av numeriske beregninger (dvs, antall flyttallsoperasjoner per sekund), og hva en kan gjøre for å optimalisere ytelsen. Studenten kan identifisere hvordan en kan dekomponere et globalt beregningsproblem i delproblemer som vil være passende for parallell prosessering, og kan modellere ytelse for utvalgte algoritmer.  Studenten er kjent med sammenhengen mellom moderne maskinarkitektur og utvikling av effektive numerisk algoritmer for vitenskapelige og tekniske beregninger. \r\n\r\n2. Ferdigheter. Studenten er i stand til å implementere numeriske algoritmer i et høynivåspråk,  og med relevans for vitenskap og teknologi, både på en prosessor og flere prosessorer.  Studenten kan bruke funksjoner fra kommunikasjonsbiblioteket MPI til å utføre lokale og globale kommunikasjonsbehov. Videre kan studenten måle ytelse av en algoritme og analysere ytelsesdataene med hensyn på skalerbarhet når en varierer problemstørrelse og antall prosessorer en bruker. Studenten kjenner til ulike hjelpeprogrammer, som automatiske partisjoneringsverktøy og optimaliserte rutiner for basis lineær algebra operasjoner (BLAS). \r\n"}
,{"norwegian_name":"Tidsrekkemodeller","code":"TMA4285","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Autoregressive og moving-average baserte modeller for stasjonære og ikke-stasjonære tidsrekker. Parameterestimering. Modellidentifisering. Prognoser. ARCH- og GARCH-modeller\r\nfor volatilitet. State-space-modeller (lineære dynamiske modeller) og kalmanfilteret.\r\n","learning_goal":"1. Kunnskap. Studenten har kunnskap om det teoretiske grunnlaget for å kunne modellere og analysere tidsrekker med anvendelser innen ingeniørfag og finans. Dette inkluderer kunnskap om autoregressive og moving-average baserte modeller for stasjonære og ikke-stasjonære tidsrekker, samt kunnskap om hvordan man utfører modellidentifisering og parameterestimering og lager prognoser i slike modeller. Det inkluderer også kjennskap til ARCH- og GARCH-modeller for volatilitet, samt state-space-modeller (lineære dynamiske modeller) og kalmanfilteret.\r\n\r\n2. Ferdigheter. Studenten er i stand til å benytte sin kunnskap om ulike tidsrekkemodeller til å tilpasse modeller til observerte tidsrekkedata hentet fra ingeniørfag og finans, samt lage\r\nprognoser basert på disse dataene.\r\n"}
,{"norwegian_name":"Statistisk inferens","code":"TMA4295","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Transformasjoner og momenter av tilfeldige variabler. Definisjon av fordelingsklasser. Ulikheter og konvergensteoremer. Suffisiente observatorer. Frekventistiske og bayesianske estimatorer. Metoder for konstruksjon av punktestimatorer, intervallestimatorer og hypotesetester, samt optimalitet av disse. Asymptotiske egenskaper for estimatorer og hypotesetester.\r\n","learning_goal":"1. Kunnskap. Studenten har solide teoretiske kunnskaper om generelle prinsipper for statistisk\r\ninferens. Studenten har kunnskap om hvordan punkt- og intervallestimatorer, samt hypotesetester konstrueres, og om hvordan disse estimatorene og testene evalueres. Studenten har\r\ninnsikt i hvordan optimale estimatorer og tester konstrueres. Studenten har også noe kjennskap\r\ntil asymptotisk teori for statistisk inferens.\r\n2. Ferdigheter. Studenten kan utføre punktestimering, hypotesetesting og intervallestimering under et stort mangfold av diskrete og kontinuerlige sannsynlighetsmodeller. Studenten\r\nkan videre evaluere egenskapene til disse estimatorene og testene, såvel for endelige utvalgsstørrelser som asymptotisk når utvalgsstørreelsen vokser, samt velge optimale estimatorer\r\nog tester.\r\n"}
,{"norwegian_name":"Beregningskrevende statistiske metoder","code":"TMA4300","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Klassiske og markovkjedeteknikker for Monte Carlo-simulering. Hierarkiske bayesianske modeller og inferens i disse. EM-algoritmen (Expectation maximization). Bootstrapping, kryssvalidering og ikke-parametriske metoder. Klassifikasjon.\r\n","learning_goal":"1. Kunnskap. Studenten har kjennskap til beregningskrevende teknikker for å gjøre statistisk inferens. Dette inkluderer direkte- og MCMC-teknikker for Monte Carlo-simulering, samt EM-algoritmen og bootstrapping. Videre har studenten basiskunnskap om hvordan komplekse\r\nstatistiske problemer kan formuleres og løses ved hjelp av hierarkiske bayesianske modeller.Studenten har dessuten kunnskap om en del klassifikasjonsteknikker.\r\n\r\n2. Ferdigheter. Studenten kan anvende beregningskrevende teknikker, slik som Monte Carlo-simulering, EM-algoritmen og bootstrapping, til å løse enkle anvendte problemer.\r\n\r\n3. Generell kompetanse. Studenten er i stand til å gi en faglig muntlig presentasjon.\r\n"}
,{"norwegian_name":"Partielle differensialligninger","code":"TMA4305","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Kurset gir en grundig innføring i den matematiske teorien bak partielle differensialligninger, både den klassiske teorien til Laplace, Cauchy, Fourier, Gauss etc. og den moderne teorien som baserer seg på funksjonalanalytiske metoder. Emner som dekkes er første ordens ligninger, Cauchy-problemer, karakteristikker, lineære andre ordens ligninger, klassifisering, randverdiproblemer for elliptiske ligninger, rand- og initialverdiproblemer for hyperbolske og parabolske ligninger, fundamentalløsninger, maksimumsprinsipper, svake løsninger og funksjonalanalytiske metoder.\r\n","learning_goal":"1. Kunnskap. Studenten behersker grunnleggende prinsipper og metoder for analyse av partielle differensiallikninger, inkludert første ordens likninger, Cauchy-problemer, karakteristikker, lineære andre ordens likninger, klassifisering, randverdiproblemer for elliptiske likninger, rand- og initialverdiproblemer for hyperbolske og parabolske likninger, fundamentalløsninger, maksimumsprinsipper, svake løsninger og funksjonalanalytiske metoder.\r\n\r\n2. Ferdigheter. Studenten er i stand til å anvende teknikkene til å studere konkrete eksempler, forstå bevisene og kunne anvende sentrale bevisteknikker på beslektede problemer.\r\n"}
,{"norwegian_name":"Matematiske emner, videregående kurs","code":"TMA4310","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Et videregående emne innen matematikk eller statistikk.","learning_goal":"Gi en innføring i et sentralt videregående matematisk emne som ikke dekkes gjennom den øvrige studieplan. Styrke faglig basis for fordypningsemnet i 9. semester."}
,{"norwegian_name":"Generaliserte lineære modeller","code":"TMA4315","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Prinsipper for statistisk modellering, inferens og evaluering for generaliserte lineære modeller, med anvendelser blant annet på regresjonsmodeller for normalfordelte data, logistisk\r\nregresjon for binære og multinomiske data, Poisson-regresjon og log-lineære modeller for kontingenstabeller. Utvidelser av GLM-teori til, for eksempel, modeller for overdispersjon, kvasi-likelihoodestimering og generaliserte lineære miksa modeller.\r\n","learning_goal":"1. Kunnskap. Studenten har solide kunnskaper om generaliserte lineære modeller og tilhørende inferens og evalueringsmetoder. Dette inkluderer regresjonsmodeller for normalfordelte data, logistisk regresjon for binære og multinomiske data, poissonregresjon og log-lineære modeller for kontingenstabeller.\r\n\r\n2. Ferdigheter. Studenten kan vurdere om en generalisert lineær modell kan brukes i en gitt situasjon, og kan videre utføre og evaluere en slik statistisk analyse.\r\n"}
,{"norwegian_name":"Introduksjon til vitenskapelige beregninger","code":"TMA4320","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kurset består av to jevnstore deler, en teoretisk og en beregnings-orientert. Den teoretiske delen gir en en introduksjon til numerisk matematikk og forbereder studentene for den beregningsorienterte delen, som består av tre obligatoriske prosjekter, hentet fra fysikk,\r\nbiofysikk og matematikk. Aktuelle temaer for forelesningene kan være metoder for beregning av integraler, løsning av systemer av\r\ndifferensial og algebraiske ligninger og egenverdi-beregninger. ","learning_goal":"Studenten som møter alle læringsmålene for kurset skal kunne: (1) formulere enkelte problemer fra fysikk og biofysikk matematisk; (2) forklare og bruke enkelte beregningsmetoder til å løse disse problemer numerisk;  (3) implementere utvalgte numeriske algoritmer på en datamaskin; (4) foreta en kritisk vurdering av resultatene; (5) kommunisere dette i form av en skriftlig rapport."}
,{"norwegian_name":"Industriell matematikk, fordypningsprosjekt","code":"TMA4500","credits":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Prosjektarbeid på 15 sp i valgt tema.","learning_goal":"Studenten skal tilegne seg en vitenskapelig arbeidsmetode ved å fordype seg i et spesifikt tema. Dette omfatter å innhente informasjon gjennom litteraturstudier og annet kildesøk, samt kombinere denne med egen kunnskap. Videre skal studenten lære å gjennomføre et større selvstendig prosjektarbeid, inklusive utarbeide en prosjektplan med milepæler sammen med veileder, rapportere del-resultater, og skrive en prosjektrapport i følge vedtatte standarder."}
,{"norwegian_name":"Industriell matematikk, fordypningsemne","code":"TMA4505","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Studenten kan velge mellom to tema (3,75 sp), eller et ordinært emne (7,5 sp) innen fagområdene som dekkes av industriell matematikk. \r\nHvilke 3,75 sp temaer som tilbys varierer fra år til år. For å ta et ordinært emne som fordypningsemne kreves godkjenning av foreleser.  ","learning_goal":"Emnet skal gi fordypning i matematiske eller statistiske problemstillinger som er aktuelle for det valgte fordypningsprosjektet (TMA4500)."}
,{"norwegian_name":"Eksperter i team - Matematikk innen anvendelser","code":"TMA4850","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name":"Eksperter i team - Big Data","code":"TMA4851","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
,{"norwegian_name":"Industriell matematikk, masteroppgave","code":"TMA4900","credits":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"","learning_goal":"1. Kunnskap: Studenten kan demonstrere inngående kunnskap om og innsikt i et avgrenset tema innenfor fagområdene som dekkes av industriell matematikk ved å kunne forklare og anvende de underliggende teoretiske begrep og teknikker.\r\n\r\n2. Ferdigheter: Studenten er i stand til å utføre et selvstendig vitenskapelig arbeid med problemstillinger i matematiske fag, relevante for industri og næringsliv. Arbeidet skal være forskningsbasert, og kan være både av teoretisk og anvendt karakter.\r\n\r\n3. Generell kompetanse: Studenten skal kunne gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler. Studenten skal kunne formidle resultatene fra arbeidet i vitenskapelig rapport.\r\n"}
,{"norwegian_name":"Statistikk, masteroppgave","code":"TMA4905","credits":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"","learning_goal":""}
,{"norwegian_name":"Numerikk, masteroppgave","code":"TMA4910","credits":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"","learning_goal":""}
,{"norwegian_name":"Kommunikasjon - Tjenester og nett","code":"TTM4100","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Multimediekomponenter og teletjenester, svitsjingprinsipper, nettyper og Internet. Referansemodeller (f.eks. OSI og TCP\/IP)og generisk protokollfunksjonalitet. Funksjonalitet i applikasjonsnivå, transportnivå , nettnivå, linknivå, og (delvis) fysisk nivå. Innen applikasjonsnivået vil det legges vekt på arkitektur og protokoller for DNS (Domain Name System), E-mail og WWW (World Wide Web). Beskrivelse av multimediasystemer. Beskrivelse av trådløs og mobil nettverk. Grunnleggende kommunikasjonssikkerhet.","learning_goal":"A. Kunnskaper:\r\nEmnet skal gi kunnskap om og grunnleggende forståelse av:\r\n1) De mest fundamentale konsepter, prinsipper og teknologier som er grunnlaget  for kommunikasjonsnett og tjenester. Dette inkluderer arkitektur og prinsipper som omhandler nettbaserte tjenester, svitsjeteknikker, funksjonalitet og protokoller i nettets fem ulike kommunikasjonslag, og bruken av transportlagsprotokoller i design av nettapplikasjoner.\r\n2) Trådløse og mobile nett.\r\n3) Multimedia over nett.\r\n4) Kommunikasjonssikkerhet.\r\n\r\nB. Ferdigheter:\r\nEmnet skal gi ferdigheter i:\r\n1) Å  kunne resonere og drøfte  arkitektur, prinsipper, og teknologier ved  design  og implementering av kommunikasjonsnett og tjenester.\r\n2) Å kunne forklare hvordan og hvorfor nettets fem lag fungerer.\r\n3) Å kunne kommunisere, resonere og drøfte trådløse og mobile nett, og bruk av multimedia over nettet.\r\n4) Å kunne designe og implementere elementære nettapplikasjoner som utnytter transportlagsprotokollen.\r\n5) Å kunne sørge for grunnleggende sikkerhet i kommunikasjon over nett."}
,{"norwegian_name":"Aksess- og transportnett","code":"TTM4105","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet beskriver teknologier og konsepter som anvendes i aksess- og transportnett. Det dekkes både generelle prinsipper på et overordnet nivå, og et utvalg spesifikke teknologier og konsepter i mer detalj.\r\n\r\nInnledning:\r\n\r\n- Den prinsipielle oppbygning av kommunikasjonsnettverk, med fokus på offentlige nett som f.eks cellular og Internet.\r\n- Aktører, roller og ansvar ifm kommunikasjonsnettverk.\r\n- Begreper: synkronisering, multipleksing, routing, svitsjing, signalering, mobilitet, sikkerhet.\r\n- Applikasjoner og krav til nett. Internet som tjenesteplattform.\r\n- Kapasitet og transmisjonsegenskaper til ulike medier.\r\n\r\nAksessnett:\r\n\r\n+ Trådløs aksess\r\n- Generelt om radio som kommunikasjonsmedium (frekvensbånd, modulering, multiplexing, antenneteknologi, dekning, propagasjon).\r\n- medium aksesskontroll\r\n- Wireless LAN.\r\n- mobilnett: GSM, UMTS, WiMAX, LTE, etc.\r\n- Trådløs personlig kommunikasjon og tingenes internett.\r\n\r\n+ Fast aksess\r\n- Generelt om faste (kablede) kommunikasjonsmedium (egenskaper, tilgjengelighet).\r\n- Digital Subscriber Line teknologi (e.g. Basic Rate ISDN, ADSL, VDSL).\r\n- Fiber basert aksess, aktiv \/ passiv FTTH.\r\n- Hybrid Fiber-Coaxial Cable (DOCSIS).\r\n\r\nTransportnett (metro og kjerne):\r\n\r\n- Optiske nettverkskomponenter.\r\n- Optisk svitsjing (ROADM, WSS).\r\n- Kontroll og trafikkstyring i optiske nett.\r\n- Mekanismer for feilhåndtering.\r\n- Optiske transportnett (OTN).\r\n- Carrier Ethernet.\r\n- Optisk linjesvitsjing (OCS), burstsvitsjing (OBS) og pakkesvitsjing (OPS).\r\n","learning_goal":"A. Kunnskap: \r\n1) Å forstå hvilke komponenter, funksjoner og prinsipper som trengs for å realisere aksess- og transportnett. \r\n2) Å oppnå en dyp innsikt i et utvalg av de mest aktuelle teknologiene som benyttes i dag. \r\n3) Å forstå hvordan disse komponentene, teknologiene og prinsippene anvendes i forskjellige typer nett. \r\n\r\nB. Ferdigheter: \r\n1) Å kunne beskrive og modellere et nettverk for et bestemt formål. \r\n2) Å kunne gjenbruke ideer, teknologier og komponenter fra andre nett ved konstruksjon av nye nett. \r\n\r\nC. Generell kompetanse: \r\n1) Å forstå oppbygningen av offentlige kommunikasjonsnett og hvilke egenskaper som ligger til grunn for teknologiske valg."}
,{"norwegian_name":"Pålitelighet og ytelse med simulering","code":"TTM4110","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Basis: Mål for pålitelighet, ytelse og tjenestekvalitet; ressurser og ressursutnyttelse, feilårsaker og feilavhjelpning, analytiske modeller, diskrete og kontinuerlige fordelinger, grunnleggende om stokastiske prosesser. Poissonprosessen, diskret rom - kontinuerlig tid, Markov modeller og analyse. Simulering: Prosessorientert simulering, generering av tilfeldige variabler, primitiver i Demos, analyse av resultater. Ytelse og trafikk: Erlang og Engsets avvisningsmodeller, M\/M\/1 og Erlang-kømodeller, Jackson kønett. Pålitelighet: funksjonssannsynlighet, tilgjengelighet, systemtider i enkle redundanstrukturer bestemt ved hjelp av Markovmodeller; blokkdiagram, feiltrær, strukturfunksjoner, stier og kuttesett. Målinger: observasjonsstrategier, punkt- og intervallestimering, eksperimentoppsett.","learning_goal":"A. Kunnskap:\r\n1) Å få en grunnleggende forståelse for betydningen av ikke-fuksjonelle krav ved tjeneste- og systemdesign.\r\n2) Å få en grunnleggende forståelse av prinsipper for pålitelighet og ytelsesevaluering og dimensjonering av data- og kommunikasjonssystemer (IKT).\r\n3) Å få en grunnleggende forståelse av modellering, analyse og målinger for evaluering og dimesjonering.\r\n4) Å få en grunnleggende forståelse av sannsynlighetsregning, statistikk, og stokastiske prosesser for modelleing av IKT systemoppførsel.\r\n5) Å få en grunnleggende forståelse av Markovmodellering og løsning av disse.\r\n6) Å få en grunnleggende forståelse av prosessorientert modelling og simulering.\r\n7) Å få en grunnleggende forståelse av simulerings- og målemetoder.\r\n\r\nB. Ferdighet:\r\n1) Å bli i stand til å spesifisere ytelses- og påliteligshetskrav.\r\n2) Å bli i stand til å beskrive systemegenskaper ved hjelp av en Markovmodell.\r\n3) Å bli i stand til å bestemme systemegenskaper symbolsk og nummerisk fra en Markov modell.\r\n4) Å bli i stand til å beskrive en simuleringsmodell, implementere en simulator og gjennomføre et simuleringseksperiment.\r\n5) Å bli i stand til å avlede systemegenskaper fra målinger, analytiske- og simuleringsresultater."}
,{"norwegian_name":"Design av reaktive systemer 1","code":"TTM4115","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet dreier seg om metoder og språk for å utvikle reaktive systemer. Hovedtemaene er: \r\n- Utvikling av systemer i henhold til krav og use cases fra brukere\r\n- Språk for å modellere systemer, med vekt på beskrivelse av oppførsel\r\n- Utviklingsmetodikk, blant annet agile metoder\r\n- Metoder og paradigmer for å sikre kvalitet av systemdesigns.","learning_goal":"A. Kunnskap:\r\n1) Klassifisere ulike typer av krav, og forklare de viktigste aktivitetene i en utviklingsprosess. Nevne potensielle problemer under kravspesifikasjon. \r\n2) Gjenkjenne modelleringselementer i UML, forklare semantikken av dem, og finne den rette måten å implementere dem i kode. Dette omfatter use case-, sekvens-, tilstandsmaskin-, aktivitets- og deployment-diagrammer. \r\n3) Forstå og beskrive hovedtrekkene ved applikasjonsprotokoller som HTTP, CoAP og MQTT, og bruke dem på korrekt måte i kontekst av en systemarkitektur. \r\n4) Liste opp og forklare hovedelementene i en smidig utviklingsmetode som for eksempel Scrum, og reflektere over deres anvendelse i et gitt utviklingssammenheng.\r\n\r\nB. Ferdigheter:\r\n1) Fange opp brukerkrav og syntetisere relevante use cases med rett detaljnivå. \r\n2) Skrive prosjektleveranser som beskriver systemkrav, egenskaper og løsninger. \r\n3) Planlegge og koordinere utvikling av større programvareprodukter (som består av mer enn én applikasjon) i et team av utviklere. \r\n4) Bruke smidige utviklingsmetoder og reflektere over bruk innenfor en prosjektramme. \r\n5) Gjøre riktige designvalg for systemarkitektur og dokumentere dem på en hensiktsmessig måte."}
,{"norwegian_name":"Nett- og tjenesteadministrasjon","code":"TTM4128","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet omfatter: Arkitekturer og prinsipper for SNMP-basert og WEB-basert nettadministrasjon. WEB-basert nettadministrasjon omfatter WBEM (WEB-based Enterprise Management), WS-management (WEB Services for Management) og NETCONF (Network Configuration Protocol).","learning_goal":"A. Kunnskap:\r\n1) Å få en grunnelggende forståelse av prinsipper og arkitekturer for bruk i nett- og tjenesteadministrasjon.\r\n2) Å få en dyp forståelse av SNMP som arkitektur og plattform for nettadministrasjon.\r\n3) Å få en dyp forståelse av Web-basert nettadministrasjon.\r\n\r\nB. Ferdigheter:\r\n1) Å bli istand til å kommuniserer, ressonere samt tenke kreativt om nettadministrasjon.\r\n2) Å kunne forstå og bruke abstrakte spesifikasjoner for SNMP-basert og web-basert nettadministrasjon \r\n3) Å bli istand til å designe, implementere og bruke web-baserte plattformer for nettadministrasjon.\r\n4) Å kunne konfigurere og bruke Net-SNMP til nettadministrasjon."}
,{"norwegian_name":"Mobile nett og tjenester","code":"TTM4133","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Introduksjon til kommunikasjon: naturlig kommunikasjon, kunstig kommunikasjon, telekommunikasjon og mobilkommunikasjon. Grunnleggende aspekter av mobilkommunikasjon: kommunikasjonsmodell, komponenter, telekommunikasjonssystem og singnalering, cellekonseptet. Administrasjon av mobilitet. Mobile systemer: GSM, GPRS, UMTS, LTE. Kommunikasjonstjenester over IP nett: SIP, IMS, Over-the-top services.","learning_goal":"A. Kunnskap:\r\n1) Å få en dyp forståelse av konsepter og prinsipper innen mobilitet og mobilkommunikasjon\r\n2) Å få en dyp forståelse av de grunnleggende funksjonene knyttet til mobilitet\r\n3) Å få en dyp forståelse av signalering og IP nett signalering\r\n4) Å få en grunnleggende forståelse av aktuelle mobilkommunikasjonssystemer\r\n5) Å få en grunnleggende forståelse av IP kommunikasjonstjenester\r\n\r\nB. Ferdigheter:\r\n1) Å være i stand til å kommunisere og analysere begrepene mobilitet og mobilkommunikasjon\r\n2) Å være i stand til å designe, implementere og bruke mobilkommunikasjonssystemer\r\n3) Å være i stand til å kommunisere og analysere signalering og IP nett signalering\r\n4) Å være i stand til å designe, implementere og bruke IP kommunikasjonstjenester."}
,{"norwegian_name":"Informasjonssikkerhet","code":"TTM4135","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kryptografi; symmetriske og offentlig-nøkkel, kryptografiske protokoller, nøkkeldistribusjon, autentisering, digitale signaturer. Nettverkssikkerhet; tilgangskontroll, tjenester og mekanismer for autentisering, nettverkssikkerhetsprotokoller, applikasjonslaget sikkerhet og sikker nettverksadministrasjon.\r\nSystemsikkerhet; innbruddsdeteksjon, ondsinnet programvare, brannmurer, identifikasjon.","learning_goal":"A. Kunnskap:\r\nÅ få en grunnleggende forståelse av prinsipper i kryptografi og nettverkssikkerhet, med kunnskap innen fire områder:\r\n1) kryptografiske algoritmer;\r\n2) teknikker og algoritmer for nøkkelhåndtering, nøkkeldistribusjon og autentisering.\r\n3) bruk av kryptografiske algoritmer i nettverksprotokoller og applikasjoner;\r\n4) teknikker for sikring av datamaskiner mot inntrengere og ondsinnet programvare.\r\n\r\nB. Ferdigheter:\r\n1) Å kunne evaluere sikkerhet i systemer med hensyn til formålstjenlig bruk av sikkerhetstjenester og mekanismer.\r\n2) Å være i stand til å designe grunnleggende sikkerhetsarkitekturer ved å velge og integrere relevante sikkerhetskomponenter.\r\n"}
,{"norwegian_name":"Informasjonssikkerhet i trådløse nett","code":"TTM4137","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Funksjoner, protokoller og konfigurasjoner for å oppnå autentisering, nøkkeldistribusjon, integritet, konfidensialitet og anonymitet i trådløse aksess- og mobil-nett.  Emnet presenterer sikkerhetsløsninger for eksisterende systemer som WPAN, WLAN, UMTS, IMS, og studerer også nye teknologier slik som ad-hoc nett. Digitale spor i trådløse systemer.","learning_goal":"A. Kunnskap:\r\n1) Emnet skal gi kunnskap om teknologi og metoder for sikring av informasjon i kommunikasjonssystemer som yter tjenester til mobile brukere ved hjelp av trådløse aksessnett.\r\n2) Kunnskap om oppbygning av sikkerhetsmekanismer og -protokoller i mobile radioaksess nett, f.eks. WLAN IEEE 802.11, WAN 802.16,  GSM\/UMTS\/LTE, Adhoc- og sensor-nett. \r\n3) Kunnskap om designprinsipper, mekanismer og løsninger i autentiserings- og nøkkeltransport-protokoller i trådløse aksessnett.\r\n\r\nB. Ferdigheter:\r\n1) Emnet skal gi ferdigheter for teknisk inngående analyse av informasjonssikkerhetsegenskaper i kommunikasjonssystemer som yter tjenester til mobile brukere ved hjelp av trådløse aksessnett.\r\n2) Gjennomføre gruppearbeid en ukes labprosjekt på WLAN sikkerhetsanalyse og konstruksjon, med labjournalføring og lab-rapport.\r\n3) Hver student velger etter egen interesse og motivasjon, under veiledning, et teknisk emne innenfor trådløs sikkerhet. Emnet skal\r\nligge utenfor forelest pensum.  Målet er å skrive et kort og konsist teknisk essay (~4 sider) som presenterer det valgte emneområdet.\r\n\r\nC. Generell kompetanse:\r\n1) Praksis i å utføre, journalføre og rapportere fra et eksperimentelt labarbeide.\r\n2) Skrive et kortfattet og konsist teknisk essay utformet med LaTeX verktøy."}
,{"norwegian_name":"Nettarkitektur i internett ","code":"TTM4150","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Internett nettverksarkitektur,  inkluderer blant annet nettverks arkitektur, adressering, multicast, Content Delivery Networks (CDN), Software Defined Networking (SDN), ruting (IGP\/EGP), tjenestekvalitet, Multiprotocol Label Switching (MPLS), ressursallokering\/metningskontroll, og virtuelle private nett. ","learning_goal":"A. Kunnskap:\r\n1) Få en dyp forståelse av filosofien bak Internett-arkitekturen.\r\n2) Få en dyp forståelse for  motivasjon, krav, funksjonalitet, muligheter og begrensninger i sentrale arkitekturer og protokoller i  Internett. Fokus er på protokoller og arkitektur for multicast, tjenestekvalitet, SDN, CDN, ruting, virtuelle private nett, ressursallokering og metningskontroll.\r\n3) Få en dyp forsåelse av addressering i Internett.\r\n\r\nB. Ferdigheter:\r\n1) Å bli istand til å kommuniserer, ressonere samt tenke kreativt om de viktigste prinsipper og  nett og protokoller som inngår i TCP\/IP-baserte nett. Disse  er beskrevet i A2.\r\n2) Kunne  identifisere og analysere styrker og svakheter av ulike mekanismer som brukes i Internett-protokoller.\r\n3) Kunne identifisere alternativer løsninger.\r\n4) Kunne sette opp enkle nettverk inklusive konfigurasjon av nettverksnodene.\r\n5) Kunne utføre og analysere trafikkmålinger på Internett."}
,{"norwegian_name":"Pålitelighets- og ytelsesdesign","code":"TTM4158","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset gir en bred innføring i design og kvantitativ evaluering av informasjons- og kommunikasjons- (IKT) systemer, med fokus på pålitelighet av slike systemer og ytelse av data- og telekommunikasjonsnett. Følgende tema er behandlet: \r\n- Pålitelighetsbegreper: attributter (tilgjengelighet, pålitelighet); feil-prosess, -typer (årsak, tilstand, ytring), -semantikk, -håndtering og vedlikehold; \r\n- Feiltoleranse: typer av redundans, designprinsipper og mekanismer; \r\n- Metoder for pålitelighetsmodellering og analyse med fokus på tilstandsdiagrammer; \r\n- Programvarefeil: modellering og innflytelse; \r\n- Robusthetsdesign og pålitelighetsevaluering av nett \r\n- Trafikk- og ytelsesbegreper: trafikk, forsinkelse\/latens, jitter, tap, sperr, Kendalls notasjon; \r\n- Klassiske  køteori modeller og metoder: M\/M\/1; tilstandsdiagram, M\/M\/n\/n; Erlangs formler, Jackson kønett; M\/G\/1; Pollaczek Khinchines formel; loven om bevaring av arbeid; \r\n- Tjenestekvalitet (QoS) i Internett: trafikk- og tjeneste spesifikasjoner, arkitekturer, mekanismer og  analyse av garantert tjenestekvalitet.","learning_goal":"A. Kunnskap:\r\n1) Terminologi og begreper som brukes i spesifikasjon, design, drift og evaluering av informasjons- og kommunikasjons- (IKT) systemer, med fokus på pålitelighet og ytelse.\r\n2) Prinsipper, arkitekturer og mekanismer for feiltolerant\/robust design og drift av tjenersystemer og nett.\r\n3) Grunnleggende modeller og metoder for kvantitativ trafikk- og ytelsesevaluering av data- og telekommunikasjonnett\/systemer.\r\n4)Arkitekturer, mekanismer og grunnleggende analyse av tjenestekvalitet i Internett.\r\n\r\nB. Ferdigheter:\r\n1) Å designe systemer med formålstjenlig bruk av feiltoleranse, gjenopprettingsmekanismer og redundans for å møte krav om driftssikkerhet.\r\n2) Å kunne kvantitativt evaluere tilgjengelighet og pålitelighet av IKT systemer ved hjelp av Markov modeller.\r\n3) Å kunne modellere og kvantitativt evaluere data- og telekommunikasjonnett\/systemer med hensyn på trafikkhåndteringsevne og ytelse.\r\n\r\nC. Generell kompetanse:\r\n1) Bevisstgjøring av pålitelighet som en viktig faktor i bruken og økonomien ved IKT systemer, herunder den potensielle virkningen av feil på kommersielle anvendelser, på samfunnet, samt for sikkerheten til mennesker og miljø.\r\n2) Evne til å kommunisere, gjennomføre grunnleggende resonnement og kreativt tenkning  omkring trafikk- og ytelsesutfordinger med data- og telekommunikasjonsnett\/systemer i en videre sammenheng."}
,{"norwegian_name":"Design av reaktive systemer 2","code":"TTM4160","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset dreier seg om hvordan man konstruerer effektive og pålitelige programvareløsninger for distribuerte reaktive systemer generelt og telematikksystemer spesielt, med utgangspunkt i en formell spesifikasjon uttrykt med språket UML.\r\nDet er seks hovedtemaer i kurs: 1) Implementering av tilstandsmaskin: Syntaks, semantikk og realiseringsaspekter av eksekverbare tilstandsmaskin diskuteres. 2) Implementasjonsdesign: Her lærer man om hvordan eksisterende spesifikasjoner kan bli overført til tekniske komponenter. I tillegg skal man forstå hvordan systemspesifikasjoner kan tilpasses slik at behov av spesiell maskinvare blir oppfylt. 3) Programvaredesign: Mønster of metoder som er nødvendig for å lagre eventdreven programvare undervises. Det inkluderer intern organisasjon og grensesnittaspekter av programvarekomponenter. 4) Systemutvikling med Reactive Blocks: Studenten skal lære seg å forstå systemer på forskjellige spesifikasjonstrinn, bruk av applikasjonsmønstere i programvareutvikling og modelbasert programvareutvikling i praksis.\r\n5) Applikasjonsdesign: Strukturen av moderne systemer i Internet of Things området blir diskutert. Det behandles særlig relevante aspekter som tidsnok reaksjon og kommunikasjon. 6) Testing: Studentene skal lære om hovedidéene og metoder for å teste systemer.","learning_goal":"A. Kunnskap:\r\n1) Den generelle karakteren av distribuerte og reaktive systemer, hvordan systemene kan modelleres, og rollen modellering spiller for å garantere at utviklingsprosessen er ferdig i tide og leder til systemer av høy kvalitet.\r\n2) Utvalgte modelleringspråk, metoder og verktøy, spesielt språk brukt i industriell praksis som UML og TTCN.\r\n3) Generelle prinsipp for å tilfredsstille sanntids-, pålitelighets- og ytelserestriksjoner.\r\n4) Systemvalidering gjennom testing.\r\n5) Implementasjonsdesign: De prinsipielle forskjellene mellom spesifikasjons- og designmodeller og deres realisering i maskin- og programvare, inkludert vesentlige vekselvirkninger mellom design og implementering og deres løsninger.\r\n6) Verktøy for spesifikasjon, design, implementering og analyse: Modellbasert utvikling fra abstrakte systemmodeller via designsyntese til kodegenerering og eksekvering.\r\n\r\nB. Ferdigheter:\r\n1) Analyse av eksisterende systemer, nettbaserte tjenester og applikasjoner.\r\n2) Spesifikasjon, design og implementering av nye systemer, nettbaserte tjenester og applikasjoner som oppfyller fastlagte krav.\r\n3) Praktisk utvikling, eksekvering og bruk av utvalgte tjenester som Javabaserte plattformer for distribuerte mobile tjenester.\r\n\r\nC. Generell kompetanse:\r\n1) Anvendelse av prinsippene for programvaredesign av distribuerte sanntidssystemer.\r\n2) Grunnleggende forståelse for mekanismene i støttesystemer og plattformer og konkret erfaring i realisering av et telesystem ved hjelp av en UML-basert utviklingsteknikk og et Java rammeverk."}
,{"norwegian_name":"Digital økonomi","code":"TTM4165","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Digitaliseringen av økonomien er en av de viktigste samfunnsendringene i vår tid. Digitale teknologier har forandret forretningsvirksomhet så vel som hvordan personer lever og samhandler med hverandre og med omgivelsene. Dette emnet omhandler den digitale økonomien og hvordan den digitale økonomien samspiller med marked, samfunn og organisasjoner. Vi vil lære om hvordan Internet, delingsøkonomi, sosial nettverkstjenester, BigData og mobilkommunikasjon har forandret den globale forretningsvirksomheten og hvordan man skaper verdi for mennesker og bedrifter i det digitale samfunnet. \r\n\r\nEmnet består av to hoveddeler:\r\n1) Grunnleggende teori innen digital økonomi, inkludert: verdiskapningsmodeller, digitale forretningsmodeller, markedsmodellering og markedsregulering. \r\n2) Digital økonomi i kontekst og hvordan den digitale økonomien samspiller med samfunnet som helhet, miljø, fattigdomsbekjempelse, personvern, strategi, finansielle operasjoner og byutvkling. ","learning_goal":"A. Kunnskap:\r\n1) Å få kunnskap innen digital økonomi\r\n2) Å få kunnskap i hvordan den digitale økonomien samspiller med omgivelsene.\r\n\r\nB. Ferdigheter:\r\n1) Å kunne gjennomføre analyser av verdinettverk.\r\n2) Å kunne analyser og konstruere en forretningsmodell.\r\n3) Å bli i stand til å skrive en selvstendig kronikk om egenvalgt tema innenfor emnets fagområder. \r\n"}
,{"norwegian_name":"Kommunikasjonsteknologi, introduksjon","code":"TTM4175","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Dette er et introduksjonsemne til fagområdet kommunikasjonsteknologi. Emnet har et fokus på praktisk lab-arbeid. Emnet består av tre deler:\r\n1. Introduksjon til grunnleggende kommunikasjonsteknologi, inkludert en introduksjon til teknisk rapportskriving.\r\n2. Lab-oppgave i etisk hacking\r\n3. Lab-oppgave innenfor tingenes internett\r\n","learning_goal":"Hovedlæringsmålet for emnet er å gi studentene grunnleggende kunnskap innen fagområdet kommunikasjonsteknologi, erfaring og ferdigheter innen laboratorie-arbeid, og motivere for videre studier innen kommunikasjonsteknologi.\r\n\r\nDetaljerte læringsmål er som følger:\r\nA. Kunnskap:\r\n1) Å få en grunnleggende og overordnet forståelse av fagområdet kommunikasjonsteknologi.\r\n2) Å få en grunnleggende forståelse for sikkerhetsmekanismer.\r\n3) Å få en grunnleggende forståelse for hvordan en applikasjon kan bygges opp av eksisterende komponenter, og hvordan disse komponentene samhandler.\r\n\r\nB. Ferdigheter:\r\n1) Å bli i stand til å skrive en teknisk rapport basert på et praktisk lab-arbeid.\r\n2) Å bli i stand til å bruke verktøy innen sikkerhet.\r\n3) Å bli i stand til å utvikle applikasjoner fra eksisterende komponenter. \r\n4) Å bruke utviklingsverktøy.\r\n5) Å finne relevant informasjon på nettet.\r\n"}
,{"norwegian_name":"Nettverkshåndtering","code":"TTM4180","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Overordnet fokus er på signalering og kontroll i Internett. Kurset er delt i to, et micro nivå med fokus  på kontroll av en enkelt nettverksnode gjennom programmering og et macro nivå med fokus på Internett som system med hovedvekt på interdomene komponenter. På micro nivå er det fokus på programmering av ulike kontroll oppgaver ved hjelp av konseptet Software Defined Networking (SDN). Emner som kan inngå i macro delen av kurset er «Business models» og «interchange» avtaler, BGP, BGP som en informasjonsbærer, og ruting.  ","learning_goal":"A Kunnskap:\r\n- Dybdekunnskap i Internett som system, med fokus på inter-domene komponentene\r\n- Basiskunnskap om inter-domene rutingprotokollen BGP\r\n- Basiskunnskap om hvordan BGP kan brukes som signalerings\/ informasjonsutvekslings protokoll\r\n- Basis forståelse av ruting tjenester\r\n- Basiskunnskap om konseptet Software Defined Networking (SDN)\r\n- Basis kunnskap i programmering i en nettverkssammenheng\r\n\r\nB Ferdigheter:\r\n- Å kunne formidle og  diskutere systemet som tilsammen sørger for basis kommunikasjonstjenestene i Internett\r\n- Å kunne konstruere, implementere,  kode, og feilrette enkle nettverk kontroll program\r\n-Bruk av nettverksemuleringsverktøy\r\n"}
,{"norwegian_name":"Sikkerhet og robusthet i IKT system","code":"TTM4185","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Kurset vil fokusere på informasjonssystem og kommunikasjonsnett som kritisk infrastruktur, hvor sentrale funksjoner (basis, drift, ivaretakelse av tjenestekvalitet), og egenskaper som autonomi og heterogenitet beskrives.\r\nDet vektlegges å vise hvordan kommunikasjonsnett er integrert med andre system, som for eksempel Content Delivery Networks, P2P, Virtual Networks, Clouds,  Emergency (wireless) networks, Sensor networks, Business critical systems, Smart Grids, og å diskutere hva som kan skje ved angrep og feil. Det vil bli innført en beskrivende taksonomi (kun engelske begrep), som inkluderer Information security, privacy, safety, dependability, survivability, performability, og en klassifisering av uønskede hendelser (trusler). Trusler inkluderer både menneskeskapte (både intensjonelle, inkompetanse, ignoranse, uhell, uoverskuelige), og tilfeldige og naturskapte (omgivelse\/natur, vær, slitasje).\r\nDet finnes en rekke mottiltak, og i dette kurset vil man få en oversikt over virkemidler som er teknologiske (sikkerhetsmekanismer, feilunngåelse og feiltolerant design, målinger\/overvåkning, standarder), organisatoriske (beredskap, rolleavklaring, kommunikasjon mellom operasjonelle enheter), og politiske, inklusive lover og regulativer (e-Governance).  Kurset legger vekt på kvalitative vurderinger og vil gi enkelt innføring i metodikk som risk management og anvendelse av grafteori.\r\n","learning_goal":"A. Kunnskap: \r\nÅ få grunnleggende forståelse for:\r\n- hvordan informasjonssystem og kommunikasjonsnett understøtter og samvirker med andre samfunnskritiske system\r\n- informasjonssystems og kommunikasjonsnetts kritikalitet, kompleksitet og mangfold (teknologisk, organisatorisk, samspill aktører)\r\n- måter å representere informasjonssystem og kommunikasjonsnett på for evaluering av best mulig design\r\n- ulik taksonomi for å beskrive sikkerhets og robusthetsegenskaper, -trusler, og -mottiltak\r\n- det brede trusselbildet gjennom ulike risikoer (alt fra menneskeskapte til tilfeldige, ondsinnede til uheldig kombinasjon av tilfeldige hendelser)\r\n- forskjellige mottiltak for å sikre informasjonssystem og kommunikasjonsnett mot slike trusler (herunder teknologiske, organisatoriske, reguleringer og lover, økonomiske, politiske)\r\n- at det er et kompromiss mellom krav til kvalitet og trygghet (sikkerhet, pålitelighet, ytelse), kostnad (OPEX\/CAPEX), miljøhensyn (energi-effektivisering),\r\n- bruk av kontrakter og avtaler (f.eks. Terms of Service, Service Level Agreements, privacy policies, etc) for å beskrivende dette\r\n\r\nB. Ferdigheter: \r\n- å lære metodisk tilnærming til analyse av risikoer\/trusler\r\n- å bli i stand til å gjennomføre enkle risikoanalyser\r\n- å bli i stand til å bruke grafer for å representere kompleksitet og kvalitativ analyse av effekt av trusler\r\n- å bli i stand til å identifisere og prioritere passende mottiltak mot trusler"}
,{"norwegian_name":"Kommunikasjonsteknologi for SmartGrid","code":"TTM4190","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Dette emnet vil gi en grunnleggende innføring i kommunikasjonsteknologi, informasjonssikkerhet og digitalteknikk i kontekst av SmartGrid. Emnet er delt inn i tre deler med følgende innhold:\r\n1. Kommunikasjonsteknologi: Kommunikasjonsnett og -tjenester, internett, mobile nett, TCP\/IP, lagdeling. \r\n2. Informasjonssikkerhet: Grunnleggende begreper. Kryptering. Trusler og risiko. Tekniske, menneskelige og organisatoriske perspektiver. \r\n3. Digitalteknikk: Tallsystemer og binær aritmetikk. Boolsk algebra, logiske porter og forenklingsmetoder. Kombinatoriske kretser og enkle minnekomponenter, vipper, tellere, skiftregistre, og enkle aritmetikkretser.\r\n\r\n\r\n","learning_goal":"A. Kunnskap:\r\nStudentene skal \r\n1) Forstå ulike tallsystemer og forstå hvordan binær aritmetikk utføres. \r\n2) Kjenne til digitale kretselementer som porter og vipper og forstå hvordan disse kan brukes til å bygge opp kombinatoriske kretser, aritmetiske kretser og enkle minnekretser. \r\n3) Forstå Boolsk algebra og ulike forenklingsmetoder som kan benyttes ved design av digitale kretser og systemer. \r\n4) Kjenne de mest fundamentale konsepter, prinsipper og teknologier som er grunnlaget for kommunikasjonsnett og tjenester. Dette inkluderer arkitektur, prinsipper som omhandler nettbaserte tjenester, svitsje teknikker, sikkerhetsmekanismer, funksjonalitet og protokoller i nettets fem ulike kommunikasjonslag.\r\n5) Ha grunnleggende kjennskap til risikobilde, trusler og mottiltak for å sikre informasjonssikkerhet.\r\n\r\nB. Ferdighet:\r\nStudentene skal \r\n1)  Kunne utnytte Boolsk algebra og forenklingsmetoder til å analysere og konstruere digitale kretser og systemer bygget opp av digitale kretselementer som porter og vipper. \r\n2) Kunne resonere og drøfte arkitektur, prinsipper, og teknologier ved design og implementering av kommunikasjonsnett og tjenester. \r\n3) Kunne forklare hvordan og hvorfor nettets fem lag fungerer. \r\n4) Kunne resonere og drøfte informasjonssikkerhet på et grunnleggende nivå og vurdere risiko for kommunikasjonssytemer.\r\n"}
,{"norwegian_name":"Telematikk, fordypningsprosjekt","code":"TTM4502","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Forberedende prosjekt til masteroppgaven. Studenten skal velge en forskningsoppgave og undersøke den med tanke på: motivasjon, bakgrunnsmateriale, metode, utvikling av hypoteser, testing av verktøy og generell forberedelse for å gjennomføre forskningsoppgaven som en del av masteroppgaven.","learning_goal":"Studenten skal forberede seg til masteroppgaven gjennom å arbeide med en forskningsoppgave knyttet til valgt hovedprofil. \r\n\r\nA. Kunnskap: Inngående bakgrunnskunnskap til valgt problemstilling og motivasjon for valgt oppgave.\r\n\r\nB. Ferdigheter: Test og evaluere metodeverktøy for bruk til å analyses valgt problemstilling. \r\n\r\nC. Generell kompetanse: Anvendelse av vitenskapelige arbeidsmetoder, bl.a. å innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap. Videre skal studenten gi en kortfattet muntlig presentasjon av arbeid og resultater, samt å skrive en prosjektrapport i hht. normen for slike."}
,{"norwegian_name":"Nett og tjenestekvalitet, fordypningsemne","code":"TTM4516","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"- Studie av eksempelsystem. \r\n- Bruk av diskret hendelsessimulering (DES) og analytiske metoder for å vurdere løsninger og forstå fenomener i IKT-systemer .\r\n- Utvikling av en DES-modell for et system\r\n- Simulator-utvikling og -validering\r\n- Dataanalyse og evaluering av systemegenskaper.\r\n- Bruk av (forenklede) analytiske modeller.\r\n- Resultatdiskusjon. \r\n- Dokumentasjon av metode og resultater.\r\n- Presentasjon muntlig og i labrapport.","learning_goal":"A. Kunnskap:\r\n- Metoder for å evaluere tjenestekvalitet (QoS), f.eks. pålitelighet og ytelse, i kommunikasjonssystemer. \r\n- Få forståelse av samspillet mellom systemløsning og tjenestekvaliteten systemet leverer.\r\n\r\nB. Ferdigheter:\r\n- Fra en system-beskrivelse, velge riktig abstraksjonsnivå for en evaluering mhp QoS.\r\n- Etablere modeller som basis evalueringinger.\r\n- Utvikle diskrete hendelses simulatorer, basert på generiske primitiver.\r\n- Bruke\/utvikle enkle analytiske modeller.\r\n- Bruke simulering, og teoretiske verktøy og metoder for å studere tjenestekvalitet, f.eks trafikk- og\/eller pålitelighets-egenskaper.\r\n\r\nC. Generell kompetanse: \r\n- Presentere\/rapportere muntlig og skriftlig.\r\n- Delta i tekniske diskusjoner. \r\n- Ansvar for plan og fremdrift."}
,{"norwegian_name":"Tjenester og systemutvikling, fordypningsemne","code":"TTM4526","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Aktuelle og avanserte tema innen modell-basert konstruksjon av fordelte systemer som utvikling av selvadaptive systemer, særlig med OSGi, og aspekter av å gjøre systemene sikre, pålitelige og høytytende.\r\n","learning_goal":"Det obligatoriske temaet har følgende mål:\r\nA. Kunnskap:\r\n1) Forståelse for grunnleggende teknikker og prinsipper for selvadapsjon.\r\n2) Inngående forståelse for utvalgte teknikker og løsninger.\r\n3) Kjennskap til noen tekniske systemer.\r\n\r\nB. Ferdigheter:\r\nPraktisk utvikling av et utvalgt applikasjonsekesmpel.\r\n\r\nC. Generell kompetanse:\r\nErfaring med å skrive et state-of-the-art essay basert på litteraturstudie."}
,{"norwegian_name":"Etisk hacking - Informasjonssikkerhet, fordypningsemne","code":"TTM4536","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset dekker de viktigste teknikkene som brukes av hackere og penetrasjonstestere for å oppnå bedre forsvar mot inntrengere og sikkerhetsbrudd i kjørende systemer, inklusive lav-nivå kjerne- og maskinvaretemaer, teknikker for web-applikasjoner, exploit teknikker, rootkits og noen undersøkelsesteknikker som brukes i digital etterforskning.","learning_goal":"A. Kunnskap: Studentene skal lære de underliggende prinsipper og teknikker forbundet med cybersikkerhet praksis kjent som penetrasjonstesting eller etisk hacking. De vil lære om hele penetrasjonstesting prosessen, som inkluderer planlegging, rekognosering, skanning, utnytting, post-utnyttelse og resultatrapportering.  B. Ferdigheter: For hver offensiv penetrasjonsteknikk skal studentene lære det tilsvarende avbøtende tiltaket. På denne måten skal studentene utvikle en praktisk forståelse av dagens cybersikkerhet problemstillinger og hvordan feilene some gjøres av brukere, administratorer, og programmerere kan føre til usikkerheter som kan bli utnyttet."}
,{"norwegian_name":"Blokkjede-teknologier og kryptovalutaer - Informasjonssikkerhet, fordypningsemne","code":"TTM4537","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet dekker den kryptografiske teorien som understøtter Bitcoin og andre kryptovalutaer, samt de praktiske aspektene av hvordan en kryptovaluta er designet. Fordelene og ulempene ved ulike tilnærminger vil bli utforsket. Flere generelle bruksområder av blokkjede-teknologier vil også bli inkludert.","learning_goal":"A. Kunnskap: Studentene skal lære de underliggende prinsippene og teknikkene knyttet til blokkjede-teknologier. De vil bli kjent med de kryptografiske byggeklossene og hvordan de brukes i en typisk kryptovaluta som Bitcoin. \r\n\r\nB. Ferdigheter: Studentene skal utvikle en praktisk forståelse av hvordan kryptovalutaer er implementert og de praktiske begrensningene av eksiterende blokkjede- og kryptovalutasystemer."}
,{"norwegian_name":"Digital økonomi, fordypningsemne","code":"TTM4546","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Aktuelle og avanserte tema innen digital økonomi, som forretningsmodeller og verdiskapning for digitale tjenester, økonomi knyttet til operasjonalisering og drift av IKT infrastruktur. Prising av IKT tjenester. Kostnadsanalyser av IKT systemer.","learning_goal":"A. Kunnskap:\r\n1) Å få en dyp forståelse for avanserte tema innen teleøkonomien, inkludert: verdiskapning i teleindustrien, forretningsmodeller, kostanalyser av telenett og nettbaserte tjenester og modellering av telemarkeder.\r\n\r\nB. Ferdigheter:\r\n1) Å bli i stand til å identifisere og beregne konkurranse scenarioer i IKT markeder.\r\n2) Å bli i stand til å gjennomføre kostanalyser av telenett og nettbaserte tjenester."}
,{"norwegian_name":"Telematikk, masteroppgave","code":"TTM4905","credit":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Det faglige innholdet er avhengig av valgt hovedprofil.","learning_goal":"A. Kunnskap:\r\n1) Å få dyp kunnskap om ingeniørvitenskap brukt som verktøy innen kommunikasjonsteknologiområdet, innen valgt hovedprofil. \r\n2) Å få bred kunnskap om de delene av vitenskap og teknologi som er felles for hele kommunikasjonsteknologiområdet.\r\n\r\nB. Ferdigheter: \r\n1) Å kunne gjennomføre analyse, modellering, simulering og design ved å benytte verktøy om ingeniørvitenskap innen kommunikasjonsteknologiområdet på et avansert nivå innen valgt hovedprofil."}]
