{"norwegian_name":"Webteknologi","code":"IT2805","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"I dette emnet er det fokus på World Wide Web som en plattform for interaktive applikasjoner, publisering av informasjon og sosiale tjenester. Utvikling av web-applikasjoner krever brei kunnskap om den underliggende teknologien, formater og standarder som World Wide Web bygger på og i dette emnet lærer du om den underliggende kommunikasjonsprotokollen HTTP, markup språk som HTML, XHTML og XML, språk for å spesifisere formattering og transformasjoner som CSS og XSLT, dokumentmodellen DOM, interaktiv grafikk og multimediainnhold på web, programmering på klient-siden med Javascript.","learning_goal":"Kunnskap om: \r\n- historikk og utvikling av World Wide Web og assosierte teknologier\r\n- klient-tjener arkitetkuren for web og kommunikasjonsprotokollen HTTP\/HTTPS.\r\n- formater og språk som benyttes i moderne web-sider og -applikasjoner; HTML, XHTML, CSS, XML, XSLT, Javascript, DOM\r\n- webprogrammering med Javascript\/DOM (klientside)\r\n- prinsipper for god design, universell utforming, multiplattform-applikasjoner\r\n\r\nFerdigheter i:\r\n- design og utvikling av websider og webapplikasjoner\r\n- bruk av verktøy \r\n\r\nGenerell kompetanse:\r\n- anvendelse av webteknologi\r\n- innhenting av informasjon, benytte dokumentasjon og spesifikasjoner"}
{"norwegian_name":"Webutvikling","code":"IT2810","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset dekker teknologi og metoder brukt i utvikling av web-løsninger. Gjennom delprosjekter lærer studentene om rammeverk,  arkitekturer, sentrale språk, formater og standarder for web-applikasjoner og web-tjenester. Kurset er teknologi-orientert og prosjekter og delinnlevering evalueres ut fra kunnskapen og ferdighetene som er oppnådd.\t","learning_goal":"Har videregående kunnskaper i:  \r\n\u0095 teknologiene som ligger til grunn for moderne web-løsninger\r\n\u0095 arkitekturer, rammeverk, metoder og teknikker for utvikling av web-applikasjoner og web-tjenester\r\n\u0095 programmeringsspråk, teknikker og verktøy som brukes ved utvikling av web-løsninger\r\n\u0095 utvikling av dynamiske, interaktive, multi-plattform web-løsninger\r\n\u0095 formater og teknologier som brukes for å håndtere og formidle  data og informasjon i web-løsninger\r\nFerdigheter:\r\n\u0095 kan designe, utvikle og teste alle lag i en web-applikasjon \r\n\u0095 kan programmere og kode effektivt i språk og formater som benyttes\r\n\u0095 Kan evaluere egne og andres løsninger\r\nGenerell kompetanse\r\n\u0095 er i stand til å jobbe målrettet med kunnskapsinnhenting og kan utvikling egne ferdigheter i de teknologiene som inngår\r\n\u0095 kan jobbe i konstruktivt i grupper og kommunisere\/presentere meninger, vurderinger og løsninger\r\n\u0095 kan bidra til andres læring ved å gi gode tilbakemeldinger\r\n\u0095 kjenner til sentrale lover og regler som ofte må taes med i betrakning ved utvikling av web-løsninger"}
{"norwegian_name":"Informatikk prosjektarbeid II","code":"IT2901","credits":15.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Studentene vil arbeide i grupper med et bestemt prosjekt innenfor informasjonsteknologi. Instituttet vil foreslå aktuelle oppgaver. Studentene forutsettes å arbeide selvstendig med sine prosjekter og delta i kollokvievirksomhet under veiledning av ansatte fra instituttet.","learning_goal":"Å gi studentene praktisk erfaring i å gjennomføre alle faser av et  systemeringsprosjekt med en kunde. Erfaring med systemutvikling i gruppe."}