	{"norwegian_name": "Objektorientert programmering","code":"TDT4100","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende algoritmer og datastrukturer, konstruksjoner og kontrollflyt i objektorienterte språk. Modularisering og gjenbruk. Standard programvarebibliotek. Enhetstesting, feilfinning og verktøy for dette.  Objektorientert design. Bruk av klasse-, sekvens- og samhandlingsdiagrammer i UML. Bruk av design patterns. Java brukes som implementasjonsspråk.","learning_goal":"Kunnskap:\r\nStudentene skal ha kunnskap om de viktigste begrepene og mekanismene i objektorienterte språk og om hvordan objektorienterte programmer struktureres og testes.\r\nFerdigheter:\r\nStudentene skal få ferdigheter i objektorientert programmering og bruk av relevante programmeringsmetoder (koding, testing og feilfinning) og moderne utviklingsverktøy.\r\nKompetanse:\r\nStudentene skal kunne bruke objektorientert programmering for å løse praktiske problemer og utnytte mulighetene i moderne utviklingsverktøy."}
	{"norwegian_name": "Prosedyre- og objektorientert programmering","code":"TDT4102","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende og praktisk orientert programmering med programmeringsspråket C++.\r\nEmnet dekker det viktigste i programmeringsspråket samt utvalgte deler av standardbiblioteket. Gjennom øvingene får studentene omfattende erfaring i konstruksjon, feilfinning og testing av programvare.","learning_goal":"Kunnskap: \r\n- Har bred og praktisk orientert kunnskap om programmeringsspråket C++. - Kan syntaks og regler for variabeldeklarasjoner og datatyper, typekonvertering, kontrollstrukturer, funksjoner og operatorer, overlagring, klasser, arv, templates, unntakshåndtering.\r\n- Har kunnskap om automatisk og dynamiske variabler og bruk av pekere. \r\n- Har kunnskap om rekursjon, enkle algoritmer og datastrukturer.\r\n- Har kunnskap om prosedural og objektorientert modularisering av koden og har kunnskap om hvordan kode kan organiseres i flere kildekodefiler, kompilering og lenking.\r\n- Har kunnskap om standarbiblioteket, inn\/ut datahåndtering, vanlig brukte funksjoner og template-klasser.\r\n- Har kunnskap om moderne utviklingsverktøy, teknikker for feilfinning og enkel testing av egen kode.\r\n- Har kunnskap om vanlige programmeringsfeil, validering av inndata, hvordan håndtere feil og uventet oppførsel.\r\n- Har kunnskap om diagramtyper for objektorienterte programmer.\r\n\r\nFerdigheter:\r\n- Kan utvikle et program fra problembeskrivelse til fungerende og feilfri løsning.\r\n- Kjenner vanlige brukte kodingsteknikker og kan jobbe iterativt og effektivt med konstruksjon av egen kode. \r\n- Kan programmere proseduralt hvor koden er fornuftig modularisert i funksjoner og objektorientert hvor koden er organisert i klasser. \r\n- Kan velge hvilke hvilken løsning som er best for et gitt problem.\r\n- Kan skrive kode som er gjenbrukbar, lesbar og enkel å vedlikeholde.\r\n- Kan lese kode og forstå hvordan koden oppfører seg i kjøretid.\r\n\r\nGenerell kompetanse:\r\n- Kan jobbe effektivt med å analysere et problem og konstruere en løsning.\r\n- Kan kommunisere og diskutere kodeløsninger og forklare hvordan et program fungerer. Kjenne til forskjeller mellom programmeringsspråk.\r\n- Kan finne frem til å benytte nødvendige hjelpemidler, kan bruke dokumentasjon for programmeringsspråket og standarbiblioteket.\r\n- Være klar over aspekter ved programmering som kan påvirke informasjonssikkerhet."}
	{"norwegian_name": "Informasjonsteknologi, grunnkurs","code":"TDT4105","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet består at to deler: IKT-teori (1\/3) og grunnleggende prosedyreorientert programmering i Matlab (2\/3).\r\n\r\nIKT-teori:\r\n- Grunnleggende om datamaskiners oppbygging og virkemåte.\r\n- Digital representasjon av informasjon.\r\n- Algoritmer.\r\n- Nettverk og kommunikasjon.\r\n- Systemutvikling (software engineering).\r\n\r\nProsedyreorientert programmering:\r\n- Variabler og datatyper.\r\n- Input og output.\r\n- Kontrollstrukturer: Sekvens, valg, og repetisjon.\r\n- Strukturering og oppdeling av programmer; funksjoner som byggeklosser.\r\n- Datastrukturer: Vektorer (lister), tabeller, tekststrenger og poster (structures).\r\n- Filbehandling og persistent lagring av informasjon.\r\n- Rekursjon, sortering og søking.\r\n- Formulering av algoritmer i pseudokode og flytskjema.\r\n- Matlab som programmeringsomgivelse.\r\n","learning_goal":"Kunnskaper: \r\n- Har grunnleggende kunnskap om følgende hovedelementer i informasjons- og kommunikasjonsteknologi (IKT): Datamaskiner, digital representasjon av informasjon, algoritmer, programvare, kommunikasjon og nettverk.\r\n- Har grunnleggende kunnskap om grunnelementene i prosedyreorientert programmering. \r\n- Har grunnleggende kunnskap om prosessen fra problem til fungerende program. \r\n\r\nFerdigheter: \r\n- Kan anvende grunnelementene i praktisk, prosedyreorientert programmering. \r\n- Kan bruke relevante programmeringsverktøy.\r\n- Kan analysere et problem, finne algoritmer og datastrukturer som løser problemet, formulere en løsning som pseudokode eller flytskjema, og programmere og teste en løsning i Matlab. \r\n- Kan gjennomføre mindre programmeringsprosjekter. \r\n- Kan gjøre enkle analyser av virkemåten til IKT systemer. "}
	{"norwegian_name": "Informasjonsteknologi, grunnkurs","code":"TDT4110","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet består at to deler: IKT-teori (1\/3) og grunnleggende prosedyreorientert programmering i Python (2\/3).\r\n\r\nIKT-teori:\r\n- Grunnleggende om datamaskiners oppbygging og virkemåte.\r\n- Digital representasjon av informasjon.\r\n- Algoritmer.\r\n- Nettverk og kommunikasjon.\r\n- Systemutvikling (software engineering).\r\n\r\nProsedyreorientert programmering:\r\n- Variabler og datatyper.\r\n- Input og output.\r\n- Kontrollstrukturer: Sekvens, valg, og repetisjon.\r\n- Strukturering og oppdeling av programmer; funksjoner og moduler.\r\n- Datastrukturer: Lister, tabeller, tekststrenger, mengder, tupler og poster (dictionary).   \r\n- Filbehandling, persistent lagring av informasjon, og unntak (exception).\r\n- Rekursjon, sortering og søking.\r\n- Formulering av algoritmer i pseudokode og flytskjema.\r\n- Python som programmeringsomgivelse.\r\n","learning_goal":"Kunnskaper: \r\n- Har grunnleggende kunnskap om følgende hovedelementer i informasjons- og kommunikasjonsteknologi (IKT): Datamaskiner, digital representasjon av informasjon, algoritmer, programvare, kommunikasjon og nettverk.\r\n- Har grunnleggende kunnskap om grunnelementene i prosedyreorientert programmering. \r\n- Har grunnleggende kunnskap om prosessen fra problem til fungerende program. \r\n\r\nFerdigheter: \r\n- Kan anvende grunnelementene i praktisk, prosedyreorientert programmering. \r\n- Kan bruke relevante programmeringsverktøy.\r\n- Kan analysere et problem, finne algoritmer og datastrukturer som løser problemet, formulere en løsning som pseudokode eller flytskjema, og programmere og teste en løsning i Python. \r\n- Kan gjennomføre mindre programmeringsprosjekter. \r\n- Kan gjøre enkle analyser av virkemåten til IKT-systemer. \r\n"}
	{"norwegian_name": "Programmeringslab for datateknologi","code":"TDT4112","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet skal gi erfaring i programmering og innovasjon, planlegging, utvikling og utprøving av teknologiske løsninger, samt evaluering av disse. Studentene skal jobbe med relevant teknologi og opparbeide mestring og erfaringer som er nyttige for det videre studiet i Datateknologi. ","learning_goal":"Grunnleggende kunnskap i programmering, planlegging av mindre prosjekt,  utprøving og uttesting av egne og andres løsninger. \r\nFerdigheter i å programmere interaktive løsninger som kan inkludere sensorer, bilder, lyd og annet multimedia innhold.  Grunnleggende ferdigheter i å teste ut, vurdere og gi konstruktive tilbakemeldinger til egne og andres løsninger. \r\nGenerell kompetanse i å forholde seg selvstendig og utprøvende til programmering og datateknologi. \r\n"}
	{"norwegian_name": "Datateknologi, programmeringsprosjekt","code":"TDT4113","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet skal gi erfaring i design og programmering av datasystemer som løser rimelig\r\nkomplekse problemer men krever rimelig lite teoretisk forståelse av avanserte \r\ndatavitenskapelig konsepter.  Fokus skal være på bunn-up utvikling og bruken av modularitet og abstraksjon for å bygge stor datasystemer.  Studentene skal lære relevant verktøy for programutvikling og de skal høste nyttig erfaring for \r\nvidere studiet i Datateknologi.","learning_goal":"Grunnleggende kunnskap i programmering kombinert med planlegging og gjennomføring av et programmeringsprosjekt med noe kompleksitet. Ferdigheter i å jobbe strukturert og modulært fra problem til fungerende løsning. Generell kompetanse i prosjektarbeid og selvstendig arbeid i utvikling og  programmering."}
	{"norwegian_name": "Informasjonsgjenfinning","code":"TDT4117","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet tar vare på den delen av informatikkfaget som omfatter automatisk lagring og gjenfinning av dokumenter. I denne sammenhengen inkluderer dokumentbegrepet også lyd og bilde. Emnet inneholder disipliner som filorganisering, queryoperasjoner, dokumentoperasjoner og kunnskapsbasert gjenfinning av tekstuelle og multimedia informasjon.","learning_goal":"Studentene skal lære og forstå prinsipper, teknikker og metoder bak informasjonsgjenfinning."}
	{"norwegian_name": "Algoritmer og datastrukturer","code":"TDT4120","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Metoder for å analysere effektiviteten av algoritmer, splitt- og hersk-teknikker, rekursive løsningsmetoder. Metoder for ordning, søking i og sortering av datamengder. Datastrukturer for effektiv gjenfinning av data, dynamisk programmering og grådighetsalgoritmer. Datastrukturer for etablering av grafer og nettverk, samt metoder for gjennomløping og leting. Algoritmer for å finne beste vei(er) og koplinger (matchinger), spenntrær og maksimal flyt. Teori for problemkompleksitet. Algoritmene uttrykkes mest mulig språkuavhengig.","learning_goal":"Kunnskaper \u0096 kandidaten skal ha kunnskap om:\r\n- Et bredt spekter av etablerte algoritmer og datastrukturer med nytteverdi på tvers av mange fagområder.\r\n- Klassiske algoritmiske problemer med kjente effektive løsninger.\r\n- Komplekse problemer uten kjente effektive løsninger.\r\n\r\nFerdigheter \u0096 kandidaten skal kunne:\r\n- Analysere algoritmers effektivitet for å oppnå best mulig løsning på et gitt problem.\r\n- Formulere et problem så det rasjonelt kan løses av en algoritme.\r\n- Bruke kjente designmetoder for å konstruere nye effektive algoritmer.\r\n\r\nGenerell kompetanse \u0096 kandidaten skal være i stand til:\r\n- Å bruke kjente algoritmer og tilgjengelige programmoduler på nye problemstillinger.\r\n- Utvikle og realisere nye datatekniske løsninger på komplekse problemstillinger med rot i en praktisk virkelighet."}
	{"norwegian_name": "Algoritmekonstruksjon","code":"TDT4125","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Avanserte algoritmiske teknikker, bl.a. for å løse og håndere spesielt vanskelige (for eksempel NP-komplette) problemer.","learning_goal":"Kunnskaper \u0096 kandidaten skal ha kunnskap om:\r\n- Videregående metoder for algoritmekonstruksjon.\r\n\r\nFerdigheter \u0096 kandidaten skal kunne:\r\n- Konstruere effektive algoritmer for algoritmiske problemer.\r\n- Konstruere tilnærmede løsninger for komplekse problemer.\r\n- Konstruere heuristiske løsninger for komplekse problemer.\r\n\r\nGenerell kompetanse \u0096 kandidaten skal være i stand til:\r\n- Å håndtere komplekse algoritmiske problemer, enten ved å konstruere en eksakt eller approksimert algoritme, eller ved å lage en heuristisk løsning.\r\n- Å vise at et problem har høy kompleksitet.\r\n- Å vurdere ulike algoritmiske løsninger opp mot hverandre."}
	{"norwegian_name": "Programmering og numerikk","code":"TDT4127","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet består at to deler: Grunnleggende prosedyreorientert programmering i Python (2\/3) og\r\nnumerikk (1\/3).\r\n\r\nProsedyreorientert programmering:\r\n- Variabler og datatyper.\r\n- Input og output.\r\n- Kontrollstrukturer: Sekvens, valg, og repetisjon.\r\n- Strukturering og oppdeling av programmer; funksjoner og moduler.\r\n- Datastrukturer: Lister, tabeller, tekststrenger, mengder, tupler og poster (dictionary).   \r\n- Filbehandling, persistent lagring av informasjon, og unntak (exception).\r\n- Rekursjon.\r\n- Python som programmeringsomgivelse.\r\n- Behandling av N-dimensjonale matriser\r\n- Plotting av funksjoner\r\n\r\nNumerikk:\r\n- Numerisk integrasjon av funksjoner: Trapes-metoden, Simpsons metode, Adaptiv Simpson metode\r\n- Newtons metode for å finne funksjoners nullpunkt \r\n- Gauss-eliminasjon for å løse lineære ligningssett\r\n- Numerisk løsning av ordinære differensialligninger","learning_goal":"Kunnskaper: \r\n- Har grunnleggende kunnskap om grunnelementene i prosedyreorientert programmering. \r\n- Har grunnleggende kunnskap om prosessen fra problem til fungerende program. \r\n- Har grunnleggende kunnskap om innen numeriske metoder.\r\n\r\nFerdigheter: \r\n- Kan anvende grunnelementene i praktisk, prosedyreorientert programmering. \r\n- Kan bruke relevante programmeringsverktøy.\r\n- Kan analysere et problem, finne prosess og datastrukturer som løser problemet, formulere en løsning som pseudokode eller flytskjema, og programmere og teste en løsning i Python. \r\n- Kan gjennomføre mindre programmeringsprosjekter. \r\n- Kan utføre numeriske beregninger i Python. "}
	{"norwegian_name": "Introduksjon til kunstig intelligens ","code":"TDT4136","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet starter med å beskrive metoder for problemløsning ved hjelp av heuristisk søk i tilstandsrom. Deretter beskrives forskjellige kunnskapspresentasjonsspråk og slutningsmekanismer for maskinell\r\nproblemløsning. Representasjon i form av predikatlogikk, regler, rammer og semantiske nett behandles, og knyttes til hovedformene for resonnering - særlig regelbasert resonnering. Emnet behandler videre arkitekturer som integrerer forskjellige resonneringsmetoder, agentbaserte arkitekturer, samt arkitekturer for interaktiv problemløsning i et menneske-maskin samspill. Det gis anvendelseseksempler underveis for å belyse metodene.","learning_goal":"Emnet skal gi en generell innføring i fagfeltet kunstig intelligens (AI) og dets grunnlag hentet fra matematikk, logikk og kognitive vitenskaper. Fagfeltet sikter mot å realisere aspekter av intelligent adferd i datamaskinsystemer."}
	{"norwegian_name": "Kognitive arkitekturer","code":"TDT4137","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kognitive arkitekturer bidrar til økt integrert forståelse om oppbyggingen av intelligente systemer og hvordan disse interakterer med den eksterne verden.\r\nEmnet tar opp underliggende infrastrukturer og hvordan forskjellige subsystemer samspillerer for å skape en koherent kognisjon.  Det fokuseres blant annet på korttids- og langtids-hukommelse, representasjon av mentale strukturer, funksjonelle prosesser, og læringsmekansimer.  I denne kontekst ser en også på evaluering av brukergrensesnitt som kognitiv kompleksitetsanalyse, og på avansert multimodal interaksjon.","learning_goal":"Kunnskaper: Emnet skal gi studenten en generell innføring i begrepsapparat, metoder og teknikker innen kognitive arkitekturer. \r\nFerdigheter: Studenten skal være i stand til å benytte aktuelle metoder og teknikker.\r\nGenerell kompetanse: Studenten skal skal gjennom praktiske og teoretiske oppgaver forstå og anvende kognitive arkitekturer og ha et helhetlig bilde av intelligente systemer. Kandidaten skal kjenne fagfeltets historikk og grunnlag hentet fra kunstig intelligens, kognitive vitenskaper og bla menneske-maskin interaksjon."}
	{"norwegian_name": "Programvareutvikling","code":"TDT4140","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Programvare-prosesser, Agile Software, prosjektledelse og planlegging, System-modellering og Unified Modeling Language, Architectural Design, Software Design, Software Testing, Software Evolution, Configuration Management, Software gjenbruk, Service Oriented Architecture, Sikkerhet, Software Quality og prosessforbedring.\r\n","learning_goal":"Kunnskap:\r\nStudentene vil få kunnskap om programvareutvikling-konsepter som prosessmodeller, metoder og teknikker for architecture design, testing, planlegging, konfigurasjonsstyring og kvalitetsstyring.\r\n\r\nFerdigheter:\r\nPlanlegge og administrere små programvareutviklings-prosjekter og delta som designer \/ programmerer \/ tester i større programvareprosjekter.\r\n\r\nGenerell kompetanse:\r\nStudentene skal kunne forstå betydningen av programvareutvikling som et yrke. Studentene skal kunne forstå og samtale om komplekse programvareutviklings-prosjekter og tilhørende tekniske og organisatoriske problemstillinger."}
	{"norwegian_name": "Datamodellering og databasesystemer","code":"TDT4145","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende innføring i datamodellering, med vekt på ER-modeller. Relasjonsmodellen, relasjonsalgebra og SQL. Databasekonstruksjon. Normalisering som designteori for relasjonsdatabaser. Andre databasemodeller. Lagringsteknologier, filorganisering og aksess-strukturer. Queryutføring. Databasehåndteringssystemer. Transaksjonsbegreper, samtidig utførelse og sikkerhet mot tap av data. Dataintegritet.","learning_goal":"Kunnskaper: \r\n1. Databasesystemer \u0096 generelle egenskaper og systemstruktur.\r\n2. Datamodellering med vekt på entity-relationship-modeller.\r\n3. Relasjonsdatabasemodellen for databasesystemer, databaseskjema og dataintegritet.\r\n4. Spørrespråk: Relasjonsalgebra og SQL.\r\n5. Designteori for relasjonsdatabaser.\r\n6. Systemdesign og programmering mot databasesystemer.\r\n7. Datalagring, filorganisering og indeksstrukturer.\r\n8. Utføring av databasespørringer.\r\n9. Transaksjoner, samtidighet og robusthet mot feil.\r\n\r\nFerdigheter:\r\n1. Datamodellering med entity-relationship-modellen.\r\n2. Realisering av relasjonsdatabaser.\r\n3. Databaseorientert programmering: SQL, relasjonsalgebra og database-programmering i Java.\r\n4. Vurdering og forbedring av relasjonsdatabaseskjema med utgangspunkt i normaliseringsteori.\r\n5. Analyse og optimalisering av ytelsen til databasesystemer.\r\n\r\nGenerell kompetanse:\r\n1. Kjennskap til anvendelser av databasesystemer og forståelse for nytte og begrensninger ved slike systemer.\r\n2. Modellering av og analytisk tilnærming til datatekniske problemer.\r\n"}
	{"norwegian_name": "Avanserte databasesystemer","code":"TDT4150","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Oppbygning av databasesystemer. Optimalisering av spørringer. Parallelle og distribuerte databasesystemer. NoSQL. Nye database-arkitekturer og spørre-operatorer.","learning_goal":"Kunnskaper: \r\nKandidaten skal ha kunnskap om: \r\n- Optimalisering av spørringer. \r\n- Parallelle og distribuerte databasesystemer. \r\n- Nye database-arkitekturer og spørre-operatorer.\r\n\r\nFerdigheter: \r\n- Være i stand til å utvikle nye metoder innen databaseteknikk basert på kjennskap til eksisterende teknikker.\r\n- Evne til å kunne anvende tilegnet kunnskap til å utvikle helhetlige løsninger der databasesystem\/databaseteknikker inngår."}
	{"norwegian_name": "Datamaskiner og digitalteknikk","code":"TDT4160","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet vil inneholde terminologi, prinsipper og begrep for konstruksjon og virkemåte for ulike typer moderne datamaskiner og annet datateknisk utstyr. Grunnleggende\r\ndigitale sekvensielle kretser inkludert metoder for analyse og konstruksjon av tilstandsmaskiner. Videre hvordan datamaskiner (og andre digitale maskiner) er bygget\r\nopp av kombinatoriske og sekvensielle byggeblokker. Kort historisk oversikt over datateknikkens utvikling. Oppbygging (organisering), virkemåte og realisering av\r\ndatamaskiner og datamaskinsystemer. Datamaskinkonstruksjon på forskjellige nivå, instruksjonsformat, adresseringsmodi, prosessorarkitekturer og -typer. Grensesnitt\r\nmellom maskinvare og programvare, sammenkobling av komponenter, avbrudd, busser, lagerhierarki og hurtigbuffer (Eng. cache). Gjennomgang av sentrale datatekniske\r\nutstyrsenheter (periferi-enheter). Kort introduksjon til distribuerte systemer, innvevde (\"embedded\") systemer, parallelle datamaskiner, nye teknologier og nye\r\nanvendelser (applikasjoner).","learning_goal":"Kunnskaper: \r\n- Studenten skal kjenne til datamaskiners konstruksjon og virkemåte \r\n- Studenten skal forstå prinsippene for konstruksjon og analyse av sekvensielle digitale kretser og tilstandsmaskiner \r\n- Studenten skal forstå hvordan en enkel prosessor fungerer \r\n- Studenten skal forstå grensesnittet mellom programvare og maskinvare \r\n- Studenten skal kjenne til sentrale periferienheter \r\n- Studenten skal forstå hvordan abstraksjon og struktur benyttes for å håndtere kompleksitet i datamaskinsystemer.\r\n\r\nFerdigheter: \r\n- Studenten skal kunne formulere enkle programmer i assemblykode \r\n- Studenten skal være i stand til å anvende digitale kretselement til å konstruere grunnleggende digitale sekvensielle kretser og tilstandsmaskiner \r\n- Studenten skal være i stand til å lese skjemategninger og blokkdiagrammer \r\n- Studenten skal kunne relatere blokkdiagrammer og skjemategninger til hverandre på ulike abstraksjonsnivå. \r\n\r\nGenerell kompetanse: \r\n- Studenten skal forstå den generelle virkemåten til en datamaskin og kunne anvende denne kunnskapen i prosjekter på alle abstraksjonsnivå \r\n- Studenten skal forstå den underliggende digitale logikken som datamaskiner består av.\r\n"}
	{"norwegian_name": "Programmeringsspråk","code":"TDT4165","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Introduksjon til språkparadigmer, semantikk og beregningsmodeller. \r\nSpråkmodeller som støtter deklarativ, funksjonell, logisk, lat, dataflytorientert, distribuert, paralell programmering. \r\nProgrammeringsspråks syntaks, analyse, oversetting, tolking og semantikk.\r\nSammenlikning av egenskaper i språk mht. trygghet, typing, analyserbarhet, kjøretidssystem, semantikk, anvendelsesområde og modularisering. ","learning_goal":"Emnet skal gi: (1) Forståelse for grunntrekkene i imperative, logiske, funksjonelle og objektorienterte programmeringsspråk. (2) Praktisk kjennskap til teknikker for å implementere språk og metoder for å beskrive deres mening. (3) Evne til å forstå og sammenlikne eksisterende og kommende språk."}
	{"norwegian_name": "Metoder i kunstig intelligens","code":"TDT4171","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet er en videreføring av TDT4136 Introduksjon til kunstig intelligens. De tre hovedformene for resonnering (regelbasert, modellbasert, og casebasert) behandles, med hovedfokus på modellbasert resonnering. Resonnering med usikker og delvis manglende informasjon, gis spesiell fokus, samt grunnlaget for lærende systemer (maskinlæring). I tillegg til de symbolprosesserende metodene (spesielt Bayesianske nettverk og beslutningsgrafer) gis det også en innføring i metoder basert på nevrale nettverk.","learning_goal":"Kunnskaper: \r\nKandidaten skal ha kunnskap om: \r\n- Generelle prinsipper for kunstig intelligens (AI)\r\n- Effektiv representasjon av usikker kunnskap \r\n- Prinsipper for rasjonell beslutningstakning\r\n- Lærende\/adapterende systemer.\r\n\r\nFerdigheter: \r\n- Vurdere forskjellige rammeverk for kunstig intelligens i spesifikke brukssituasjoner\r\n- Lage systemer som realiseres aspekter av intelligent adferd i datamaskinsystemer.\r\n\r\nGenerell kompetanse:  \r\n- Kjenne fagfeltet AIs grunnlag hentet fra matematikk, logikk og kognitive vitenskaper.\r\n\r\n\r\n"}
	{"norwegian_name": "Maskinlæring og case-basert resonnering","code":"TDT4173","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet behandler prinsipper og metoder for hvordan datasystemer selv kan oppdatere sin kunnskap og problemløsningsevne. Klassiske metoder for maskinell læring basert på observerte data, samt læring som også utnytter eksisterende kunnskap gjennomgås og analyseres. Hovedvekten legges på symbolprosesserende metoder, der eksplisitte begreper og sammenhenger læres. Andre metoder som omhandles er bl.a. statistiske generaliseringer, ensemble metoder, og dyp læring. Det legges vekt på de enkelte læringsmetoders sterke og svake sider, relatert til ulike mål for læringen.\r\nI case-basert resonnering integreres læring og problemløsning ved at konkrete problemer som løses tas vare på og gjenbrukes ved løsning av nye problemer, jfr. CBR-syklusen. Numeriske og kognitive modeller for similaritetsvurdering gjennomgås, og ulike systemarkitekturer diskuteres. Videre behandles metoder der både case-spesifikk og generell kunnskap integreres i lærings- og problemløsningsfasene.","learning_goal":"Emnet skal gi en innføring i prinsipper og metoder for hvordan datasystemer kan lære av egen erfaring. Det legges vekt på en fundamental forståelse av maskinlæring generelt, som en bakgrunn for ulike spesifikke metoder. I case-basert resonnering vektlegges forståelsen av hvordan maskinlæring og problemløsning integreres."}
	{"norwegian_name": "Informasjonssystemer","code":"TDT4175","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Taksonomier for ulike typer informasjonssystemer, ERP-systemer: typisk funksjonalitet, metodikk ved valg og innføring. IS strategi, prosessforbedring. Arbeidsmetodikk ved utvikling av informasjonssystemer: analyse av organisasjoners behov, modellering av arbeidsprosesser (nåsituasjon og ønsket situasjon), evaluering av kvalitet for modeller og systemer. ","learning_goal":"Kunnskaper:\r\nKandidaten skal ha kunnskap om:\r\n- Relasjon mellom foretningsstrategi, organisasjonsstrategi og IKT-strategi.\r\n- Taksonomier for ulike informasjonssystemer.\r\n- Metodikker for innføring av informasjonssystemer.\r\n- Metodikker for kravinhenting.\r\n- Etikk og bruk av informasjonssystemer.\r\n\r\nFerdigheter:\r\nKandidaten kan:\r\n- Innhente krav for informasjonsystemer\r\n- Modellere foretningsprosesser med bruk av BPMN.\r\n\r\nGenerell kompetanse:\r\nKandidaten kan: \r\n- bidra til konsulentsvirksomhet i forhold til innføring av informasjonssystemer i (store) organisasjoner."}
	{"norwegian_name": "Menneske\u0096maskin-interaksjon","code":"TDT4180","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Introduksjon til begreper, prinsipper og praksis for konstruksjon av brukervennlige menneske-maskin grensesnitt. Oppgaveanalyse, feltstudie-teknikker, scenariebygging, iterative designmetoder, brukbarhetstesting, mentale modeller, metaforbruk, gestaltprinsipper for visuell komposisjon, empiriske og formelle evalueringsmetoder, dialogteknikker, prototypingsteknikker. ISO standarder om brukskvalitet (spesielt ISO 9241-11 og ISO 9241-210). Konstruksjon av grafiske, vindusbaserte grensesnitt med objektorienterte rammeverk. Innføring i vindussystemer.","learning_goal":"Kunnskaper: \r\nEmnet skal gi studenten en innføring i begrepsapparat, metoder og teknikker for brukersentrert design av grafiske brukergrensesnitt. Det skal også gi kunnskap om objekt-orientert konstruksjon av slike.\r\n\r\nFerdigheter: \r\nStudenten skal være i stand til å benytte aktuelle metoder og teknikker for brukersentrert design av grafiske brukergrensesnitt, samt objekt-orientert konstruksjon av slike.\r\n\r\nGenerell kompetanse:\r\nStudenten skal gjennom prosjektarbeidet i emnet ha skaffet seg erfaring med brukbarhetstesting og papirprototyping. "}
	{"norwegian_name": "Operativsystemer","code":"TDT4186","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet vil etablere definisjoner, prinsipper, rammeverk og arkitekturer innen moderne operativsystemer. Emnet vil vektlegge prosesser, trådsystemer, synkronisering, CPU-tildeling, lagertildeling, filsystemer, inn\/utenheter, vranglåshåndtering, multiprosessorsystemer og sikkerhet. Viktige eksempler vil være WINDOWS, UNIX, ANDROID & MAC OS.","learning_goal":"Kunnskaper:\r\nEmnet skal gi studentene en forståelse av hvilke oppgaver et operativsystem løser, hvordan oppgavene løses og gi en forståelse av bruksegenskapene ved et operativsystem. Temaene er operativsystemkjerne, prosesser, tråder, synkronisering, tidsdeling, minnehåndtering, filsystemer, I\/O, vranglåshåndtering, multiprosessorsystemer og sikkerhet.\r\n\r\nFerdigheter:\r\nEmnet skal gjøre studentene i stand til å kunne utnytte operativsystemet effektivt, som systemutvikler, som administrator og som sluttbruker. Studentene skal kunne programmere med tråder og synkronisering.\r\n\r\nGenerell kompetanse:\r\nEmnet skal gi studentene en forståelse av utfordringer med og løsninger for håndtering av ressurser som prosessorer og minne og gjøre studentene i stand til å håndtere grensesnitt som programvare-maskinvare."}
	{"norwegian_name": "Grunnleggende visuell databehandling","code":"TDT4195","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet består av en halvdel med bildesyntese (datagrafikk) og en halvdel med bildeanalyse (bildebehandling). Grafikk: grafiske primitiver, geometriske transformasjoner, betrakningstransformasjoner, elliminering av ikke synlige objekter og flater del I, fargerepresentasjon, belysningsmodeller og algoritmer del I. Lab med C\/C++ og OpenGL. Bildebehandling: eksempler på anvendelser av bildebehandling, lineær filtrering, histogramteknikker, Fouriertransformasjonen, restaurering, segmentering, klassifikasjon, introduksjon til 3D bildevolumer. Lab med C\/C++ eller MATLAB.","learning_goal":"Kunnskaper: Kandidaten vil tilegne seg kunnskaper om prinsipper og algoritmer i grunnleggende bildesyntese og bildeanalyse.\r\n\r\nFerdigheter: Kandidaten vil tilegne seg ferdigheter i grafikkprogrammering og programmering i bildebehandling med verktøy som er i vanlig bruk.\r\n\r\nGenerell kompetanse: Kandidaten vil få kompetanse til å realisere potensialet som ligger i teknikker for grunnleggende grafikk og bildebehandling. Kandidaten vil sitte igjen med en oversikt over feltet visuell databehandling og ha evnen til å bygge betydelige anvendelser innen visuell databehandling og til å utvide sine kunnskaper på feltet."}
	{"norwegian_name": "Parallelle beregninger","code":"TDT4200","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Optimering av algoritmer og program for både en- og flerprosessorsystemer. Valg av numeriske algoritmer, bruk av optimerte bibliotek, kompilatoroptimeringer og profilering av program. Hvordan utnytte PC-klynger og skjermkort for store beregningsoppgaver som ikke kan kjøres på bare en prosessor\/PC vil også bli gjennomgått. Parallellprogrameringsøvinger inngår i emnet.","learning_goal":"Forståelse av parallellprogrammering blir bare viktigere og viktigere ettersom nyere PCer og arbeidsstajoner tar i bruk multicore og multichip flerprosessor teknologi. \r\n\r\nKunnskap:\r\nMålet for dette emnet er derfor: Å gi studentene god forståelse for optimering av serielle algoritmer og program innen beregningsvitenskap (computational science).\r\n\r\nFerdigheter:\r\nUtvikle programeringsferdighetene til studentene på nåtidens og fremtidens flerprosessorsystemer."}
	{"norwegian_name": "Kompilatorteknikk","code":"TDT4205","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Kompilatorer er en nødvendig forusetning for all moderne programvare.  Kompilatorteknikk er et av de områdene i informatikken som tidligst ble modent og fikk en sunn teoretisk og metodisk basis. Elementer av disse teknikkene benyttes også på de fleste andre områder der man gjør inngående analyse av tekster på datamaskin.  Kurset tar opp grammatikker, leksikalsk og syntaktisk analyse, semantisk analyse, optimalisering, kodegenerering, tolkere og abstrakte maskiner, lenking og kjøretidssystemer.  Det legges vekt på konkret utforming av en kompilator som genererer kode for reelle datamaskiner. ","learning_goal":"Kunnskaper:\r\nÅ gi en grundig innsikt i teknikker for konstruksjon av kompilatorer (språkoversettere) og noe kunnskap om hvordan man utformer system-programvare i sin alminnelighet.\r\n\r\nFerdigheter:\r\nUtvikle grundig forståelse for hvordan moderne kompilatorer fungerer. I tillegg til mye programmering i C på øvingene er målet at studentene også sitter igjen med økte programmeringsferdigheter."}
	{"norwegian_name": "Helseinformatikk","code":"TDT4210","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"","learning_goal":""}
	{"norwegian_name": "Web-intelligens","code":"TDT4215","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Forvaltning av kunnskaper i web-baserte løsninger.  Semantisk Web og ontologier. Åpne, lenkede data for deling og samarbeid. Lingvistiske og statistiske teknikker for tekstmining og innholdsanalyse. Semantiske anbefalingssystemer. ","learning_goal":"Kunnskaper: Basisteknikker og semantiske språk for konstruksjon av ontologier og åpne data.  RDF(S) og OWL. SPARQL spørrespråk.  POS\/NER-tagging, sentimentanalyse og andre teknikker i innholdsanalyse.  Innholdsbaserte anbefalingssystemer. \r\n\r\nFerdigheter:  Evne til å bruke semantiske teknologier og åpne data til å analysere ustrukturert innhold på web og lage semantiske anbefalingssystemer og andre intelligente løsninger.  Evne til å definere ontologier som kan utvides og gjenbrukes av andres applikasjoner.\r\n\r\nGenerell kompetanse: Studentene skal få innsikt i hvordan semantikk og åpne data brukes til å ekstrahere, representere og tilgjengeliggjøre kunnskap på web, samt hvordan de kan brukes i intelligente applikasjoner."}
	{"norwegian_name": "Store, distribuerte datamengder","code":"TDT4225","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Introduksjon til store og distribuerte datamengder. Introduksjon til distribuerte teknikker, P2P, tid og koordinering. Moderne, effektive filsystemer med støtte for konsistens. Nøkkel\/verdi-datalagre. Aksessmetoder. Sortering av store datamengder. Utføringsstrategier for relasjonsalgebra. Eksempler på store, distribuerte datalagre\/databaser fra kjente tjenesteleverandører.","learning_goal":"Kunnskaper:\r\n- Kunnskap om distribuerte og store datamengder\r\n- Innsikt i metoder for organisering og søking i store datamengder for hurtig framhenting av informasjon\r\n- Innsikt i metoder for håndtering\/lagring av multidimensjonale data\r\n- Innsikt i metoder for sortering av store datamengder\r\n- Innsikt i utføringstrategier av relasjonsalgebra\r\n- Innsikt i forskjellige eksisternde løsninger brukt til distribuert lagring\r\n\r\nFerdigheter:\r\n- Evaluere eksisterende systemer og løsninger for lagring og forvaltning av data\r\n- Være med på utvikling av nye systemer for lagring og forvaltning av data\r\n\r\nGenerell kompetanse:\r\n- Distribuert systemer\r\n"}
	{"norwegian_name": "Grafikk og visualisering","code":"TDT4230","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Geometriske modeller og forenklinger av dem. Modellering med parametriske kurver og flater. Modellering med flateoppdeling. Hierarkisk modellering av scener. Elliminering av ikke synlige objekter og flater del II. Belysningsmodeller og algoritmer del II. Bruk av teksturer. Strålesporing. Animasjonsteknikker. Generering av skygger. Prinsipper for visualisering. Algoritmer for visualisering.","learning_goal":"Kunnskaper: Kandidaten vil tilegne seg avanserte kunnskaper om prinsipper og algoritmer i grafikk og visualsiering.\r\n\r\nFerdigheter: Kandidaten vil heve sine ferdigheter i programmering innen grafikk og visualisering gjennom arbeid med praktiske oppgaver.\r\n\r\nGenerell kompetanse: Kandidaten skal oppnå en dypere forståelse av avanserte prinsipper og algoritmer i datagrafikk og visualisering. Kandidaten skal forstå potensialet i bruken av datagrafikk og visualisering. Kandidaten skal besitte grunnlaget for ut å utføre forskningsoppgaver eller for å involvere seg i kommersielle anvendelser på feltet."}
	{"norwegian_name": "Programvaresikkerhet","code":"TDT4237","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Kurset fokuserer på sikkerhet i programvare  tar for seg sikkerhet i alle deler av utviklingsprosessen for programvare: kravinnhenting, design, implementasjon og testing. Vi vil i kurset ta for oss hvilke trusler og angrep programvare er utsatt for og hvordan man kan ta i bruk teknikker og forsvarsmekanismer for å utvikle programvare som i størst mulig grad er motstandsdyktig mot eksisterende, og nye, angrep. Kurset har et hovedfokus på web-baserte systemer. ","learning_goal":"Studentene skal i kurset lære om sikkerhet (security) i programvare og hvordan man lager sikrere programvaresystemer."}
	{"norwegian_name": "Programvarearkitektur","code":"TDT4240","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"I emnet lærer studentene å definere og forklare sentrale konsepter innen programvarearkitektur, og å kunne bruke og beskrive design- og arkitekturmønster, metoder for å designe programvarearkitekturer, metoder og teknikker for å oppnå ulike programvarekvaliteter, metoder for å dokumentere programvarearkitekturer, og metoder for å evaluere programvarearkitekturer.\r\nEmnet gir kunnskap om ulike design- og arkitekturmønster for ulike domener, og om programvarearkitektur og dataspill.\r\nEmnet gir også praktisk innføring i bruk av metoder og teknikker relatert til programvarearkitektur gjennom et prosjekt som følger en hel utviklingsprosess, samt implementering av en programvarearkitektur.\r\n","learning_goal":"Kunnskaper:\r\n- Sentrale begreper relatert til programvarearkitektur\r\n- Kvalitetskrav og kvalitetsattributter\r\n- Metoder for evaluering av programvarearkitekturer (ATAM og CBAM)\r\n- Utviklingsprosesser som inkluderer arkitekturdesign\r\n- Ulike arkitekturmønster og designmønster\r\n- Metoder for å designe programvarearkitekturer\r\n- Metoder for å spesifisere kvalitetskrav til et system\r\n- Sammenheng mellom krav, arkitektur, prosess og kvalitet\r\n- Metode for å generere en arkitektur fra et eksisterende system\r\n- Games and software architectures.\r\n\r\nFerdigheter:\r\n- Bruke design- og arkitekturmønster\r\n- Dokumentere kvalitetskrav\r\n- Dokumentere programvarearkitekturer\r\n- Evaluere programvarearkitekturer\r\n- Designe programvarearkitekturer\r\n- Implementere programvarearkitekturer\r\n\r\nGenerell kompetanse:\r\n- Forbedret ferdigheter innen generell systemutvikling\r\n"}
	{"norwegian_name": "Avansert programvareutvikling","code":"TDT4242","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kravspesifikasjon, med fokus på overgang fra brukerkrav til teknisk kravspesifikasjon og tilhørende vurderinger av realiserbarhet og testbarhet. Estimering. Testing, testplanlegging og test-drevet utvikling, ulike testtyper og testteknikker, andre valideringsteknikker, kvalitetssikring og prosessforbedring. Smidige metoder. Utviklingsmetodikk spesifikt for komponentbasert og tjenesteorientert utvikling, outsourcing og offshoring, åpen kildekode og programvare-økosystemer. Metodikk for forvaltning og vedlikehold av store programsystemer, håndtering av legacy-kode. ","learning_goal":"Kunnskaper: Innsikt i moderne prosesser og metoder for utvikling og kvalitetssikring av programvaresystemer, kjenne styrker og svakheter ved ulike teknikker og hvilke som passer å bruke i hvilke situasjoner. Dyp forståelse for koblingen mellom kravspesifikasjon, design og testing.\r\n\r\nFerdigheter: Kunne gjøre gode og velbegrunnede valg av prosesser og teknikker basert på prosjektkontekst. Kunne mestre overgangen mellom ulike deloppgaver og samhandling mellom ulike aktører i programvareutvikling.\r\n\r\nGenerell kompetanse: Evne til å forstå forskningsresultater innen programvareutvikling og kunne nyttiggjøre seg disse i videreutvikling av egen praksis.\r\n"}
	{"norwegian_name": "Samhandlingsteknologi og sosiale medier","code":"TDT4245","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Sosiale medier, datastøttet samarbeid, koordinering, delte arbeidsrom, delte informasjonsrom, samarbeidsstøtte for nomadisk brukere, samarbeidsstøtte i systemutvikling, design og evaluering av samhandlingsteknologi.","learning_goal":"Emnet skal gi studentene innsikt i datastøttet samarbeid og sosiale medier slik at de er i stand til både å vurdere mulige anvendelser og selv kunne anvende teknologien i systembygging og kunnskapsforvaltning."}
	{"norwegian_name": "Avansert programvaredesign","code":"TDT4250","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Generelle teknikker for modellering, design og realisering av modulær programvare, med fokus på industrielle teknikker og anvendelser. Komponentbasert design, komponentbaserte arkitekturer og rammeverk, distribuerte komponentbaserte systemer. Modell-drevet utvikling av programvare, kode-generering og domenespesifikk språk.\r\nTesting, kontinuerlig integrasjon og forvaltning.","learning_goal":"Kunnskaper:\r\nStudenten skal kunne generelle metoder for modellering, design og realisering av modulær programvare og modell-drevet utvikling av programvare, og hvordan disse brukes i ulike faser av utvikling og vedlikehold.\r\n\r\nFerdigheter:\r\nStudenten skal ha praktiske ferdigheter i modellering, design og realisering modulær programvare, med moderne rammeverk og verktøy, også med modell-baserte teknikker.\r\n\r\nGenerell kompetanse:\r\nStudenten skal kjenne til og kunne velge mellom ulike metoder og teknikker for utvikling av modulær programvare."}
	{"norwegian_name": "Virksomhets-arkitektur og -innovasjon","code":"TDT4252","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet fokuserer på rollen som informasjonssystemer har i en organisatorisk sammenheng, både internt i organisasjoner, og der organisasjonene er involvert i digitale økosystem og andre sammarbeidskonstellasjoner. Det vil ta for seg årsakene til at informasjonssystemer er utformet som de er ved å utforske behovene til organisasjoner og brukere, prosesser og dessuten hvilke roller systemene støtter i en organisatorisk og arbeidssammenheng. Det vil bli lagt vekt på hvordan IT kan bidra til innovasjon og verdi gjennom tjenesteutvikling og digital virksomhetsutvikling. Emnet inneholder metoder for virksomhetsmodellering, tjenestemodellering og forretningsmodellering  som vil være komplementære til modellering av datasystemer. Metoder knyttet til modellering og kvalitetssikring av modeller samt virksomhetsarkitektur vil bli presentert.","learning_goal":"Kunnskap: Kandidaten skal etablere teoretisk innsikt i forretnings-modellering, tjenesteinnovasjon, virksomhetsmodellering og metodene for å analysere og modellere organisatoriske situasjoner. \r\n\r\nFerdigheter: Kandidaten skal etablere praktiske ferdigheter i å skape gode forretnings og virksomhetsmodeller som kan øke forståelsen av design av IT systemer og utvide de perspektivene som datasystem-modeller gir. \r\n\r\nKompetanse: Kandidaten skal kunne sette emnet inn i en bredere teknologisk, forretningsmessig og sosial kontekst i forhold til den virkningen informasjonssystemer har i samfunnet.\r\n"}
	{"norwegian_name": "Datamaskinkonstruksjon","code":"TDT4255","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Avanserte emner innen konstruksjon av maskinvare. Konstruksjonsutfordringer som styrende og utførende enhet,  samlebånd og implementasjonsutfordringer som assemblyprogrammering, høynivå-programmering,  maskinvarebeskrivende språk, spesifikasjon, partisjonering, testing og verifisering.\r\nInnebygde systemer, Field-Programmable Gate Arrays (FPGAs) og instruksjonssett for mikroprosessorer.","learning_goal":"Kunnskaper:\r\n- Studenten skal ha grundig forståelse av enkle prosessorers konstruksjon og virkemåte.\r\n- Studenten skal forstå hvordan en prosessor bygges ved hjelp av byggeblokker på forskjellige abstraksjonsnivåer som registre, registerfiler, multipleksere, porter, ALUer, etc.\r\n- Studenten skal kjenne til avanserte teknikker for ytelsesøkning i en skalar prosessorkjerne.\r\n- Studenten skal forstå sentrale avveininger innen utvikling av instruksjonssett.\r\n- Studenten skal ha en grundig forståelse av hurtigbufferes (eng: cache) konstruksjon og virkemåte.\r\n\r\nFerdigheter:\r\n- Studenten skal kunne konstruere enkle prosessorer ved hjelp av et maskinvarebeskrivende språk.\r\n- Studenten skal kunne analysere problemstillinger knyttet til oppbygning av instruksjonssett.\r\n\r\nGenerell kompetanse:\r\n- Studenten skal beherske enkel datamaskinkonstruksjon og kunne anvende denne kunnskapen i prosjekter på alle abstraksjonsnivå."}
	{"norwegian_name": "Digital tjenesteinnovasjon","code":"TDT4257","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Private så vel som offentlige virksomheter leverer i økende grad tjenester heller enn å produsere varer. Eksempelvis handler avis mindre om å produsere et papirprodukt og mer om presentasjon for browser\/ mobil, målrette reklame, etablere nye tilleggstjenester for abonnentene, åpne for anbefalings tjenester basert på brukeroppførsel eller \u0096preferanser.\r\n\r\nIKT kjennetegnes av egenskaper som programmerbarhet, utvidbarhet og lagvis komponerbarhet som inviterer til utvikling av nye tjenester. IKT skaper dermed unike muligheter for tjenesteinnovasjon.\r\n\r\nKurset fokuserer på tre aspekter ved digital tjenesteinnovasjon:\r\n\r\nTjenesteøkosystem (rollefordeling, forretningsmodell, institusjonell ramme)\r\nTjenesteplattform (teknisk plattform, arkitektur, lagdelt modell)\r\nSamskapt verdi (verdi for hvem? opplevd verdi? Sitasjonsavhengig verdi?)\r\n\r\nKurset tar for seg relevante teoretiske begrep og modeller. Kurset diskuterer utvalgte case\/ eksempler\r\n","learning_goal":"Kunnskap: Kandidaten skal etablere dyp kunnskap om begrep for, modeller av og erfaringer med digital tjenesteinnovasjon\r\n\r\nFerdigheter: Kandidaten skal utvikle god evne til å identifisere, utvikle og evaluere nye tjenesteplattformer i virkelighetsnære situasjoner. \r\n\r\nKompetanse: Kandidaten skal etablere tverrfaglig kompetanse for å forstå forretningsmessige, strategiske, teknologiske og sosiale betingelser for å realisere digital tjenesteinnovasjon i praksis. "}
	{"norwegian_name": "Maskinnær programmering","code":"TDT4258","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"(a) Introduksjon: Mikrokontrollere, programvare, programmerbar logikk, perifere enheter. \r\n(b) Maskinvare: Mikrokontrollere og system der mikrokontroller er en sentral komponent eller en alternativ delløsning i systemet. Aktuelle komponenter og system:  AVR-mikrokontroller, PowerPC-prosessor integrert i FPGA, utviklingskort med mikrokontroller\/FPGA,  brikker med mikrokontroller. \r\n(c) Maskinnær programmering: Programmering i system med begrensete ressurser. Kompilatorer, C og assembler. HW\/SW-interaksjoner. Hardkode\/operativsystem for mikrokontrollersystem. \r\n(d) Grensesnitt og periferienheter: Metoder for å bruke eksterne enheter og eventuelle spesielle maskinvareressurser, samt system der prosessorer brukes som en tilleggsressurs.\r\n","learning_goal":"Kunnskaper:\r\n- Studenten skal vite hvordan utvikling for innebygde systemer (Eng. embedded systems) skiller seg fra utvikling for tradisjonelle datamaskiner\r\n- Studenten skal kjenne til forskjellige mikrokontrollere og deres vanlige periferienheter\r\n- Studenten skal kjenne til vanlige teknikker og løsninger innen maskinvarenær programmering og deres fordeler og ulemper\r\n- Student skal vite hvordan vanlige energisparingsteknikker fungerer og deres fordeler og ulemper\r\n\r\nFerdigheter:\r\n- Studenten skal beherske maskinvarenær programmering av mikrokontrollere på ulike abstraksjonsnivå (assembly vs. høynivåspråk  med og uten operativsystem)\r\n- Studenten skal kunne bruke utvalgte energisparingsteknikker \r\n\r\nGenerell kompetanse:\r\n- Studenten skal beherske maskinvarenær programmering og kunne anvende denne kunnskapen i prosjekter på alle abstraksjonsnivå"}
	{"norwegian_name": "Datamaskinarkitektur","code":"TDT4260","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Fundamentale begrep innen datamaskinarkitektur, trender, måling av ytelse, kvantitative prinsipper. Instruksjonssett-arkitektur og kompilatorens rolle. Parallellitet på instruksjonsnivå, hopp-prediksjon, tråd-nivå parallellitet, VLIW og eksempler. Konstruksjon av minne-hierarki, hurtigbuffer, lagringssystemer. Multiprosessorer, trådnivå parallellitet, delt minne arkitekturer, distribuert delt lager, synkronisering, og multithreading. Sammenkoplingsnettverk, topologier, klynger, og eksempel.","learning_goal":"Kunnskaper:\r\n- Studenten skal ha en grundig forståelse av hvordan høynivå byggeblokker som prosessorer av ulik art, hurtigbuffere, sammenkoblingsnettverk (Eng. interconnect), busser, etc. bør settes sammen til et komplett datamaskinssystem.\r\n- Studenten skal ha en grundig forståelse av moderne minnesystemers konstruksjon og virkemåte.\r\n- Studenten skal ha kjennskap til maskinvaresikkerhetstiltak som virtuelt minne og pålitelige maskinvaresoner.\r\n- Studenten skal ha en grundig forståelse av hvordan flere prosessorkjerner kan settes sammen til parallelle datamaskinarkitekturer, deriblant homogene og heterogene flerkjerneprosessorer og multiprosessorer.\r\n- Studenten skal ha kjennskap til hvorledes samspillet mellom arkitektur, systemprogramvare og applikasjon påvirker ytelsen i parallelle datamaskinsystemer.\r\n\r\nFerdigheter:\r\n- Studenten skal kunne evaluere arkitekturvalg ved hjelp av simulatorer og trekke fornuftige konklusjoner basert på disse studiene.\r\n\r\nGenerell kompetanse:\r\n- Studenten skal kunne bruke sin kunnskap om datamaskinarkitektur i utviklingsprosjekter på alle abstraksjonsnivå."}
	{"norwegian_name": "Prototyping av interaktive media","code":"TDT4262","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende begreper om software og hardware; new media art; multimediainnhold som bilder, video og lyd; åpen kildekode og åpent innhold. Sykluser av prototyping og evaluering.\r\nMetoder for å sette sammen hardwarekomponenter som prosessorer, sensorer og aktuatorer, å programmere interaktive atferd, og organisere multimediainnhold som bilder, video og lyd. Grunnleggende evalueringsprosedyrer basert på både estetisk og teknisk kvalitet. Interaktive brukeropplevelser, som immersive spaces, videospill, interaktive kampanjer. ","learning_goal":"Studentene skal lære å: \r\n\r\n- lage neste generasjons interaktive brukeropplevelser\r\n- forstå Internet of Things(IoT)\r\n- sette sammen hardwarekomponenter som prosessorer, sensorer og aktuatorer\r\n- gjøre produkter interaktive og koblet til internett ved å programmere dem\r\n- organisere multimediainnhold som bilder, video og lyd\r\n- bruke åpen kildekode og åpent innhold\r\n- samarbeide om å lage god kode\r\n- lage stadig bedre interaktive produkter med en iterativ designprosess med prototyping og brukertesting\r\n"}
	{"norwegian_name": "Datasyn og dyp læring","code":"TDT4265","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Datasyn danner grunnlaget for en automatisk forståelse av digitale bilder som i dag kan tas opp med mange forskjellige kameraenheter (f.eks. mobiltelefoner, webkameraer, dybde-bilder, MR, Ultralyd...).\r\nInnholdet i kurset varierer fra den klassiske tilnærmelsen til datasyn hvor egenskaper blir trukket ut og klassifisert til mer moderne metoder for bilde forståelse basert på maskin læring og dype nett. Kurset inneholder også en kort gjennomgang av nødvendig programmerings kunnskap og matematikk, i tillegg til basis metoder innenfor bildebehandling\/analyse, dette for at alle skal ha den nødvendige ballast for å gå videre med de mer avanserte delene av kurset. \r\nTemaer som blir adressert i kurset er det menneskelige øye og bildedannelse, filtrering i både romlig og frekvens domenet, hierarkiske strukturer og scale space, principal components analysis (PCA), egenskapsuttrekking (f.eks. Harris, SIFT) og matching (f.eks. RANSAC), unsupervised and supervised klassifisering & gjenkjenning så vel som ulike maskinlæringsmetoder, stereosyn, den essensielle og den fundamentale matrisen, optisk flow og tracking, og sist men ikke minst dype nett for datasyn.\r\nEksempler vil bli hentet fra ulike applikasjonsdomener som medisin, autonomi (droner, biler, skip) & robotikk, industriell inspeksjon osv. ","learning_goal":"Kurset gir en oversikt og forståelse av flere grunnleggende teknikker i Datasyn (Computer Vision). Avansert kunnskap på dette feltet blir stadig viktigere. Dette er spesielt sant i lys av den stadig økende tall av kameraer og annet bildebehandlingsenheter i nesten alle områder av vårt samfunn. Kurset bidrar til å bygge kompetanse for å designe og konstruere datasynsmoduler som fungerer i et totalsystem for å løse relevante problemer.  Bruksområder inkluderer industri anvendelser, autonomi (droner, biler og skip), robotikk og medisinsk bildeanalyse. Disse emnene kan være basis for ansettelse i industri eller offentlig sektor, eller de kan følges videre i forskning på doktorgradsnivå i Norge eller utenlands."}
	{"norwegian_name": "Algoritmer for bioinformatikk","code":"TDT4287","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet tar for seg algoritmiske metoder med anvendelser innen bioinformatikk, med et spesielt fokus på algoritmer og datastrukturer for søk, sammenligning og mønsteroppdaging i strenger. Emnet bruker eksempler på biologiske problemstillinger for å motivere algoritmer og løsninger, men emnets fokus er på de algoritmiske problemstillingene.","learning_goal":"Kunnskap:\r\n- Vet hvordan strengsammenligningsproblem som \"longest common subsequence\", \"edit distance\", \"local alignment\" og \"global alignment\" kan løses ved dynamisk programmering (DP).\r\n- Vet hvordan DP-løsningen for sammenligning av to strenger kan utvides til sammenligning av flere strenger (\"multiple alignment\").\r\n- Vet hvordan k-mer indekser kan brukes for eksakt og approksimativt strengsøk.\r\n- Vet hva et nøkkelordtre er, og hvordan denne indeksstrukturen bygges og brukes for strengsøk.\r\n- Vet hva et suffikstre er, hvordan denne indeksstrukturen kan bygges på lineær tid ved hjelp av Ukkonens algoritme, og hvordan suffikstre kan brukes for å løse ulike strengsøk og -sammenligningsproblem. \r\n- Vet hvordan mønster i strenger kan finnes med eksakte metoder (ved branch-and-bound) og heuristiske metoder (ved simulated annealing). \r\n- Vet sammenhengen mellom sekvenssammenstilling (assembly) og korteste superstreng-problemet og hvorfor Euler-sykel-problemet er et spesialtilfelle av sekvenssammenstilling.\r\n- Vet hva hidden Markov-modeller (HMM) er, hvordan disse kan brukes til å modellere og identifisere egenskaper med strenger, og hvordan de sentrale HMM-algoritmene \"Viterbi\", \"forward\", og \"backward\" fungerer.\r\n- Vet hva en RNA sekundærstruktur er, hvordan denne relateres til palindrom, og hvordan DP kan brukes til å finne optimale og suboptimale RNA sekundærstrukturer.\r\n\r\nFerdigheter:\r\n- Implementere kjente algoritmer og datastrukturer og bruke disse på reelle data.\r\n- Gjenkjenne varianter av kjente problemstillinger og tilpasse kjente algoritmer til å løse disse.\r\n\r\nGenerell kompetanse:\r\n- Vurdere alternativer og velge løsninger som er hensiktsmessige til å løse problemstillinger med reelle data. \r\n- Presentere egne løsninger og resultat muntlig og skriftlig."}
	{"norwegian_name": "Kundestyrt prosjekt","code":"TDT4290","credits":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Hver gruppe får en oppgave fra en kunde\/oppdragsgiver som skal gjennomføres som et prosjekt. Alle faser ved gjennomføring av et IS\/IT prosjekt skal dekkes: forstudie, kravspesifikasjon, konstruksjon, programmering og evaluering, men vekten skal legges på de tidlige fasene. Det er viktig at gruppene har god dialog med kunden. Det skal lages en prosjektrapport og holdes en avsluttende presentasjon og demonstrasjon av et kjørbart program med kunde og sensor til stede. Det er obligatorisk oppmøte til emnets oppstartsmøte som holdes tirsdag i semesterets 2. uke, til gjesteforelesninger og kurset i gruppedynamikk, og til den ukentlige veiledningen. Manglende oppmøte kan medføre at studentene ikke får anledning til å ta emnet.","learning_goal":"Kunnskaper: Å gi studentene praktisk erfaring i å gjennomføre alle faser av et større IS\/IT-prosjekt.\r\n\r\nFerdigheter:  Evne til å organisere og gjennomføre større IS\/IT-prosjekter, samt til å dokumentere og presentere resultatene til en reell kunde.\r\n\r\nGenerell kompetanse: Innsikt i prosjektarbeid og hvordan grupper kan brukes til å løse komplekse, datatekniske problemer."}
	{"norwegian_name": "Datamaskinprosjekt","code":"TDT4295","credits":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Innføring i moderne metoder, teknikker og verktøy for utvikling av datamaskinsystemer. Innledningsvis gis det forelesninger og orienteringer om de verktøy og hjelpemidler som er tilgjengelige i datamaskinlaboratoriet for spesifikasjon, konstruksjon, verifikasjon og utprøving av kretser, kretskort og systemer. Gjennomføring av et realistisk utviklingsprosjekt som gruppearbeid. Arbeidet innebærer spesifikasjon, kretskortutlegg, mikrokontrollerprogrammering, FPGA-utvikling, testing, verifikasjon og dokumentasjon.","learning_goal":"Kunnskaper:\r\n- Studenten lærer designprosessen for et innebygd system. Dette inkluderer utvikling av maskinvarenær programvare, maskinvare og kretskort samt nødvendig dokumentasjon og prosjektstyring.\r\n\r\nFerdigheter:\r\n- Studenten lærer å jobbe i gruppe med en vagt definert problemstilling\r\n- Studenten lærer utvikling, feilsøking og feilretting rettet mot rekonfigurerbar logikk, mikrokontrollere og kretskort \r\n- Studenten lærer feilsøking og feilretting på systemnivå (integrasjon).\r\n\r\nGenerell kompetanse:\r\n- Studenten lærer å jobbe i prosjekt. Dette innebærer å ta valg basert på begrenset informasjon, å leve med disse der de viste seg å være suboptimale og å evaluere valgene når bedre informasjon blir tilgjengelig.\r\n"}
	{"norwegian_name": "Datavarehus og datagruvedrift","code":"TDT4300","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet omhandler metoder og teori for å utvikle datavarehus og utføre dataanalyse vha. datagruvedrift. Datakvalitet og teknikker for preprosessering av data. Modellering og design av datavarehus. Algoritmer for klassifisering, klynging, og assosiasjonsregeldeteksjon. Praktisk bruk av programvare for dataanalyse.","learning_goal":"Kunnskaper: \r\nKandidaten skal ha kunnskap om: \r\n- Preprosessering av data og datakvalitet.\r\n- Modellering og design av datavarehus.\r\n- Generelle algoritmer for datagruvedrift.\r\n\r\nFerdigheter: \r\n- Være i stand til å designe datavarehus.\r\n- Evne til å kunne anvende tilegnet kunnskap til å vurdere data og velge hensiktsmessige metoder for dataanalyse. \r\n"}
	{"norwegian_name": "Big Data-arkitektur","code":"TDT4305","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet tar for seg hovedaspekt ved Big Data. Sentrale tema er rammeverk for Big Data-prosessering (MapReduce, Spark, Storm, etc.), datagruvedrift av Big Data, datastrømmer og analyse av tidsserier, anbefalingssystemer, og analyse av sosiale nettverk. ","learning_goal":"Kunnskaper: \r\nKandidaten skal ha kunnskap om: \r\n- Big Data rammeverk. \r\n- Dataguvedrift av Big Data. \r\n- Prosessering av datastrømmer. \r\n- Analyse av tidsserier.\r\n- Anbefalingssystemer. \r\n- Analyse av sosiale nettverk. \r\n\r\nFerdigheter: \r\n- Forstå problemstillinger rundt Big Data. \r\n- Evne til å anvende tilegnet kunnskap til å vurdere data og velge hensiktsmessige metoder for å prosessere og analysere Big Data."}
	{"norwegian_name": "Intelligent tekstanalyse og språkforståelse","code":"TDT4310","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet omfatter: menneskelige språk og språkbehandling, maskinlæring og statistiske metoder for språkførståelse og tekstanalyse, sentimentanalyse og meninggruvedrift, informasjonaksess og tekstgruvedrift, konverserende agenter, maskinoversettelse, semantikk for naturlige språk, datamaskinell lingvistisk kreativitet.","learning_goal":"Studentene skal ha en grunnleggende og praktisk forståelse av aktuelle rammeverk og metoder for tekstanalyse og naturlig språk-forståelse."}
	{"norwegian_name": "Datateknologi, fordypningsprosjekt","code":"TDT4501","credits":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Prosjektarbeid som omhandler aktuelle problemstillinger i datateknologi.\r\n\r\nOversikt over prosjektoppgaveforslag: http:\/\/www.idi.ntnu.no\/education\/fordypningsprosjekt.php \r\n\r\nFor valg av fordypningsprosjekt og informasjon om praktisk gjennomføring se siden «fordypning i datateknologi» på Innsida: https:\/\/innsida.ntnu.no\/wiki\/-\/wiki\/Norsk\/Fordypning+i+datateknologi\r\n\r\n","learning_goal":"Kunnskap: Innsikt i hvordan forskningsresultater genereres og rapporteres innen valgt spesialområde, forståelse for avansert teori og praksis innen prosjektrapportens tema. Kjenne til viktige prinsipper for forskningsetikk \/ akademisk ærlighet. \r\n\r\nFerdigheter: Evne til å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap og resultater fra egne undersøkelser. \r\n\r\nGenerell kompetanse: Kunne gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en prosjektrapport i hht. gitte retningslinjer."}
	{"norwegian_name": "Datateknologi, fordypningsemne","code":"TDT4506","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Studenten skal velge to tema à 3,75 studiepoeng. \r\nListe over aktuelle tema: http:\/\/www.idi.ntnu.no\/education\/emner.php?&p=alle&v=tema\r\nAndre tema\/emner kan velges etter avtale med instituttet.\r\nRegistrering av fordypning for datateknologi (MTDT\/MIDT) og information systems (MSINFOSYST): https:\/\/innsida.ntnu.no\/wiki\/-\/wiki\/Norsk\/Fordypning+i+datateknologi\r\nRegistering av tema for andre studieprogram og utvekslingsstudenter: www.idi.ntnu.no\/education\/mine_teorimoduler.php","learning_goal":"Kunnskap: Dyp innsikt i et teoretisk emne, fortrinnsvis med sterk relevans til det fordypningsprosjektet som studenten har valgt. \r\n\r\nFerdigheter: Evne til å fordype seg i avansert vitenskapelig litteratur og anvende denne i prosjektforskning og rapportskriving. \r\n\r\nGenerell kompetanse: Evne til å gjøre rede for og diskutere teoretisk kunnskap i relasjon til forskningsprosjekt og i en bredere samfunnskontekst. "}
	{"norwegian_name": "Eksperter i team - ICT-Enabled Social Innovation for Social Good","code":"TDT4850","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
	{"norwegian_name": "Eksperter i team - Storskala CO2-lagring","code":"TDT4855","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
	{"norwegian_name": "Eksperter i team - IT-styring av moderne lastebiler","code":"TDT4856","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjons om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
	{"norwegian_name": "Eksperter i team - Big Data Analytics and Business Intelligence","code":"TDT4857","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjons om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
	{"norwegian_name": "Datateknologi, masteroppgave","code":"TDT4900","credits":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"","learning_goal":"Kunnskap: Innsikt i hvordan forskningsresultater genereres og rapporteres innen valgt spesialområde, forståelse for avansert teori og praksis innen masteroppgavens tema. Kjenne til viktige prinsipper for forskningsetikk \/ akademisk ærlighet. \r\n\r\nFerdigheter: Evne til å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap og resultater fra egne undersøkelser. \r\n\r\nGenerell kompetanse: Kunne gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en masteroppgave i hht. gitte retningslinjer."}