{"norwegian_name":"Fysikk","code":"TFY4102","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Hovedtema: Dynamikk, bølgefysikk, termodynamikk, elektrisitet. Detaljert innhold: Dynamikk: Kinematikk. Newtons lover. Arbeid og energi. Bølgefysikk: Lydbølger og andre mekaniske bølger. Lys. Termodynamikk: Termisk utvidelse. Varmekapasitet. Termodynamiske prosesser: Adiabatiske prosesser i ideell gass, sykliske varmekraft- og kjøleprosesser. Varmelærens 1. og 2. hovedsetning. Elektrisitet: Elektrisk felt og potensial. Elektrostatisk energi. Strøm i elektriske kretser.","learning_goal":"Overordnet læringsmål: Gjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram.\r\nDetaljerte læringsmål: Gjennom basisemnet i fysikk skal studenten:\r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning).\r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode.\r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser.\r\n- Lære et relevant begreps- og formelapparat.\r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på.\r\n- Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger.\r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning.\r\n- Lære å gjøre rede for grunnleggende fysiske fenomener.\r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse.\r\n- Få trening i å skrive en vitenskapelig rapport."}
{"norwegian_name":"Fysikk","code":"TFY4104","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Hovedtema: Dynamikk, elektromagnetisme. Detaljert innhold: Dynamikk: Kinematikk. Newtons lover. Arbeid og energi. Dreiemoment. Treghetsmoment. Dreieimpuls. Konserveringslover. Harmonisk svingning, resonans. Elektromagnetisme: Elektrostatikk, magnetisme, elektromagnetisk induksjon, DC- og AC-kretser.","learning_goal":"Overordnet læringsmål: Gjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. Detaljerte læringsmål: Gjennom basisemnet i fysikk skal studenten: - Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning). - Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode. - Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser. - Lære et relevant begreps- og formelapparat. - Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på. - Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger. - Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning. - Lære å gjøre rede for grunnleggende fysiske fenomener. - Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse. - Få trening i å skrive en vitenskapelig rapport."}
{"norwegian_name":"Fysikk","code":"TFY4106","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Hovedtema: Dynamikk inkl mekaniske bølger, termodynamikk. \r\nDetaljert innhold: Dynamikk: Kinematikk. Newtons lover. Arbeid og energi. Dreiemoment. Treghetsmoment. Dreieimpuls. Svingninger. Resonans. Bølgefysikk: Mekaniske bølger. Lydbølger. Dopplereffekt. Interferens. Termodynamikk: Termisk utvidelse. Varmekapasitet. Varmetransport. Ideell gass. Sykliske varmekraft- og kjøleprosesser. Carnot-prosessen. Varmelærens 1. og 2. hovedsetning.","learning_goal":"Overordnet læringsmål: Gjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. Detaljerte læringsmål: Gjennom basisemnet i fysikk skal studenten:\r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning).\r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode.\r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser.\r\n- Lære et relevant begreps- og formelapparat.\r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på.\r\n- Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger.\r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning.\r\n- Lære å gjøre rede for grunnleggende fysiske fenomener.\r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse.\r\n- Få trening i å skrive en vitenskapelig rapport. "}
{"norwegian_name":"Fysikk","code":"TFY4109","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Generell innføring i newtonmekanikk inkludert svingninger og mekaniske bølger, samt spesiell relativitetsteori. Newtons bevegelsesligninger. Bevarelse av energi, impuls og dreieimpuls. Mekaniske svingninger. Mekaniske bølger, lyd.  Eksperimentelle arbeidsmåter, metoder for måling av fysiske størrelser, databehandling, tolkning og dokumentasjon. ","learning_goal":"Overordnet læringsmål: \r\nGjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. \r\n\r\nDetaljerte læringsmål: \r\nGjennom basisemnet i fysikk skal studenten: \r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning). \r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode. \r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser. \r\n- Lære et relevant begreps- og formelapparat. \r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på. - Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger. \r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning. \r\n- Lære å gjøre rede for grunnleggende fysiske fenomener. \r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse. \r\n- Få trening i å skrive en vitenskapelig rapport."}
{"norwegian_name":"Fysikk","code":"TFY4115","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Hovedtema: Mekanikk, varmelære. Detaljert innhold: Mekanikk: Punktpartikkeldynamikk. Statikk og dynamikk for stive legemer. Konserveringslover for energi, bevegelsesmengde og spinn. Svingninger. Varmelære: Varmelærens hovedsetninger. Temperatur, indre energi, entropi. Kinetisk gassteori. Varmetransport (varmeledning, konveksjon og stråling).","learning_goal":"Overordnet læringsmål: \r\nGjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. \r\n\r\nDetaljerte læringsmål: \r\nGjennom basisemnet i fysikk skal studenten: \r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning). \r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode. \r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser. \r\n- Lære et relevant begreps- og formelapparat. \r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på. \r\n- Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger. \r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning. \r\n- Lære å gjøre rede for grunnleggende fysiske fenomener. \r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse. \r\n- Få trening i å skrive en vitenskapelig rapport."}
{"norwegian_name":"Fysikk ","code":"TFY4125","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Hovedtema: Dynamikk, bølgefysikk, termodynamikk, elektromagnetisme. Detaljert innhold: Dynamikk: Bevegelse. Arbeid og energi. Rotasjon. Dreieimpuls. Bevarelseslover. Bølger og svingninger: Harmonisk bevegelse. Tvungne svingninger og resonans. Harmoniske bølger. Dopplereffekten. Termodynamikk: Kinetisk gassteori. Første og andre hovedsetning. Entropi. Carnotsyklusen. Varmepumpe. Elektromagnetisme: Ladning. Elektrisk potensial. Elektrostatikk og kapasitans. Elektrisk strøm og likestrømskretser. Magnetisk felt. Magnetisk induksjon.","learning_goal":"Overordnet læringsmål: \r\nGjennom basisemnet i fysikk skal studenten opparbeide en forståelse av fysikk som vitenskapelig disiplin, ulike fysiske fenomener og naturvitenskapelige tenkemåter og metoder. Videre skal studenten lære å beskrive fysiske fenomener med matematiske metoder og benytte disse metodene som basis for emner som realiserer spesifikke metodemessige læringsmål i sitt studieprogram. \r\n\r\nDetaljerte læringsmål: \r\nGjennom basisemnet i fysikk skal studenten: \r\n- Etablere en grunnleggende forståelse av fysiske fenomener og fysikk som vitenskapelig disiplin, blant annet gjennom bruk av matematikk (vektor-, integral- og differensialregning). \r\n- Etablere en grunnleggende forståelse for og innsikt i fysikkens vitenskapelige metode. \r\n- Tilegne seg kunnskap til å se grunnleggende sammenhenger mellom ulike fysiske fenomener og praktiske anvendelser. \r\n- Lære et relevant begreps- og formelapparat. \r\n- Opparbeide et faglig grunnlag og en metodisk forståelse som etterfølgende emner kan bygge videre på. \r\n- Få trening i å bruke IKT-verktøy for matematisk modellering og numeriske beregninger. \r\n- Opparbeide forståelse for fysikkens grunnleggende betydning i ingeniørfagene og i egen utdanning. \r\n- Lære å gjøre rede for grunnleggende fysiske fenomener. \r\n- Få erfaring med eksperimentelt arbeid og usikkerhetsanalyse. \r\n- Få trening i å skrive en vitenskapelig rapport."}
{"norwegian_name":"Termisk fysikk","code":"TFY4165","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Termodynamikkens hovedsetninger. Arbeid, varme og indre energi. Tilstandsligninger, reversible og irreversible prosesser, entropi, termodynamiske potensialer. Maxwells hastighetsfordeling, midlere fri veilengde, varmeledning, diffusjon. Boltzmannfordelingen.","learning_goal":"Emnet skal ved en teoretisk og eksperimentell tilnærming gi studenten en grunnleggende forståelse av hvordan systemer i termisk likevekt kan beskrives med termodynamikk. Dette innebærer hvordan første og andre hovedsetning fører til begrepet entropi og gir sammenhenger mellom termodynamiske størrelser. Videre skal en lære prinsippene for varmekraftmaskiner\/kjølemaskiner, blandinger av forskjellige stoffer, energioverføring ved varmeledning og hvordan partikler på molekylnivå beveger seg (diffunderer) i et medium. Videre skal studentene lære å analysere ulike problemstillinger innen termisk fysikk med matematiske metoder samt IKT-baserte\/numeriske metoder gjennom bruk av Python."}
{"norwegian_name":"Fysikk 2","code":"TFY4170","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Bølger: Bølgefunksjon; kompleks notasjon; planbølger; kulebølger. Interferens og diffraksjon. Dopplereffekt. Bølgelikning. Mekaniske bølger, lydbølger. Lys. Dispersjon. Bølgefart og gruppefart. Bølgepakker. Fouriermetoder. Båndbredder. Kvantemekanikk: Eksperimentelt grunnlag. Bølger og partikler. Schrödingerlikningen. Bokspotensial. Harmonisk oscillator. Atomfysikk: Atomspektra. En-elektron-atom. Orbitaler. Mange-elektron-atom. Periodesystem for elementene. Materialfysikk: Molekyl og faste stoff. Elektronmodell av metall. Båndmodellen, isolator, halvleder og leder. Halvledermateriale. Dielektriske, optiske og magnetiske materialer. Superledere.","learning_goal":"Studenten skal ha grunnleggende kunnskap om bølger, kvantemekanikk, atomer, molekyler og faste stoff. I delen om bølger inngår kompleks notasjon, planbølger, kulebølger, interferens, diffraksjon, dopplereffekt, bølgeligningen, mekaniske bølger, lydbølger, lys, dispersjon, bølgefart, gruppefart, bølgepakker, Fouriermetoder og båndbredde. Når det gjelder kvantemekanikk skal studenten kunne det eksperimentelle grunnlaget, bølger og partikler, Schrødingerligningen, partikkel i boks, harmonisk oscillator. Innen atom- og molekyl-fysikk skal studenten ha kunnskap om en-elektron-atomer, orbitaler, mange-elektron atom, periodesystemet for elementene. Studenten skal kjenne til elektronmodellen av metall, isolatorer, halvledere og ledere, dielektriske, optiske, magnetiske og superledere innen faste stoffer.\r\n"}
{"norwegian_name":"Måleteknikk","code":"TFY4185","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Elektroniske kretselementer: Enkle passive kretser. Halvleder kretselementer. Aktive kretser, operasjonsforsterkere. Digitale kretser. Laboratorium i kretsteknikk: Bygging og utprøving av et utvalg av elektroniske kretser. Datamaskinlaboratorium: Simulering av kretser med dataverktøy (PSpice).","learning_goal":"Emnet skal lære studentene å bruke og konstruere elektroniske kretser, spesielt med henblikk på målinger og løsning av måleproblemer.\r\nStudentene skal lære å bygge og analysere passive kretser med hensyn på tidsforløp og frekvensrespons vha regning med komplekse tall.\r\nStudentene skal lære å bygge og analysere aktive kretser basert på operasjonsforsterkere og transistorer, samt analysere disse vha numerisk verktøy. Studentene skal lære å bygge elektroniske kretser for praktiske formål i labben, og skal lære å beherske analoge såvel som digitale\/logiske kretser, samt kjenne til oppbygging av mikrokontrollere. "}
{"norwegian_name":"Instrumentering","code":"TFY4190","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Datamaskinorientert måleteknikk: Grensesnitt, omformere, sensorer. Tilkobling av måleinstrumenter til datamaskiner. Datamaskin laboratorium: Grafisk programmering med virtuell instrumentering og programmering i LabVIEW. Et utvalg av måle- og styringsoppgaver med bruk av PC. Planlegging av eksperimenter, datapresentasjon og rapportering fra eksperimenter.","learning_goal":"Studenten skal lære prinsipper for og bruk av datamaskinassistert måleteknikk med styring av instrumenter, måleutstyr og datainnsamling. Studenten skal selvstendig kunne bedømme begrensninger som måleutstyr påfører eksperimentene. Studenten skal selvstendig kunne planlegge, gjennomføre og rapportere fra eksperimenter. Laboratorieøvingene skal gjøre studenten i stand til selv å benytte dette i måletekniske anvendelser."}
{"norwegian_name":"Optikk","code":"TFY4195","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Elektromagnetiske bølger.\r\nGeometrisk optikk. Matrisebeskrivelse av avbildningssystem. Abberasjon.  Bølgeteori og polarisasjon. Optisk bølgeledning og fiberoptikk. Koherens, korrelasjon og interferens. Fourieroptikk og diffraksjon. Optiske avbildningssystemer: øyet, kamera, teleskop, mikroskop. Introduksjon til optisk spektroskopi, lyskilder og lysdeteksjon. ","learning_goal":"Studenten skal få en introduksjon til optikk som fagdisiplin og dens rolle i det moderne samfunnet. \r\n\r\nStudenten skal beherske den geometriske optikktilnærmelsen, inkludert Fermats prinsipp, strålebaneligningen, og paraksial matriseformalisme for brytende og reflekterende optiske flater. Studenten skal få grunnleggende kjennskap til design av optiske systemer og aberrasjon, med vekt på avbildende systemer. \r\n\r\nBølgeoptikkdelen av kurset skal gi studenten solide grunnkunnskaper innen interferometri, koherens, polarisasjon og diffraksjon. Studenten skal kunne analysere og forstå interferens mellom planbølger og kulebølger, refleksjon og transmisjon av planbølger, og optisk bølgeledning innen tynne flater og optiske fibrer. Studenten skal oppnå inngående kunnskap om lysets polarisasjon og dets forandring ved refleksjon og transmisjon, og kunne analysere polarisasjonen i optiske system ved hjelp av Jones-formalismen. \r\n\r\nStudenten vil bli kjent med Fresnels og Fraunhofers diffraksjonsintegral og  deres gyldighetsområder. Studenten skal kunne utlede Braggs diffraksjonslov. Studenten skal kunne grunnleggende Fourieroptikk og bølgebeskrivelsen av bildedannelse, inkludert å bruke konvolusjonsteoremet til å analysere komplekse systemer. Studenten skal forstå sammenhengen mellom pupiller og bølgeoptikk med hensyn til oppløsning og bildekvalitet for optiske system. \r\n\r\nStudenten vil bli introdusert for ulike lyskilder inkludert lasere. Endelig vil studenten få en grundig innføring i optiske bildedannende systemer med vekt på det menneskelige øyet, kamera, teleskop og mikroskop.\r\n"}
{"norwegian_name":"Optikk, videregående kurs","code":"TFY4200","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet omhandler vekselvirkning mellom lys og materie, avansert beskrivelse av polarisasjon, modellering av klassisk tynnfilmoptikk og en introduksjon til Computational Electro-Magnetics (CEM).\r\nFor ytterligere detaljer, se beskrivelse på engelsk under academic content.","learning_goal":"Emnet skal gi studentene innsikt i vekselvirkningen mellom lys og materie, anvendelse av optiske måleteknikker. Se komplett engelsk beskrivelse under learning outcome."}
{"norwegian_name":"Kvantemekanikk II","code":"TFY4205","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Approksimasjonsmetoder i kvantemekanikk. Spredningsteori. Atomer og elektroner i magnetfelt. Koherente tilstander. Tetthetsmatrisen. Kvantisert strålingsteori. Kvante-statistikk. Målinger og fortolkninger i kvantemekanikk.","learning_goal":"Etter fullført kurs skal studentene være fortrolige med grunnbegrepene og den matematiske formalismen i kvantemekanikken: lineær algebra og sannsynlighetstolkning, Schrødinger-ligningen, stasjonære og ikke-stasjonære tilstander, rene og blandete tilstander. De skal kunne formulere problemer og løse dem både i Schrødingers formalisme med bølgefunksjoner, i Heisenbergs formalisme med matriser og i Diracs formalisme med ket-vektorer i et abstrakt Hilbert-rom. De skal ha gode regneferdigheter og god forståelse av eksempler som er gjennomgått både i dette kurset og i tidligere kurs i kvantemekanikk.\r\n"}
{"norwegian_name":"Kvanteteori for mangepartikkelsystemer","code":"TFY4210","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Klein-Gordon og Dirac-likninga. Feltkvantisering. Okkupasjonstals-representasjon for ikkje-relativistiske fermioniske og bosoniske mangepartikkelsystem. Vekselverkande elektrongass. Gittermodellar for fermion og spinn. Spinnbølgjeteori for ferro- og antiferromagnetar. Symmetriar og bevarte storleikar. Brotne symmetriar, Goldstone-moder. Green-funksjonar. Matsubara-formalisme. Mangepartikkel perturbasjonsteori og Feynman-diagram. Diverse bruksdøme.","learning_goal":"Emnet skal gi studentane ei vidareføring og utfylling av stoffet i emna FY2045\/TFY4250 Kvantemekanikk I og TFY4205 Kvantemekanikk II, der teorien blir nytta i atomfysikk, relativistisk kvantemekanikk og faststoffysikk. Studentane skal få kjennskap til sentrale eksempel på  \r\nfeltteoriar og gittermodellar for system av vekselvirkande fermion, boson, og spinn, og lære å bruke relevante teoretiske begrep og metodar til å analysere forskjellige aspekt av desse modellane. Meir spesifikt skal studentane bl.a.: \r\n- lære om relativistisk kvantemekanikk (Klein-Gordon og Dirac-likninga); \r\n- beherske bruk av kreasjons- og annihilasjonsoperatorar for  \r\nfermion- og bosonsystem; \r\n- mestre Fourier- og Bogoliubov-transformasjonar for diagonalisering av kvadratiske Hamilton-operatorar; \r\n- bli introdusert til mangepartikkel Green-funksjonar og korleis desse er relatert til diverse storleikar av interesse; \r\n- få ei innføring i perturbasjonsteori for mangepartikkelsystem, inkludert Feynman-diagram; \r\n- få kjennskap til diverse andre metodar, t.d. spinnbølgjeteori; \r\n- lære om sentrale begrep, inkl. kvasipartiklar, ordensparametrar, (brotne) symmetriar og Goldstone-moder."}
{"norwegian_name":"Innføring i kvantefysikk","code":"TFY4215","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Innføring i kvantemekanikk. Schrödingerligningen. Kvantemekaniske postulater. Partikkel i boks og brønnpotensial. Harmonisk oscillator. Endimensjonal spredning, tunneleffekt. Dreieimpuls. Hydrogenatomet. Atomer og molekyler. Molekylfysikk.","learning_goal":"Studenten skal: \r\n- kjenne til hovedtrekkene i historikken rundt utviklingen av kvantemekanikken, \r\n- mestre sentrale begrep som operatorer, egenfunksjoner, egenverdier og Schrödingerligningen, og vite hvordan disse inngår i den kvantemekaniske teorien, \r\n- lære hvordan en kan formulere teorien ved hjelp av et sett med grunnpostulater og sentrale teoremer, der utvikling i egenfunksjoner, stasjonære og ikke-stasjonære tilstander og kompatible observable og simultane egenfunksjoner spiller en sentral rolle, \r\n- lære å bruke formalismen, først på enkle endimensjonale systemer som potensialbrønner, harmonisk oscillator og spredning i en dimensjon, senere på tredimensjonale systemer, f.eks tredimensjonal oscillator og hydrogenatomet,\r\n- lære å anvende kvantemekanikk på atomer og molekyler."}
{"norwegian_name":"Faste stoffers fysikk","code":"TFY4220","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Atomær struktur, krystallografi, symmetrier, orden og uorden. Direkte og resiprokt rom, Brillouin-soner, strukturbestemmelse ved diffraksjon. Gittervibrasjoner, kontinuumstilnærmelsen, fononer, varmekapasitet. Fri elektrongass, Fermi-Dirac fordeling, elektroner i periodiske materialer, nesten-fri-elektron-modeller, energibånd. Intrinsikke og ekstrinsikke halvledere. Kort om magnetisme.","learning_goal":"Studentene skal få grunnleggende innsikt i faste stoffers fysikk. Dette innebærer at studentene skal: \r\n- kunne gjøre rede for krefter og bindinger mellom atomer \r\n- ha grunnleggende kjennskap til krystallsystemer og romlige symmetrier \r\n- kunne redegjøre for hvordan vi studerer krystallinske materialer med diffraksjon, inkludert konsepter som Ewaldkule, formfaktor, strukturfaktor og spredningsamplitude\r\n- kunne utføre strukturbestemmelse på enkle strukturer\r\n- forstå det resiproke rommet som konsept og kunne bruke det som et verktøy\r\n- vite betydningen av Brillouinsoner \r\n- vite hva fononer er, og være i stand til å gjøre estimat av deres dispersive og termiske egenskaper\r\n- kunne regne på termiske og elektriske egenskaper i fri-elektronmodellen \r\n- kunne Blochs teorem og vite hva energibånd er\r\n- kjenne de grunnleggende prinsippene for halvledere, inkludert pn-overganger, og kunne estimere ladningsbærermobilitet og \u0096tetthet\r\n- kunne redegjøre for hva en Fermiflate er, samt hvordan den kan måles \r\n- kjenne til grunnleggende modeller for magnetisme \r\n- kort kunne redegjøre for betydningen av faststoff-fysikk i det moderne samfunnet.\r\n"}
{"norwegian_name":"Kjerne- og strålingsfysikk","code":"TFY4225","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet beskriver modeller for kjerners oppbygging, generelle egenskaper, reaksjoner og radioaktivitetsprosesser. Videre behandles de forskjellige mekanismer for vekselvirkning mellom ioniserende stråling og materie, og grunnleggende strålingsdosimetri. Emnet inneholder anvendelser som deteksjon av stråling, analytiske metoder, kjernekraft, miljømessige strålingsbelastninger, risikobedømmelse og strålevern.","learning_goal":"Studenten skal ha kunnskap om atomkjerners oppbygging, egenskaper og reaksjoner og tilhørende strålingsegenskaper, samt strålingens vekselvirkningsmekanismer med materie. I dette inngår: modeller for kjerners oppbygging og generelle egenskaper, kjerneprosesser med vekt på alfa-, beta- og gamma-stråling knyttet til sterk, svak og elektromagnetisk vekselvirkning, mekanismer for vekselvirkning mellom ioniserende stråling og materie, strålingsdosimetri, biologiske effekter av ioniserende stråling, strålevern, kjernekraft, fusjonsreaksjoner, samt industrielle og medisinske anvendelser av kjernefysiske metoder og ioniserende stråling.\r\nStudenten skal kunne nyttiggjøre seg tabellverk og databaser for kjernefysiske prosesser og strålings vekselvirkning med materie til å beregne og vurdere forekomst og effekter av kjerneprosesser og ioniserende stråling, samt beregne doser og vurdere helseeffekter av ioniserende stråling. Studenten skal opparbeide ferdigheter i spektroskopisk analyse av beta og gamma radioaktivitet, og strålingens vekselvirkning med materie, basert på bruk av NaI-detektor og høyoppløsnings HPGe detektor koplet til computerbasert mangekanalsanalysator. Studenten skal opparbeide ferdigheter i analyse og tolkning av registrerte strålingsspektra, samt skriftlig formidle resultatet av slike spektroskopiske undersøkelser."}
{"norwegian_name":"Statistisk fysikk","code":"TFY4230","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Sannsynlighetsfordeling av mikrotilstander i termisk likevekt. Mikrokanonisk, kanonisk og storkanonisk ensemble. Sammenhengen med termodynamikk. Ideell gass, vekselvirkende klassiske gasser. Enkle spinnsystemer. En-dimensjonal Ising-modell i ytre felt. Gittervibrasjoner, fotoner og Plancks strålingslov. Kvante-statistikk. Ikke-relativistiske og relativistiske fermioner og bosoner ved høye og lave temperaturer. Bose-Einstein kondensasjon. Første og andre ordens faseoverganger. Kritiske indekser og skalalover. Bruk av numeriske pakker for simulering og analyse av utvalgte modeller fra statistisk fysikk. ","learning_goal":"Kunnskaper:\r\nEmnet gir studentene en innføring i statistisk fysikk, hovedsaklig for systemer i termisk likevekt. Studenten skal forstå kvantemekanisk og klassisk statistisk mekanikk for ideelle system, og kunne vurdere når kvanteeeffekter er viktig for oppførselen. Studenten skal forstå sammenhengen mellom mikrofysikk og termodynamikk.\r\n\r\nFerdigheter:\r\nStudenten skal kunne utføre kvantitative beregninger på ideelle systemer, kunne formulere modeller for mer realistiske systemer i statistisk fysikk, og kunne bruke standard numeriske pakker for simulering og analyse av slike.\r\n\r\nGenerell kompetanse:\r\nStudenten skal ha bygd grunnlag for videregående fysikkemner, spesielt slike som involverer mangepartikkelfysikk. Studenten skal kunne analysere og debattere samfunnsmessige problemstillinger om energi, miljø og klima basert på fundamentale prinsipper fra termodynamikk og statistisk fysikk."}
{"norwegian_name":"Numerisk fysikk","code":"TFY4235","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Lineær algebra, endelig differansemetoder, stokastiske metoder, ordinære differensialligninger, partielle differensialligninger, optimalisering, lineær programmering, genetiske algoritmer, simulert størkning, Fouriermetoder, wavelet-analyse, Monte Carlo-metoder, molekylærdynamikk, kvantemekanikk, cellulære automater.\r\n","learning_goal":"Kunnskaper: \r\nStudenten har kunnskap om et utvalg av numeriske metoder og hvordan disse kan anvendes for å løse problemer innen ulike områder av fysikk. \r\n\r\nFerdigheter og generell kompetanse: \r\nStudenten kan, med utgangspunkt i et gitt problem, formulere en strategi for å løse problemet med en eller flere relevante numeriske metoder, konkretisere denne strategien ved hjelp av prosedyreorientert programmering i et egnet programmeringsspråk, kompilere og kjøre programmet, foreta en kritisk analyse av oppnådde resultater, vurdere hvordan resultatene best kan presenteres, og kommunisere sitt arbeid skriftlig i et format som ligger nært opp til standarden for artikler i internasjonale fysikktidsskrifter. \r\n "}
{"norwegian_name":"Elektromagnetisk teori","code":"TFY4240","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Elektrostatikk. Speilingsmetoden, separasjon av variabler, Green-funksjoner. Multipolutviklinger. Elektrisk felt i stoff. Magnetostatikk. Magnetfelt i stoff. Elektromotorisk kraft, elektromagnetisk induksjon. Maxwells ligninger. Bevaringslover for ladning, energi, impuls og dreieimpuls. Elektromagnetiske bølger. Potensial og felt, gaugetransformasjoner. Stråling fra dipoler og ladninger i bevegelse. Relativitetsteori.","learning_goal":"Kandidaten har videregående kunnskaper om fenomener, beregningsmetoder og teknologiske anvendelser basert på klassisk elektrodynamikk. Kandidaten har styrket sine ferdigheter i såvel analytiske som numeriske metoder."}
{"norwegian_name":"Faststoff-fysikk, videregående kurs","code":"TFY4245","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Elektrodynamikk, superledning, dielektriske og magnetiske egenskaper, piezoelektrisitet, ferroelektrisitet, dia- og paramagnetisme, ferro- og antiferromagnetisme, magnetisk resonans, redusert dimensjonalitet, struktur, faseoverganger, kritiske fenomener, midlere feltteori, lineær respons-teori, felt og susceptibiliteter, mikroskopisk dynamikk.  \r\n","learning_goal":"Studentene skal: \r\n- Få grunnleggende innsikt i ulike vekselvirkninger mellom faste stoffer og eksterne felt (elektromagnetiske, mekaniske, termiske)\r\n-  Forstå grunnleggende elektrondynamikk i ledende materialer, inklusivt elektrostatisk skjerming, metall-isolator overganger, elektron-elektron og elektron-fonon vekselvirkninger.\r\n- Forstå vekselvirkninger mellom eksterne elektriske felt og interne responsvariabler i faste stoffer, deriblant fonon-foton kobling og plasmaoscillasjoner.\r\n - Tilegne seg kunnskap om ulike eksperimentelle metoder for studier av båndstrukturer, fononer og magnoner.\r\n- Forstå makroskopisk elektrostatisk tilnærming til beregning av lokalt elektrisk felt og dielektriske responsfunksjoner. \r\n- Få innsikt i første- og andre ordens faseoverganger og kritiske fenomener i ikke-ledende, elektrisk ledende og magnetiske materialer.\r\n- Få innføring i Landau-teori, og kobling av eksterne felt og interne responsfunksjoner gjennom faststoff-termodynamikk.   \r\n- Forstå piezo-, pyro- og ferroelektrisitet, ferroelektriske domener og hysterese.\r\n- Tilegne seg grunnleggende kunnskaper om (lavtemperatur) superledning i type I og type II superledere, samt få innføring i ulike teoretiske tilnærminger til superledning (Ginzburg-Landau, BCS). \r\n- Få forståelse for diverse fenomener relatert til superledning, så som Meissner effekten, flukskvantisering, Giæver- og Josephson-tunnelering.\r\n- Få en innføring i diamagnetisk og paramagnetisk repsons i faste stoffer gjennom semi-klassisk tilnærming.\r\n- Forstå magnetiske faseoverganger og magnetiske strukturer (ferromagnetiske, ferrimagnetiske, anti-ferromagnetiske), gjennom mean-field og spinn-bølge modeller.\r\n- Forstå fenomener relatert til magnetiske faseoverganger, så som domenedannelse og hysterese.\r\n- Tilegne seg grunnleggende kunnskaper om magnetisk resonans (NMR). \r\n"}
{"norwegian_name":"Materialfysikk","code":"TFY4255","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"i) Krystallografi: Elementær innføring. Punkt- og romgrupper. International Tables for Crystallography. ii) Diffraksjon: Kinematisk teori for elektron-, nøytron- og røntgendiffraksjon. Ordnede materialer i polykrystallinsk og en-krystallinsk form. Krystallstrukturbestemmelse. Uordnede materialer. Nano- og mikrostruktur. Småvinkel-spredning. Overflater. iii) Avbildning og spektroskopi:  Elektronmikroskopi, SEM, TEM. Røntgenmikroskopi. iv) Inhomogeniteter: Defekter, dislokasjoner; flerkomponentmaterialer. Fasediagram.\r\nMetodene vil bli illustrert med eksempler, som keramer, halvledermaterialer, organiske strukturer og \"modulerte\" strukturer, overflate-rekonstruksjoner og adsorbater; amorfe stoff, lav-dimensjonale strukturer. Utfellinger. Faseoverganger.","learning_goal":"Studenten skal kunne:\r\n- Forstå betydningen av avanserte karakteriseringsteknikker i nano- og materialvitenskap.\r\n- Tolke to-komponent fasediagrammer for faste løsninger og eutektiske blandinger.\r\n- Forstå punktgrupper, romgrupper og bruken av The International Tables for Crystallography og link gruppeteorie og krystallografi.\r\n- Bruke fourierteknikker og konvolusjonsteoremet for (delvis) krystallinske materialer.\r\n- Gjøre rede for produksjon av og egenskaper til elektron-, røntgen- og nøytronstråling, med tanke på bruk i materialforskning.\r\n- Utføre kinematiske diffraksjonsberegninger av korrelasjoner i rom og tid for materialer med varierende grad av orden.\r\n- Utføre hands-on spredningseksperimenter, inklusive dataanalyser og rapportskriving, på materialer i fast (bulk og overflater)fase.\r\n- Utnytte forskjellene knyttet til spredning ved små og store vinkler.\r\n- Forklare sammenhengen mellom diffraksjon og avbildning, med fokus på transmisjonselektronmikroskopi (TEM).\r\n- Gjøre rede for grunnprinsippene av eksempel spektroskopi teknikker i røntgen- og elektronenstrål.\r\n- Vurdere mulighetene for å benytte de ulike eksperimentelle teknikkene for å angripe strukturrelaterte problemstillinger for en rekke organiske og uorganiske materialer."}
{"norwegian_name":"Cellebiologi og cellulær biofysikk","code":"TFY4260","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet kan deles i tre områder: \r\n1) Cellens struktur og funksjon som omfatter: cellemembranen og transport over cellemembranen, cellens organeller, kjernen, cytoskjelettet, intracellulær transport og soertering av molekyler, cellesyklus og celledeling, regulering av genekspresjon, cellesignalisering og intracellulær signaloverføring, celle-cellekontakt og ekstracellulær matrix, immunologi.  \r\n2) En kvantitativ beskrivelse av cellulære prosesser som: Transportprosesser: Diffusjon, konveksjon, ionetransport, osmose. Membranpotensial. Mekaniske påkjenninger. Cellekinetikk.  \r\n3) Eksperimentelle metoder, både teoretisk og praktiske laboratorieoppgaver: Celledyrking, ulike former for mikroskopering, fraksjonering, væskestrømcytometri, elektriske egenskaper til membraner.","learning_goal":"Studenten skal ha kunnskap om cellers struktur og funksjon. Dette omfatter: cellemembranen og transport over cellemembranen, cellens organeller, kjernen, cytoskjelettet, intracellulær transport og sortering av molekyler, cellesyklus og celledeling, regulering av genekspresjon, cellesignalisering og intracellulær signaloverføring, celle-celle-kontakt, ekstracellulær matrix, og basiskunnskap innen rekombinant DNA teknologi og immunologi. Studenten skal ha kunnskap om noen sentrale eksperimentelle teknikker både den teoretiske bakgrunnen for teknikkene og praktisk bruk av dem. Cellebiologi er et fag i endring og studentene skal være i stand til å lese og forstå vitenskapelige artikler og oppdatere seg faglig innen cellebiologi. Studenten skal kunne nyttiggjøre seg kunnskapen for å drive god eksperimentell forskning der bruk av celler inngår som en sentral del. Studenten skal ha ferdigheter og beherske sentrale eksperimentelle teknikker, i første rekke lysmikroskopi."}
{"norwegian_name":"Biofysiske mikroteknikker","code":"TFY4265","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet gir en grundig innføring i virkeprinsippet til et utvalg måleinstrument som er viktige for studier av biologiske makromolekyler, celler og andre myke materialer. Kurset har som målsetting å gi en forståelse av virkeprinsippet til og oppbygning av de essensielle komponentene måleutstyret består av samt en teoretisk og praktisk innføring i hvordan instrumentet opereres, inkludert kalibreringsprosedyrer og vedlikehold. For hvert instrument vil presentasjonen av måleutstyret og dets virkeprinsipp bli etterfulgt av eksempler på nylig publiserte forskningsdata  av høy kvalitet oppnådd ved bruk av instrumentet. ","learning_goal":"Studenten skal ha kunnskap om mekanismer for molekylær eksitasjon og deeksitasjon samt forståelse av vekselvirkningen lys - biologisk prøve.\r\n\r\nStudenten skal ha kunnskap om sentrale teknikker innen lysmikroskopi samt ha praktiske ferdigheter knyttet til bruk av et utvalg av disse teknikkene. Dette innebærer en forståelse av oppbygning, virkeprinsipp samt anvendelsesområde for følgende teknikker: \r\n- Lysfeltmikroskopi med ulike kontrastteknikker (Fasekontrast-, Differensiell interferens kontrast-, Polarisasjons- og Mørkefeltsmikroskopi).\r\n- Epiillumineringsmikroskopi, herunder Fluoresensmikroskopi, Konfokal laser scanning mikroskopi, Multifotonmikroskopi.\r\n- Total indre refleksjons interferens mikroskopi.\r\n- Stimulated emission depletion microscopy (STED).\r\n- Nærfeltmikroskopi.\r\n\r\nStudenten skal ha kunnskap om design og virkeprinsipp for væskestrømscytometri. \r\n\r\nStudenten skal ha kunnskap om virkeprinsippet til følgende detektorer: \r\nDet menneskelige øye, Fotonmultiplikatorrør (PMT), Fotodioder, Videokamera, CCD kamera.\r\n\r\nStudenten skal ha kunnskap om oppbygning, virkeprinsipp og anvendelsesområde for optiske pinsetter. Dette inkluderer forståelse av prosessene som ligger til grunn for fanging av partikler med lys samt forståelse av kraftbestemmelse med optiske pinsetter.\r\n\r\nStudenten skal ha kunnskap om oppbygning, virkeprinsipp og anvendelsesområde for atomær kraft mikroskopi. Dette innebærer kunnskap om intermolekylære krefter, ulike avbildningsmoder samt dynamisk kraftspektroskopi.\r\n\r\nStudenten skal ha kunnskap om elektronmikroskopi benyttet for studier av biologiske prøver. Dette innebærer kuknnskap om vVekselvirkning elektron - biologisk prøve, elektronoptikk, transmisjon elektronmikroskopi (TEM), scanning elektronmikroskopi (SEM), scanningtransmisjons elektronmikroskopi (STEM) samt prepareringsteknikker for elektronmikroskopi.\r\n\r\nStudenten skal ha ferdigheter knyttet til tolkning av og presentasjon av vitenskapelige data oppnådd selv i forbindelse med laboratorieøvelser. Studenten skal ha ferdigheter knyttet til lesning av forskningslitteratur og formidling av denne både skriftlig og muntlig."}
{"norwegian_name":"Klassisk transportteori","code":"TFY4275","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet dreier seg om sentrale begreper i klassisk transportteori og dens anvendelser.  Følgende tema behandles: stokastiske variabler, Markovprosesser, korrelasjonsfunksjoner, Wiener-Khinchinteoremet, fluktuasjon-dissipasjonsteoremet, Chapman-Kolmogorov-Smoluchowskiligningen, masterligningen, Langevinligningen og diverse såkalte mikroskopiske ligninger for å beskrive partikkeltransport. Hovedvekten vil bli lagt på det fysiske innholdet og noen moderne anvendelser av transportteori i kjemisk reaksjonskinetikk, komplekse nettverk.","learning_goal":"Emnet gir studentene en generell innsikt i fundamentale begreper og prinsipper i klassisk transportteori, samt moderne anvendelser."}
{"norwegian_name":"Signalanalyse","code":"TFY4280","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kurset fokuserer på grunnleggende verktøy for analyse av analoge og digitale signaler og systemer. Beskrivelse av signaler som funksjon av tid og frekvens. Bruk av Laplace, Fourier og Z-transformer. Grunnleggende analog og digital filterdesign, frekvensrespons, datasampling. Eksitasjon-respons-analyse av lineære systemer. Beskrivelse og analyse av stokastiske signaler og målte signaler med støy, korrelasjoner og energispektrumanalyser. Analyse av signaler og systemer ved hjelp av matematiske metoder som involverer differensial- og integralregning, samt numeriske metoder ved hjelp av Matlab eller python. ","learning_goal":"Studenten skal: 1. Gjennom en kombinert teoretisk og eksperimentell tilnærming til faget oppnå grunnleggende forståelse for signalanalyse, samt med teoretisk og matematisk kunnskap for å beskrive signaler og systemer, analyse av målesignaler og tidsrekker.  2. Lære å analysere ulike problemstillinger innen signalanalyse med matematiske metoder som involverer differensial- og integralregning,  samt IKT-baserte\/numeriske metoder gjennom bruk av Matlab eller python. "}
{"norwegian_name":"Laserfysikk og ulineær optikk","code":"TFY4291","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Fysiske prinsipper laser, ikke-lineære optikk, laser fysikk og samspillet av vekselvirkning mellom lys og materie.  For ytterligere detaljer, se beskrivelse på engelsk under academic content.","learning_goal":"Kunnskapsmål\r\nStudentene skal:\r\n- være fortrolige med virkemåte og oppbygning av lasere \r\n- vite om egenskapene til laserstråling, og hvordan laserstråler propagerer gjennom optiske materialer og komponenter\r\n- kjenne til forskjellige lasertyper\r\n- være fortrolige med hvordan andreordens ulineær respons i krystaller kan brukes til å konvertere laserstråling fra en bølgelengde til en annen. Det vil legges vekt på intuitiv forståelse gjennom enkle matematiske beskrivelser\r\n\r\nFerdighetsmål\r\nStudentene skal kunne:\r\n- beregne egenskaper til sortlegemestråling ved forskjellige temperaturer\r\n- estimere linjebredder og effektive tverrsnitt for ulike overganger\r\n- bruke matriseoptikk til å beregne strålegang gjennom optiske komponenter\r\n- beregne stabilitetsområder, linjebredder, og resonansfrekvenser til optiske resonatorer\r\n- beregne terskler og uteffekter i forskjellige lasermedier, og estimere pulsenergier og pulsvarigheter i Q-svitsjede lasere\r\n- beregne hvordan dispersjon påvirker ultrakorte laserpulser i optiske materialer\r\n- beregne hvordan gaussiske stråler propagerer i fritt rom\r\n- beregne fasetilpasningsvinkler og parametriske forsterkningsbåndbredder for andreordens ulineariteter\r\n"}
{"norwegian_name":"Kvanteoptikk","code":"TFY4292","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet danner en basis for den kvantemekaniske beskrivelsen av optikk, lasere og koherente optiske prosesser. Tema som dekkes inkluderer: lysets kvantemekaniske natur, fotoner, fotondeteksjon, koherente og \"squeezed\" tilstander, lasere og ikkelineær optikk. Videre beskrives eksperimentelle teknikker i kvanteoptikk, som enkelt-frekvens-lasere, enkelt-foton-kilder, foton-tellere, \"squeezed\" tilstand generatorer. Framtidige realiseringer av kvantedatamaskiner, teleportering og kryptografi vil bli diskutert.","learning_goal":"Etter å ha fullført emnet forventes det at studenten har oversikt over fagfeltet kvanteoptikk - er i stand til å formulere og behandle matematiske beskrivelser av grunnleggende fenomener i kvanteoptikk, ved hjelp av det kvantiserte elektromagnetiske felt - er i stand til å formulere og behandle matematiske beskrivelser av kvanteoptisk koherens og inkoherens, samt åpne kvantesystemers dynamikk - er i stand til å forstå hvordan moderne eksperimenter i kvanteoptikk gjennomføres, spesielt med tanke på fotondeteksjon, samt beregninger, kryptografi og teleportering innenfor kvantemekanikkens rammer."}
{"norwegian_name":"Energi- og miljøfysikk","code":"TFY4300","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Jordas energibudsjett, drivhuseffekt, strålingspådrag, atmosfæriske forandringer på grunn av antropogen virksomhet.  Metoder og det fysiske grunnlaget for å utnytte tradisjonelle (fossile brensler og kjernekraft) og fornybare energikilder (sol, vind, biomasse, havbølger, tidevann og geotermisk energi). ","learning_goal":"Studentene skal kunne beskrive og forklare opphavet til globale effekter på miljøet som skyldes menneskelige aktiviteter. Studentene skal kunne beskrive det fysiske grunnlaget for utnyttelse av ulike energikilder, og kunne bruke dette til vurdering av de ulike energiteknologiene (potensiale, fordeler og ulemper). Studentene skal også kunne beskrive energiteknologiene og gjøre beregninger av virkningsgrad\/utbytte for dem."}
{"norwegian_name":"Ikkelineær dynamikk","code":"TFY4305","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Grafiske løsningsmetodar for ikkje-lineære differensiallikningar. Faseportrett, fikspunktanalyse, bifurkasjonar, grensesyklar, kaotiske attraktorar, Poincare- og Lorenz-avbildningar, fleirskala-perturbasjonsteori. Iterative avbildningar. Periodedobling, kaos, skalering og universalitet. Fraktalar.  Fysiske eksempel.          ","learning_goal":"Emnet er ein introduksjon til ikkjelineære system og kaos. Studenten skal ha grunnleggjande kunnskap om ikkjelineære differensiallikningar og iterative avbildningar. Studenten skal vere istand til å finne fikspunkt og avgjere om dei er stabile eller ustabile, analysere dei ulike typane bifurkasjonar i ein dimensjon (sadelnode, transkritisk og høygaffel)og to dimensjonar (homoklinisk, degenerert og Hopf), \r\nkonstruere bifurkasjonsdiagram og stabilitetsdiagram. For todimensjonale system skal studenten i tillegg kunne lage faseportrett og finne nedslagsfelt. Studenten skal i tillegg ha kunnskap om grensesyklar og stabiliteten deires.\r\nStudenten skal kunne analysere diskrete avbildningar, finne fikspunkt\r\nog forstå mekanismen for periodedobling. Studenten skal kjenne til dei viktigaste fraktalane, og dei topologiske og metriske eigenskapane deires. Likeeins skal studentane kjenne til dei viktigaste bisarre\r\nattraktorane i kaotiske system med diskret og kontinuerleg tid.\r\nStudentane skal få trening i å leggje fram øvingsoppgåver på tavla\r\nog løyse ikkjelineære problem med numeriske metodar. \r\n"}
{"norwegian_name":"Molekylær biofysikk","code":"TFY4310","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet fokuserer på anvendelse av utvalgte tema innen fysikk, for å beskrive molekylære egenskaper til biologiske molekyler og systemer, og noen av de mest brukte teknikkene som brukes for å bestemme disse egenskapene. ","learning_goal":"Etter gjennomført emne skal studenten være i stand til:\r\n\r\n- Å beskrive hovedtypene av intra- og intermolekylære vekselvirkninger, og forklare hvordan disse påvirker (i) konformasjon og andre dynamiske egenskaper til makromolekyler, og (ii) vekselvirkningene mellom makromolekyler og andre stoffer i vannløsning.\r\n\r\n- Å forklare teorien bak de viktigste teknikkene som brukes til å studere fysikalske, termodynamiske, hydrodynamiske og spektroskopiske egenskaper, samt spredningsegenskaper, til biologiske molekyler og molekylære systemer, samt å angi fordeler og ulemper knyttet til disse teknikkene.\r\n\r\n- Å forutsi og diskutere anvendbarheten av de studerte teknikkene på et utvalg av biofysiske systemer.\r\n\r\n- Å bruke et utvalg av instrumentelle oppsett, tolke oppnådde data, og oppsummere resultatet i skriftlige rapporter."}
{"norwegian_name":"Strålingsbiofysikk","code":"TFY4315","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en innføring i sentrale temaer innen energideponering i biologiske materialer ved bestråling med ioniserende stråling, inkludert: direkte og indirekte effekter av stråling, strålingsindusert DNA-skade og \u0096reparasjon, mekanismer for celledød etter stråling, kvantitative modeller for celledød og \u0096overlevelse, dose-respons-relasjoner, tumor- og normalvevsresponser, hovedprinsipper for bruk av ioniserende stråling i kreftbehandling, de 5 R'ene bak rasjonalet om fraksjonering, tid-dose-fraksjonering, terapeutisk ratio, den lineær-kvadratiske modell, modeller for tumorkontrollsannsynlighet- og normalvevs komplikasjonssannsynlighet, dose-rate-effekt, volumeffekt, oksygeneffekt, tumormikromiljø og hypoksi, kombinasjon av stråling med kjemoterapi og biologisk målrettede medikamenter, strålesensibiliserende og -beskyttende forbindelser, hypertermi, proton- og ioneterapi. \r\n\r\n","learning_goal":"Studenten opparbeider inngående kunnskap om vekselvirkning mellom ioniserende stråling og biologisk materiale, med hovedvekt på mekanismer for induksjon og reparasjon av strålingsinduserte molekylære og cellulære effekter, samt bruk av ioniserende stråling i kreftbehandling.\r\n\r\nStudenten opparbeider ferdigheter i bruk av ulike matematiske modeller for estimering av strålingsindusert celledød og celleoverlevelse. \r\n\r\nStudenten opparbeider ferdigheter innen tolkning og presentasjon av vitenskapelige data ervervet gjennom praktiske laboratorieoppgaver og gruppearbeid. Studenten opparbeider ferdigheter innen lesing og presentasjon av forskningslitteratur. \r\n\r\n"}
{"norwegian_name":"Fysikk i medisinsk avbildning","code":"TFY4320","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Apparatur for nukleærmedisinsk bildediagnostikk, emisjons-tomografi (SPECT, PET). Apparatur for røntgen-diagnostikk, digital radiografi, transmisjonsdatatomografi (CT). Anvendelser av ultralyd i medisinsk diagnostikk. Magnetresonans-tomografi (MRI). Teoretisk beskrivelse av bildedannelse, støy i medisinske bilder, rekonstruksjonsalgoritmer for tomografi, medisinsk bildebehandling. Kvalitetssikring i medisinsk bildediagnostikk. \r\n","learning_goal":"Studentene skal ha kunnskap om fysiske prinsipper og metoder som anvendes i medisinsk diagnostikk basert på medisinsk avbildning. Dette omfatter å kunne forklare prinsipper og framgangsmåter for computerbasert tomografi (CT) ved nukleærmedisinsk avbildning, røntgenavbildning og avbildning ved magnetisk resonans. Studenten skal også kunne redegjøre for ulike former for ultralydavbildning, og hvordan slik avbildning prinsippielt er forskjellig fra avbildningsprinsippene ved CT.\r\nStudenten opparbeider ferdigheter i å vurdere ytelsesparametre, anvendelsesområder, samt fordeler og ulemper ved de ulike formene for medisinsk avbildning.\r\n"}
{"norwegian_name":"Nanoverktøy","code":"TFY4330","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet behandler karakteriserings- og strukturingsteknikker med en høy romlig (mindre enn 100 nm) oppløsning, som er relevant for nanoteknologi. Aktuelle teknikker kan være sveipe- og transmisjonselektronmikroskopi, focused ion beam og atomkraftmikroskopi.\r\nI tillegg blir bilde- og databehandling diskutert. Teori og teknikker blir anvendt i labøvinger.\r\n\r\n","learning_goal":"Etter kurset skal studenten være i stand til å trekke ut og validere eksperimentelle resultater fra diskuterte teknikker. Resultatene kan bli innhentet selv eller av andre.\r\nStudenten skal kunne planlegge og optimalisere et typisk eksperimentelt oppsett som brukes i nanoteknologi, basert på gitt oppgave eller forkunnskap."}
{"norwegian_name":"Bionanovitenskap","code":"TFY4335","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet vil behandle oppbyggingen av biologiske molekyler med særlig fokus på strukturell form, dannelse, bio-identifikasjon og selvorganisering. Biofysikalske fenomen av betydning innenfor bionanovitenskap som Brownske bevegelser, diffusjon, transport, intermolekylære prosesser, cooperativ transitions, enkle polymer kjeders egenskaper, molekylære maskiner og motorer, nanoroboter vitenskap og science fiction& vil bli diskutert. Videre vil anvendelse av biologiske molekyler og prosesser i utvikling av sensorer og komponenter, for eksempel bionanosensorer, elektroniske komponenter for interaksjon med celler, mikro- og nanofluidkomponenter bli behandlet.\r\n","learning_goal":"Etter fullført kurs skal studenten kunne: \r\n\r\n(1) bruke forenklede fysiske modeller for å beskrive ulike prosesser som er viktig for forståelsen av cellulære funksjoner. Spesielt, forstå fysiske krefter nødvendig for å forstå og beskrive intermolekylære krefter, betydningen av entropi, elektrostatiske vekselvirkninger i løsning, entropi krefter, transport fenomena som diffusjon og betydningen av brownske bevegelser\r\n(2) vite hvordan man kan beskrive, modellere og måle mekaniske egenskaper til polymer kjeder og intermolekylære vekselvirkninger, forstå hvordan inter- og intra-molekylære vekselvirkninger påvirker mekaniske egenskaper til biopolymerer, proteiner og nukleær syrer\r\n(3) forstå egenskapene til vann på micro- og nanometer skala, noe som er viktige for cellulære funksjoner og design av biosensorer; forstå  konseptet av mikrofluid devices og fysiske fenomener som er viktige for deres funksjon. Være i stand til å designe og lage enkle \"mikrofluidic devices\"\r\n(4) forstå hvordan levende organismer omgjør kjemisk energi til mekanisk arbeid\r\n(5) implementere noen av de fysiske modellene diskutert i kurset til datasimuleringer i Matlab\r\n"}
{"norwegian_name":"Nanofysikk","code":"TFY4340","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Nanoteknologi gjør det mulig å lage elektroniske kretser på en lengdeskala der både partikkel- og bølgeegenskapene til elektronene er viktige. Dette har banet veien for oppdagelsen av en rekke nye fysiske effekter der noen brukes i moderne nanoelektronikk. Dette kurset vil ta for seg noen av de mest sentrale nano-skala-fenomenene, der både klassisk fysikk og kvantemekanikk benyttes i forståelsen. Aktuelle tema er bl.a: kvantisert konduktans, Coulomb-blokkade, Büttiker-Landauer-formalisme, svak lokalisering, universelle konduktansfluktuasjoner, kvante-Hall-effekt, Aharonov-Bohm-effekt, gigantisk magnetmotstand, grafen.","learning_goal":"Studenten skal, med relativt enkle fysiske modeller anvendt på nye eksperimentelle resultater, lære hvordan grunnleggende fysikk kan brukes til å beskrive og forstå oppførselen til elektroner i nano-skala materialer. Kurset vil forhåpentlig motivere for både teoretisk og eksperimentell fordypning av elektrontransport i nanomaterialer.\r\nKunnskaper: Studenten skal kjenne til sentrale effekter og fenomener relatert til elektrontransport i nanofysikk.\r\nFerdigheter: Studenten skal lære å analysere effekter og fenomener i nanofysikk med bruk av grunnleggende klassisk fysikk og kvantemekanikk, standard matematiske metoder og enkle numeriske beregninger.\r\nGenerell kompetanse: Studenten lærer å søke opp, lese og formidle litteratur nær forskningsfronten i nanofysikk."}
{"norwegian_name":"Klassisk mekanikk","code":"TFY4345","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Føringer og generaliserte koordinater. Virtuelle forskyvninger, Lagranges ligninger. Variasjonsregning, Hamiltons prinsipp. Lagrangefunksjon for partikkel i elektromagnetisk felt. Bevegelseskonstanter og symmetriegenskaper. Virialteoremet. Sentrale krefter. Litt om stive legemers kinematikk og dynamikk. Spesiell relativitetsteori. Normalkoordinater. Hamiltons ligninger. Kanoniske transformasjoner. ","learning_goal":"Etter å ha gjennomført emnet skal studenten kunne:\r\n- Forklare nytten av å utnytte symmetrier og bevaringslover i fysiske systemer samt kunne benytte seg av disse i praktiske beregninger. Dette inkluderer roterende og oscillerende systemer.\r\n- Kjenne til ulike problemløsningsstrategier innenfor mekanikk samt vurdere hvilken av disse strategiene som er mest hensiktsmessig å bruke for et gitt problem.\r\n- Forstå det fysiske prinsippet bak utledningen av Lagrange's og Hamilton's likninger samt fordelene med disse formuleringene.\r\n- Presentere de grunnleggende prinsippene i spesiell relativitetsteori og kunne bruke Lorentztransformasjoner samt 4-vektor formalisme i konkrete beregninger som for eksempel partikkelkollisjoner. "}
{"norwegian_name":"Nanoteknologi, introduksjon","code":"TFY4350","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Undervisningen omfatter en analyse av problemstillinger som har anvendelse innen forskjellige områder som nanomaterialer, bionanoteknologi, nanoelektronikk. Det vil bli lagt vekt på å identifisere felles teknologier av betydning for å forstå mulighetene ved nanoteknologi. Videre vil en innføring i HMS og etiske spørsmål knyttet til nanoteknologi bli diskutert. ","learning_goal":"Emnet gir en innføring i sentrale tema innen nanoteknologi, med fokus på hvordan denne tverrfaglige teknologien kan fremme innsikt og nye produkter.\r\n\r\nKunnskaper:\r\nForstå muligheter og begrensninger av nanoteknologi i bionanoteknologi, nanoelektronikk og nanostrukturerte materialer. Forstå etiske dilemma innen nanoteknologi.\r\n\r\nFerdigheter:\r\nUtføre enkle beregninger for å løse og analysere utvalgte problemer innen nanoteknologi.\r\n\r\nGenerell kompetanse:\r\nSamarbeide for å løse oppgaver.\r\nMuntlig presentere resultater av egne studier.\r\n "}
{"norwegian_name":"Biofysikk, fordypningsprosjekt","code":"TFY4500","credit":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Fordypningsprosjektet innebærer et arbeid tilsvarende 15 sp. Institutt for fysikk legger fram prosjektoppgaver som er relevante for studieretningen Biofysikk og medisinsk teknologi.","learning_goal":"Studenten skal lære å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap. Videre skal studenten lære å gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en prosjektrapport i hht. vedtatte standarder. Studenten skal også få trening i muntlig presentasjon av eget arbeid."}
{"norwegian_name":"Biofysikk, fordypningsemne","code":"TFY4505","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"I samråd med sin veileder på fordypningsprosjektet velger studenten et emne på masternivå (eller høyere) som (normalt) støtter faglig opp om temaet i fordypningsprosjektet. Et alternativ til et ordinært masteremne på 7,5 sp er å velge moduler på til sammen 7,5 sp fra følgende liste:\r\nFY8408 Innføring i MR-avbildning (3,75 sp) som ordinært emne.\r\nTFY1a Videregående emner innen MRI og PET (3,75 sp).\r\nTFY4265 Biofysiske mikroteknikker (7,5 sp) som ordinært emne, eller\r\nTFY2a Lysmikroskopi og optiske teknikker (3,75 sp),\r\nTFY2b Teknikker for enkeltmolekylstudier (3,75 sp).\r\n(Man kan ikke ta både TFY2a og TFY2b, da må man heller ta TFY4265)\r\nFY8409 Klinisk fysikk for stråleterapi (3,75 sp) som ordinært emne.\r\nFY8412 Ioniserende stråling \u0096 vekselvirkningsmekanismer og dosimetri (3,75 sp).\r\n\r\nFor nærmere beskrivelse av temaene, se nettsiden http:\/\/www.ntnu.edu\/physics\/courses\/specialmodules.\r\nAktuelle tema fra TFY4525 Bionanoteknologi, fordypningsemne kan også velges.","learning_goal":"Emnet skal gi studentene fordypning i aktuelle problemstillinger innen biofysikk og medisinsk teknologi. Dette vil normalt være problemstillinger som er relevante for det valgte fordypningsprosjektet. Forøvrig henvises det til læringsmålene som er spesifisert for det enkelte emnet."}
{"norwegian_name":"Fysikk, fordypningsprosjekt","code":"TFY4510","credit":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Fordypningsprosjektet innebærer et arbeid tilsvarende 15 sp. Institutt for fysikk legger fram prosjektoppgaver som er relevante for studieretningen Teknisk fysikk.","learning_goal":"Studenten skal lære å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap. Videre skal studenten lære å gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en prosjektrapport i hht. vedtatte standarder. Studenten skal også få trening i muntlig presentasjon av eget arbeid."}
{"norwegian_name":"Fysikk, fordypningsemne","code":"TFY4515","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"I samråd med sin veileder på fordypningsprosjektet velger studenten et emne på masternivå (eller høyere) som (normalt) støtter faglig opp om temaet i fordypningsprosjektet. Et alternativ er å velge såkalt(e) spesialmodul(er), se http:\/\/www.ntnu.edu\/physics\/courses\/specialmodules. Aktuelle tema fra TFE4575 Fysiske metoder for nanostrukturering og karakterisering, fordypningsemne, kan også velges.","learning_goal":"Emnet skal gi studentene fordypning i aktuelle problemstillinger innen fysikk. Dette vil normalt være problemstillinger som er relevante for det valgte fordypningsprosjektet. Forøvrig henvises det til læringsmålene som er spesifisert for det enkelte emnet."}
{"norwegian_name":"Nanoteknologi, fordypningsprosjekt ","code":"TFY4520","credit":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Fordypningsordningen er satt sammen av et prosjektarbeid med belastning 15 sp samt fordypningsemne på 7,5 SP. Prosjektarbeidet vil vanligvis være knyttet til pågående forskningsprosjekter relatert til nanoteknologi ved instituttet. Det legges vekt på at studentene skal lære å arbeide systematisk innenfor det aktuelle tema, samt lære å skaffe seg detaljkunnskaper gjennom litteraturstudier og praktisk arbeid.","learning_goal":"Studenten skal lære å fordype seg i et spesifikt tema innen valgt fagområde ut fra vitenskapelige arbeidsmetoder, bl.a. innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap. Videre skal studenten gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler, rapportere delresultat og skrive en prosjektrapport i hht. vedtatte standarder. Studenten skal også få trening i muntlig presentasjon av eget arbeid."}
{"norwegian_name":"Bionanoteknologi, fordypningsemne","code":"TFY4525","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet består av moduler utført ved NTNU Nanonolab innen følgende teknikker:\r\n\r\n- HMS kurs NTNU NanoLab\r\n- SEM grunnkurs\r\n- Litografi \r\n- Mikrofluidics\r\n- Partikkelsyntese\r\n- Partikkelkarakterisering\r\n- Atomærkraft mikroskopi\r\n- Biofunksjonalisering (Surface plasmon resonance)\r\n\r\n","learning_goal":"Studentene skal ha kunnskap om HMS aspekter knyttet til arbeid i renrom og nanoteknologisk forskning. Studentene skal videre ha kunnskap om virkemåten til utvalgte teknikker for forskning innenfor bionanoteknologi. Studentene skal ha videregående kunnskap innenfor faglig domene av valgbart tema. Studentene skal ha ferdigheter til å selvstendig kunne benytte utvalgte state-of-the art eksperimentelle teknikker til bionanoteknologisk forskning og skriftlig kunne kommunisere det faglige innholdet i dette.\r\n\r\n"}
{"norwegian_name":"Fysikk, prosjekt","code":"TFY4560","credit":15.0,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emne for studenter med spesielle behov for tilpasset prosjekt, typisk av hensyn til hjemmeinstitusjonens krav.","learning_goal":""}
{"norwegian_name":"Eksperter i team - Aluminium for en lettere verden","code":"TFY4851","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
{"norwegian_name":"Eksperter i team - Myke teknologier","code":"TFY4852","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
{"norwegian_name":"Eksperter i team - Nanoteknologi","code":"TFY4853","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
{"norwegian_name":"Fysikk, masteroppgave","code":"TFY4900","credit":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Veiledet forskningsprosjekt på 30 sp innen fysikk eller fysikkbasert vitenskap.","learning_goal":"Kunnskaper: \r\nStudenten skal oppnå dybdekunnskap innen fagområdet for masteroppgaven.\r\nFerdigheter:\r\nStudenten får trening i systematisk innhenting av informasjon gjennom bl.a. litteratursøk. Studenten får trening i å planlegge og gjennomføre et større selvstendig forskningsprosjekt med bruk av vitenskapelige arbeidsmetoder. Studenten lærer å skrive en omfattende vitenskapelig rapport.\r\nGenerell kompetanse:\r\nStudenten får trening i å kommunisere om faglige problemstillinger."}
{"norwegian_name":"Nanoteknologi, masteroppgave","code":"TFY4905","credit":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Veiledet forskningsprosjekt på 30 sp innen nanoteknologi.","learning_goal":"Kunnskaper: Studenten skal oppnå dybdekunnskap innen fagområdet for masteroppgaven. Ferdigheter: Studenten får trening i systematisk innhenting av informasjon gjennom bl.a. litteratursøk. Studenten får trening i å planlegge og gjennomføre et større selvstendig forskningsprosjekt med bruk av vitenskapelige arbeidsmetoder. Studenten lærer å skrive en omfattende vitenskapelig rapport. Generell kompetanse: Studenten får trening i å kommunisere om faglige problemstillinger."}
{"norwegian_name":"Biofysikk, masteroppgave","code":"TFY4910","credit":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Veiledet forskningsprosjekt på 30 sp innen biofysikk eller medisinsk teknologi.","learning_goal":"Kunnskaper: Studenten skal oppnå dybdekunnskap innen fagområdet for masteroppgaven. Ferdigheter: Studenten får trening i systematisk innhenting av informasjon gjennom bl.a. litteratursøk. Studenten får trening i å planlegge og gjennomføre et større selvstendig forskningsprosjekt med bruk av vitenskapelige arbeidsmetoder. Studenten lærer å skrive en omfattende vitenskapelig rapport. Generell kompetanse: Studenten får trening i å kommunisere om faglige problemstillinger."}