{"norwegian_name":"Matematikk 1","code":"TMA4100","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Grenser, kontinuitet, derivasjon og integrasjon av funksjoner av én variabel. Skjæringssetningen, sekantsetningen (middelverditeoremet), maksima og minima, transcendente funksjoner, implisitt derivasjon, relaterte vekstrater, ubestemte former, Newtons metode. Riemann-summer, bestemt integral og analysens fundamentalteorem, integrasjonsteknikker og numerisk integrasjon. Areal, volum, buelengde, og areal av rotasjonsflater. Følger, rekker og potensrekker. Taylorrekker, Taylors formel. Førsteordens separable og lineære differensialligninger. Eulers metode. Eksempler på matematisk modellering og anvendelser innenfor naturvitenskap, teknologi og økonomi.","learning_goal":"1. Kunnskap. Studenten forstår og kan gjenkjenne og anvende grunnleggende begreper, resultater og metoder fra envariabel matematisk analyse som omhandler grenser, kontinuitet, derivasjon, integrasjon, konvergens av følger og rekker, Taylor-polynom og Taylor-rekker. Studenten forstår og kan anvende grunnleggende numeriske metoder for løsning av ikke-lineære ligninger, differensialligninger og integrasjon. Studenten kjenner til hvilke muligheter og begrensninger som ligger i bruk av matematisk programvare.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om énvariabel matematisk analyse til å formulere og løse enkle problemer i matematikk og  naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare."}
{"norwegian_name":"Matematikk 2","code":"TMA4105","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Romkurver. Funksjoner av flere variable. Taylors setning i to dimensjoner, maksima og minima i flere variable, Lagranges multiplikatormetode. Dobbelt- og trippelintegral, linje- og flateintegral. Vektoranalyse. Greens, Stokes' og Gauss' teoremer. ","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra flervariabel matematisk analyse. Herunder multippel integrasjon, linjeintegral, flateintegral og vektoranalysens integralteoremer.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om flervariabel analyse til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
{"norwegian_name":"Matematikk 3","code":"TMA4110","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Komplekse tall og kompleks eksponentialfunksjon. Lineære differensialligninger av andre orden. Lineære ligningssystemer, Gauss-Jordan-eliminasjon, redusert trappeform, matrisealgebra, determinanter. Vektorrom, underrom, lineær avhengighet og uavhengighet. Indreprodukt, ortogonalitet, ortogonale projeksjoner, Gram-Schmidts ortogonaliseringsalgoritme og minste kvadraters metode. Egenverdier og egenvektorer, diagonalisering, symmetriske matriser og kvadratiske former. Førsteordens systemer av differensialligninger.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra lineæralgebra i Euklidske rom og system av differensialligninger. \r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om lineæralgebra og system av differensialligninger til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
{"norwegian_name":"Matematikk 3","code":"TMA4115","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Komplekse tall og kompleks eksponentialfunksjon. Lineære differensialligninger av andre orden. Lineære ligningssystemer, Gauss-Jordan-eliminasjon, redusert trappeform, matrisealgebra, determinanter. Vektorrom, underrom, lineær avhengighet og uavhengighet.   Indreprodukt, ortogonalitet, ortogonale projeksjoner, Gram-Schmidts ortogonaliseringsalgoritme og minste kvadraters metode. Egenverdier og egenvektorer, diagonalisering, symmetriske matriser og kvadratiske former. Førsteordens systemer av differensialligninger.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra lineæralgebra i Euklidske rom og system av differensialligninger. \r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om lineæralgebra og system av differensialligninger til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
{"norwegian_name":"Matematikk 4K","code":"TMA4120","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Komplekse funksjoner, kompleks integrasjon, Laurentrekker og residueregning. Laplacetransformasjon og løsning av ordinære differensial- og integralligninger. Fourierrekker, Fouriertransformasjon og løsning av lineære partielle differensialligninger.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra kompleks funksjonsteori, teorien for Fourierrekker, Fouriertransformasjonen \r\nog Laplacetransformasjonen. Spesielt i forbindelse med løsning av ordinære og partielle differensialligninger.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om kompleks funksjonsteori, integraltransformasjoner og differensialligninger til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
{"norwegian_name":"Matematikk 4N","code":"TMA4125","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Fourierrekker, Fouriertransformasjon og løsning av lineære partielle differensialligninger. Laplacetransformasjonen og løsning av ordinære differensial- og integralligninger. Numeriske metoder: Interpolasjon, derivasjon og integrasjon. Teknikker for løsning av lineære og ikkelineære ligningssystem. Runge-Kutta-metoder for løsning av system av ordinære differensialligninger. Differensmetoder for løsning av partielle differensialligninger. Innføring i beregningsverktøy med eksempler.\r\n","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra teorien for Fourierrekker, Fouriertransformasjonen, Laplacetransformasjonen, ordinære og partielle differensialligninger og numerisk løsning av ligningssystem og differensialligninger. \r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om Fourierteori, ordinære og partielle differensialligninger og numerikk til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare.\r\n"}
{"norwegian_name":"Matematikk 4N","code":"TMA4130","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Laplacetransformasjonen og løsning av ordinære differensial-og integralligninger. Fourierrekker, Fouriertransformasjon og løsning av lineære partielle differensialligninger. Numeriske metoder: Interpolasjon, derivasjon og integrasjon. Teknikker for løsning av lineære og ikkelineære ligningssystem. Runge-Kutta-metoder for løsning av system av ordinære differensialligninger. Differensmetoder for løsning av partielle differensialligninger. Innføring i beregningsverktøy med eksempler.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra teorien for Fourierrekker, Fouriertransformasjonen, Laplacetransformasjonen, ordinære og partielle differensialligninger og numerisk løsning av ligningssystem og differensialligninger.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om Fourierteori, ordinære og partielle differensialligninger og numerikk til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare."}
{"norwegian_name":"Matematikk 4D","code":"TMA4135","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Partiellderiverte. Laplacetransformasjonen og løsning av ordinære differensial- og integralligninger. Fourierrekker, Fouriertransformasjonen og løsning av lineære partielle differensialligninger. Diskret Fouriertransformasjon. Numeriske metoder: Interpolasjon, derivasjon og integrasjon. Teknikker for løsning av lineære og ikkelineære ligninger. Runge-Kutta-metoder for løsning av system av ordinære differensialligninger. Differensmetoder for løsning av partiell differensialligninger. Innføring i beregningsverktøy med eksempler.","learning_goal":"1. Kunnskap. Studenten kan gjenkjenne, forstå og anvende grunnleggende begreper og metoder fra teorien for Fourierrekker, Fouriertransformasjonen, Laplacetransformasjonen, ordinære og partielle differensialligninger og numerisk løsning av ligningssystem og differensialligninger.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap om Fourierteori, ordinære og partielle differensialligninger og numerikk til å formulere og løse problemer i matematikk og naturvitenskap\/teknologi, om nødvendig supplert med bruk av matematisk programvare."}
{"norwegian_name":"Diskret matematikk","code":"TMA4140","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet gir en innføring i matematisk logikk og mengdelære, og elementær tallteori \r\nmed modulær aritmetikk. Andre sentrale tema er: Følger, rekurrensrelasjoner, matematisk induksjon og kombinatoriske tellemetoder med anvendelser. I tillegg gis en innføring i teorien for relasjoner,  grafer og trær, samt formelle språk, grammatikker og endelige automater.","learning_goal":"1. Kunnskap. Studenten har grunnleggende kunnskaper innen matematisk logikk, mengdelære og kombinatoriske tellemetoder.  Studenten har kjennskap til elementær tallteori, inkludert det kinesiske restteorem og Fermats lille teorem. Studenten har kunnskap om rekursjon og \r\ninduksjon, samt om relasjoner, grafer og trær. Studenten har også grunnleggende kunnskaper om formelle språk, grammatikker og endelige automater.\r\n\r\n2. Ferdigheter. Studenten kan gjøre praktisk bruk av elementær logikk og mengdelære, kan bruke Euklids algoritme, og behersker modulær aritmetikk. Studenten kan løse systemer av lineære kongruenser ved hjelp av det kinesiske restteorem, kan føre enkle induksjonsbevis og kan gjenkjenne, forstå og bruke begreper som relasjoner, grafer og trær i anvendelser, f.eks. innen informasjonsteknologi. Videre kan studenten anvende kombinatoriske tellemetoder til å løse praktiske problemer, og kan gjøre praktisk bruk av endelige automater."}
{"norwegian_name":"Lineære metoder","code":"TMA4145","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Lineære og normerte rom. Kompletthet, Banachrom og Banachs fikspunktteorem.  Picards teorem. Lineære transformasjoner. Indreproduktrom, projeksjoner og Hilbertrom.  Ortogonale utviklinger og approksimasjoner. Lineære funksjonaler, duale rom og Riesz' representasjonsteorem. Spektralteoremet, Jordan kanonisk form, og matrisedekomposisjoner.","learning_goal":"1. Kunnskap. Studenten har kunnskap om sentrale begreper i teorien om vektorrom, normerte rom og Hilbertrom. I teorien for vektorrom er hovedmålet at studenten forstår overgangen fra Euklidske rom til generelle vektorrom.  Dette inkluderer forståelse av isomorfier og basiser i endeligdimensjonale vektorrom og forholdet mellom lineærtransformasjoner og matriser.  Studenten er kjent med matrisefaktoriseringsprinsipper.  I teorien for normerte rom er det et primært mål at studenten forstår Banachs fikspunktteorem. Dette inkluderer kunnskap om konvergens av følger og kontinuerlige funksjoner. Studenten behersker de grunnleggende begreper fra teorien for Hilbertrom, inkludert ortogonalitet, nærmeste punkt og dualitet. Studenten forstår Riesz' representasjonsteorem.\r\n\r\n2. Ferdigheter. Studenten er i stand til å anvende sine kunnskaper om teorien for  vektorrom, normerte rom og Hilbertrom til å løse konkrete problemer.  En nøkkelferdighet er at studenten kan kombinere resultater og konstruere nye beviser ut fra den teorien de har tilegnet seg i kurset.\r\n"}
{"norwegian_name":"Algebra ","code":"TMA4150","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir eksempler på aksiomatisk oppbygging av matematikken, og emnet tar opp grupper, undergrupper, homomorfier av grupper, sykliske grupper, permutasjonsgrupper, endelige abelske grupper, fundamentalteoremet for endelig abelske grupper, normale undergrupper, faktorgrupper, gruppevirkninger på en mengde, Sylowteori, elementær ringteori og endelige kropper, vektorrom over vilkårlige kropper, elementær tallteori med anvendelser på lineære kongruenser og hemmelige koder.\r\n","learning_goal":"1. Kunnskap. Studenten kjenner til grunnleggende begreper og metoder i gruppeteorien, inkludert normale undergrupper og faktorgrupper, permutasjonsgrupper og sykliske grupper. Studenten har kunnskap om klassifisering av sykliske grupper og av abelske grupper, om Lagranges og Cayleys teorem, samt Burnsides teorem om gruppevirkninger. Studenten kjenner til det fundamentale isomorfiteoremet for gruppehomomorfier, samt Sylowteoremene. Studentenl kjenner også til grunnleggende begreper fra elementær ringteori, med vekt på kommutative ringer, og kroppsteori, med vektorrom over vilkårlige kropper. Studenten skal ha kjennskap til anvendelser av gruppeteori for telleresultater og tallteori for hemmelige koder (RSA). Studenten skal ha kunnskap om aksiomatisk oppbygging av matematikken, samt logiske grunnbegreper og bevisstrukturer. \r\n\r\n2. Ferdigheter. Studenten kan gjenkjenne gruppe- og ringstrukturer og gruppevirkninger, og være i stand til analysere enkle egenskaper ved disse. Videre behersker studenten teorien bak anvendelser av gruppeteori på telleresultater og tallteorien for hemmelige RSA-koder. I tillegg kan studenten føre elementære matematiske bevis. "}
{"norwegian_name":"Kryptografi","code":"TMA4160","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet gir en innføring i moderne kryptografi og algebraen som ligger til grunn. Det gis en kort oversikt over klassiske chiffer og moderne symmetrisk kryptografi og algebraen som ligger bak. Algoritmer for primtallstesting. Grunnleggende algoritmer for beregning av diskrete logaritmer i vilkårlige sykliske grupper. Indeks-kalkulus-algoritmer for å beregne diskrete logaritmer i endelige kropper. Elliptiske kurver over endelige kropper. Algoritmer for faktorisering av heltall. Latticer og LLL-algoritmen. Diffie-Hellman, offentlig-nøkkel-kryptering (ElGamal, RSA, lattice-basert), digitale signaturer (RSA, Schnorr).\r\n","learning_goal":"1. Kunnskap. Studenten har oversikt over algebraen som ligger til grunn for moderne symmetrisk og asymmetrisk kryptografi, og en viss kjennskap til klassisk og moderne symmetrisk kryptografi. Studenten skal ha kjennskap til teorien for beregninger i generelle endelige sykliske grupper, endelige kropper, elliptiske kurver og latticer. Studenten har også kjennskap til motivasjonen for, bruken av og angrep på asymmetrisk kryptografi, samt kjenne til de viktigste systemene.\r\n\r\n2. Ferdigheter: Studenten behersker de viktigste algoritmene for å beregne diskrete logaritmer i generelle endelige sykliske grupper, endelige kropper, de viktigste faktoriseringsalgoritmene, og algoritmer for å avgjøre om heltall er primtall. Studenten kan anvende teorien for nullpunkter til polynomer over endelige kropper til å resonnere om sikkerheten til relevante kryptosystemer. Studenten har opparbeidet seg en intuisjon for hvordan man angriper forskjellige kryptosystemer."}
{"norwegian_name":"Differensialligninger og dynamiske systemer","code":"TMA4165","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en innføring i differensialligninger og dynamiske systemer med vekt på analytiske og kvalitative metoder for lineære og ikke-lineære differensialligninger. Temaer som behandles: Lineære og ikke-lineære systemer, eksistens og entydighet, kontinuerlig avhengighet, faseplansanalyse, likevektspunkter, grensesykler, stabilitet, Lyapunovs direkte metode, indeksteori, Poincaré-Bendixsons teorem og eksempler på anvendelser. Spesialpensum som kan variere fra år til år kan være bifurkasjoner, diskrete dynamiske system og kaos, emner fra variasjonsregning og klassisk mekanikk.","learning_goal":"1. Kunnskap. Studenten har kunnskap om grunnleggende begreper og metoder fra teorien for differensialligninger og dynamiske systemer, inkludert analytiske og geometriske teknikker for å studere kvalitative egenskaper ved løsningene. Spesielt har studenten kjennskap til lineære og ikke-lineære systemer, eksistens og entydighet, kontinuerlig avhengighet, faseplansanalyse, likevektspunkter, grensesykler, stabilitet, Lyapunovs direkte metode, indeksteori, Poincare-Bendixsons teorem, spesialpensum og eksempler på anvendelser.\r\n\r\n2. Ferdigheter. Studenten kan anvende sine kunnskaper til å studere konkrete eksempler. Studenten mestrer sentrale bevisteknikker og kan anvende disse på beslektede problemer.\r\n"}
{"norwegian_name":"Fourieranalyse","code":"TMA4170","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet skal gi studentene en grundig innføring i analytiske og anvendte metoder innen Fourieranalysen. Temaer som behandles: Fourierrekker; innføring i distribusjonsteorien eller Lebesgueintegralet og teorien for Hilbertrom; Fourierintegralet; konvolusjon; diskret Fouriertransform; hurtig Fouriertransform; signalbehandling og filterteori; anvendelser i matematikk eller teknologi, som f.eks.  bildebehandling. ","learning_goal":"1. Kunnskap. Studenten har kunnskap om begreper og metoder fra Fourieranalysen, som spesifisert under \u0094faglig innhold\u0094.  \r\n\r\n2. Ferdigheter. Studenten kan anvende sine kunnskaper i Fourieranalyse til å løse matematiske og teknologiske problemer.\r\n"}
{"norwegian_name":"Kompleks analyse","code":"TMA4175","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en innføring i grunnleggende teori for kompleks integrasjon, konforme avbildninger og harmoniske funksjoner. Utvalgte videregående emner som f.eks. analytisk fortsettelse, analytisk tallteori, harmoniske funksjoner, interpolasjon og approksimasjon, og anvendelser innen fluidmekanikk.","learning_goal":"1. Kunnskap. Studenten har kunnskap om sentrale begreper og idéer i kompleks analyse, blant annet potensrekker, kompleks integrasjon, konforme avbildninger og harmoniske funksjoner. Videre kjenner studenten til utvalgte videregående emner som f.eks. analytisk fortsettelse; analytisk tallteori; meromorfe funksjoner; interpolasjon og approksimasjon; anvendelser innen fluidmekanikk.\r\n \r\n2. Ferdigheter. Studenten kan anvende sine kunnskaper i kompleks analyse til å løse matematiske og naturvitenskapelige\/teknologiske problemer."}
{"norwegian_name":"Optimering I","code":"TMA4180","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Første og andre ordens nødvendige og tilstrekkelige (Karush-Kuhn-Tucker) optimalitetsbetingelser for ubegrensede og begrensede optimeringsproblemer i endelig-dimensjonale vektorrom.  Grunnleggende konveksanalyse og Lagranges dualitetsteori og deres anvendelser for optimeringsproblemer og algoritmer.   Oversikt over moderne optimeringsteknikker og algoritmer for glatte problemer (inklusive line-search\/trust-region, kvasi-Newton, indre punkt og aktive sett metoder, SQP og augmented Lagrangian teknikker). Grunnleggende metoder for derivat-fri og ikke-glatte optimeringsproblem.\r\n","learning_goal":"Studenten som møter læringsmålene for kurset skal kunne:\r\n(i) vurdere eksistens og entydighet av løsninger til et gitt optimeringsproblem;\r\n(ii) validere konveksitet av funksjoner, sett, og optimeringsproblemer;\r\n(iii) utlede nødvendige og tilstrekkelige optimalitetsbetingelser for et gitt optimeringsproblem;\r\n(iv) løse små optimeringsproblemer analytisk;\r\n(v) forklare de underliggende prinsipper og begrensninger av moderne teknikker og algoritmer for optimering;\r\n(vi) anslå konvergenshastigheten og kompleksitetskrav i ulike optimeringsalgoritmer;\r\n(vii) implementere optimeringsalgoritmer på en datamaskin;\r\n(viii) bruke optimeringsalgoritmer for å løse modellproblemer i ingeniør- og realfag.\r\n"}
{"norwegian_name":"Optimering II","code":"TMA4183","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Eksempler på optimale kontrollproblemer for partielle differensialligninger (PDEer). Eksistens av optimale løsninger. Kontroll-tilstandsoperatorer og adjungerte tilstander. Første og andre ordens optimalitetsbetingelser.  Kontroll av lineære og semilineære elliptiske PDEer.  Resultater fra funksjonsanalyse (adjungerte operatorer, deriverbarhet i Banachrom) og PDEer (svake løsninger, Sobolevrom). Grunnleggende numeriske metoder.","learning_goal":"Studenten som møter læringsmålene for kurset skal kunne: (i) analysere kontroll-tilstand operatører for modell kontroll problemer; (ii) utlede nødvendige og tilstrekkelige optimalitetsbetingelser for optimal kontroll problemer med eller uten tilstandsbegrensninger; (iii) vurdere eksistens av løsninger til modell optimal kontroll problemer; (iv) implementere optimeringsalgoritmer på en datamaskin; (v) bruke optimeringsalgoritmer for å løse modellproblemer"}
{"norwegian_name":"Kodeteori","code":"TMA4185","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en innføring i algebraisk kodeteori for lineære blokkoder, sykliske koder og konvolusjonskoder, samt i den underliggende matematikken. Blant annet behandles følgende temaer: Skranker for kodeparametere; egenskaper, koding og dekoding for Hamming-koder;\r\nReed-Muller-koder; BCH-koder og Reed-Solomon-koder;\r\nBerlekamp-Massey-algoritmen og Viterbi-algoritmen for bruk i dekoding.\r\nEndelige kropper. Lineæralgebra over endelige kropper.  Potensringer. Undervises annethvert år, neste gang vår 2019.","learning_goal":"1. Kunnskap. Studenten kjenner egenskaper ved og algoritmer for koding og dekoding av lineære blokkoder, sykliske koder og konvolusjonskoder. Studenten har oversikt\r\nover teorien for aritmetikk i endelige kropper, lineæralgebra over endelige kropper og potensringer.\r\n\r\n2. Ferdigheter: Studenten behersker aritmetikk i endelige kropper og lineæralgebra over endelige kropper. Studenten kan bruke forskjellige algoritmer og teknikker for koding og dekoding av koder."}
{"norwegian_name":"Introduksjon til topologi","code":"TMA4190","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kurset introduserer grunnleggende begreper og eksempler i differensialtopologi og idéen å bruke algebraiske invarianter for å studere geometriske objekt. På kurset diskuteres det inverse funksjonsteoremet, differensiable strukturer og mangfoldigheter, tangentbunter, imbeddinger, submersjoner og regulære\/kritiske punkter. \r\nViktige eksempler er flater, sfærer og projektive rom. Et annet viktig begrep er homotopi og fundamentalgruppen. Anvendelser som blir presentert på kurset kan variere fra Brouwers fixpunktteorem til vektorfelter på sfærer. Disse metodene og idéene har vært innflytelsesrike i mange deler av matematikk og blir også brukt i fysikk og andre fag. ","learning_goal":"1. Kunnskap. Studenten kjenner grunnleggende begrep og metoder innen differensial- og algebraisk topologi, og eksempler på mangfoldigheter.\r\n\r\n2. Ferdigheter. Studenten kan anvende sin kunnskap i differensial- og algebraisk topologi til å formulere og løse problemer av geometrisk natur innen matematikk, teoretisk fysikk og kybernetikk, bl.a. ved bruk av dynamiske system på mangfoldigheter. \r\n"}
{"norwegian_name":"Matematisk modellering","code":"TMA4195","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset gir en innføring i generiske prinsipper og metoder for å formulere og analyse matematiske modeller av systemer og prosesser innen ingeniørfag og naturvitenskap.\r\nEmner som dekkes er bl.a. dimensjonsanalyse, skalering, perturbasjonsanalyse, dynamiske modeller, bevarelseslover og anvendelser.\r\n","learning_goal":"1. Kunnskap. Studenten behersker generiske prinsipper og metoder for å formulere og analyse matematiske modeller av systemer og prosesser innen ingeniørfag og naturvitenskap. Dette omfatter kjennskap til dimensjonsanalyse, skalering, perturbasjonsanalyse, dynamiske modeller og bevarelseslover. Studenten har en viss innsikt i hvilke muligheter som finnes for å gjennomføre analytiske og numeriske beregninger basert på modellen.\r\n\r\n2. Ferdigheter. Studenten er i stand til formulere og kvalitativt analysere matematiske modeller for et bredt spektrum av systemer og prosesser.\r\n\r\n3. Generell kompetanse. Studenten kan arbeide i tverrfaglige grupper, og er i stand til å kommunisere resultatene skriftlig og muntlig."}
{"norwegian_name":"Numerisk lineær algebra","code":"TMA4205","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"I kurset vektlegges iterative teknikker for løsning av store, glisne ligningssystemer som typisk kan stamme fra diskretisering av partielle differensialligninger. I tillegg vil kurset omhandle egenverdi-beregninger, minste kvadraters problem og noe feilanalyse.","learning_goal":"Studenten som møter alle læringsmålene for kurset skal kunne:  (1) forklare og bruke flytende grunnleggende lineære algebraiske begreper som matrix-normer, egen- og singulærverdier og vektorer; (2) estimere stabiliteten av løsningene til lineære algebraiske ligninger og egenverdiproblemer; (3) gjenkjenne matriser av viktige spesialklasser , for eksempel normal, ortogonale, Hermitiske, positiv definite og velge effektive beregningsalgoritmer basert på denne klassifiseringen; (4) transformere matriser til trekantet, Hessenberg, tri-diagonal, eller ortogonal form ved hjelp av elementære transformasjoner; (5) utnytte faktoriseringer og kanoniske former av matriser for effektivt løsning av systemer av lineære algebraiske ligninger, minste kvadraters problemer, og for å finne egenverdier og singulærverdier; (6) forklare de underliggende prinsipper for flere klassiske og moderne iterative metoder for lineære algebraiske systemer, slik som matriks-splitting, projeksjon, og Krylov subrom metoder, analysere deres kompleksitet og konvergens hastighet basert på strukturen og spektrale egenskapene til matrisene; (7) forklare de underliggende prinsippene for iterative algoritmer for å beregne egenverdier av små og få egenverdiene av store egenverdiproblemer;  (8) forklare ideen om prekondisjonering og fleksibel prekondisjonering; (9) forklare de grunnleggende ideene bak multigrid og domenenedbrytings metoder; (10) estimerere  konvergens hastigheten og beregningskompleksitet av utvalgte numeriske algoritmer; (11) implementere utvalgte algoritmer på en datamaskin."}
{"norwegian_name":"Numerisk løsning av differensialligninger med differansemetoder","code":"TMA4212","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Differanseskjema for ulike typer av partielle differensialligninger, med analyse av konsistens, orden, stabilitet og konvergens. Løsning av lineære ligningsystemer med iterative teknikker og prekondisjonering. Endelig elementmetode.","learning_goal":"1. Kunnskap. Studenten har kunnskap om den grunnleggende teorien bak numerisk løsning av partielle differensialligninger. Studenten behersker feilanalyse av differansemetoder, og forstår begrepene konsistens, stabilitet og konvergens. Studenten har basiskunnskaper om endelig elementmetode og iterative teknikker for løsning av ligningssystemer. \r\n\r\n2. Ferdigheter. Studenten er i stand til å velge egnet metode for elliptiske, parabolske og hyperbolske partielle differensialligninger. Studentene er i stand til å sette opp, implementere og analysere diskretiseringsmetoder på et utvalg partielle differensialligninger. Studenten er i stand til å sette opp numeriske eksperimenter for å verifisere om en PDE-løser er korrekt implementert. Studenten er i stand til å velge og anvende egnede iterative metoder for løsning av ligningssystemer.\r\n\r\n3. Generell kompetanse. Studenten behersker skriftlig og muntlig presentasjon av vitenskapelige problemer og av resultatene studenten oppnår i sin prosjektoppgave. Studenten er i stand til å bruke forkunskaper i lineær algebra og kalkulus for å nå de øvrige mål i kurset.\r\n"}
{"norwegian_name":"Numerisk matematikk","code":"TMA4215","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Feilanalyse. Approksimasjon av funksjoner.  Numerisk kvadratur.   Numerisk lineær algebra. Numerisk løsning av ikke-lineære ligninger. Numerisk løsning av ordinære differensialligninger.","learning_goal":"1. Kunnskap. Studenten har kunnskap om grunnleggende numeriske metoder for approksimasjon av funksjoner, numerisk kvadratur, numerisk løsning av ordinære differensialligninger og numerisk løsning av lineære og ikke-lineære ligninger. Studenten behersker feilanalyse av numeriske metoder, og forstår begrepene stabilitet og konvergens.\r\n \r\n2. Ferdigheter. Studenten behersker grunnleggende teknikker for å analysere et stort utvalg numeriske algoritmer. Studenten er i stand til å implementere algoritmene i et valgt programmeringsspråk, sette opp numeriske eksperimenter og tolke resultatene. Studenten har etablert gode rutiner for kvalitetssikring av implementerte algoritmer.\r\n\r\n3. Generell kompetanse. Studenten kan beskrive valgt vitenskapelig metode og \r\nkommunisere sine funn i en skriftlig rapport i et presist vitenskapelig språk.\r\n"}
{"norwegian_name":"Numerisk løsning av partielle differensialligninger med elementmetoden","code":"TMA4220","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet gir en innføring i numerisk løsning av partielle differensialligninger ved hjelp av elementmetoden. Temaer som behandles er: Minimaliseringsprinsipp, svak formulering, grensebetingelser, kvadratur, feilanalyse, stabilitet, konvergens, elementformuleringer, implementering, direkte og iterativ løsning av de resulterende algebraiske ligningssystemene og anvendelser på Poissonligningen og konveksjons-diffusjonsligningen.","learning_goal":"1. Kunnskap: Studentene kjenner til sterke og svake formuleringer av\r\nlineære partielle differensialligninger,\r\nDe kjenner det matematiske grunnlaget for endelig elementmetoder.\r\n\r\n2. Ferdigheter: Studentene er i stand til å formulere og implementere\r\nendelig elementmetoden anvendt på reelle problemer i 1,2 og 3 dimensjoner,\r\ninkludert tidsavhengige problemer, og vurdere kvaliteten av det\r\nnumeriske resultatet.\r\n\r\n3. Generell kompetanse: Studenten får erfaring med skriftlig og muntlig\r\npresentasjon av vitenskaplige problemstillinger og resultater.\r\n"}
{"norwegian_name":"Analysens grunnlag","code":"TMA4225","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Det moderne integralbegrepet ble presentert i en kort artikkel den 29. april 1901 av Henri Lebesgue, og dette innledet et nytt kapittel i analysen. Manglene ved det klassiske Riemann-integralet blir påpekt, og Lebesgue-integralet blir introdusert. Stikkord for emnet er målteori inkludert sigma-algebraer, målrom, målbare funksjoner, ytre mål, konstruksjon av Lebesgue-mål og produktmål. De klassiske konvergensteoremene, Fubinis teorem, funksjoner av begrenset variasjon, integralregningens fundamentalteorem.\r\n","learning_goal":"1. Kunnskap. Studenten behersker grunnleggende begreper fra målteori, herunder: mengder av mål null, målbare funksjoner, Lebesgue-integralet og Lebesgue-rom. Studenten har oversikt over sentrale resultater i Lebesgueteori, inkludert konvergenssetninger og Fubinis teorem. Videre har studenten kjennskap til sannsynlighetsrom som et eksempel på målrom.  \r\n\r\n2. Ferdigheter. Studenten er i stand til å utføre operasjoner med Lebesgueintegralet og Lebesgue-rom. Videre kan studenten anvende integrasjonsteori, i en eller flere variable, til å formulere og løse problemer i matematikk og teknologi, herunder problemer som involverer ikke-kontinuerlige data.\r\n"}
{"norwegian_name":"Funksjonalanalyse","code":"TMA4230","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet gir en introduksjon til funksjonalanalyse som gjør studentene i stand til å bruke resultater og begreper fra funksjonalanalyse på andre områder av matematikken, og som kan danne grunnlag for videre studier i funksjonalanalyse.\r\n\r\nTemaer som behandles er blant annet Hahn-Banachs teorem, teoremene om åpen avbildning og lukket graf, Banach-Steinhaus' teorem, duale rom, svak konvergens, Banach-Alaoglus teorem og spektralteoremet for kompakte operatorer.","learning_goal":"1. Kunnskap. Studenten har kjennskap til sentrale begreper i funksjonalanalyse, herunder Hahn-Banachs teorem, teoremene om åpen avbildning og lukket graf, Banach-Steinhaus' teorem, duale rom, svak konvergens, Banach-Alaoglus teorem, begrensede lineæroperatorers spektra og spektralteoremet for begrensede selvadjungerte operatorer.\r\n\r\n2. Ferdigheter. Studenten kan anvende sine kunnskaper i funksjonalanalyse til å løse matematiske problemer.\r\n"}
{"norwegian_name":"Statistikk","code":"TMA4240","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Deskriptiv statistikk. Sannsynlighet for hendelser og stokastiske variabler. Uavhengige og\r\navhengige stokastiske variabler. Betinget sannsynlighet. En- og flerdimensjonale sannsynlighetsfordelinger. De viktigste klasser av endimensjonale sannsynlighetsfordelinger. Ekstremvariabler. Parameterestimering, intervallestimering og hypotesetesting for et- og to-utvalgsdata. Enkel lineær regresjon\r\n","learning_goal":"1. Kunnskap. Studenten kjenner de grunnleggende begrepene og prinsippene for sannsynlighetsregning og statistisk inferens. Videre kjenner studenten til enkle statistiske modeller og prosesser ofte brukt innen teknologi og naturvitenskap, og vet hvordan slike situasjoner best kan analyseres. Studenten forstår også begreper innen statistikk og sannsynlighetsregning tilstrekkelig til å kunne kommunisere med fagstatistikere om mer kompliserte situasjoner.\r\n\r\n2. Ferdigheter. Studenten kan regne ut sannsynligheter for hendelser i enkle situasjoner. Studenten kan videre anvende sin kunnskap om sannsynlighetsregning og statistikk til å gjenkjenne og analysere data fra enkle statistiske situasjoner innen teknologi og naturvitenskap, om nødvendig med bruk av matematisk programvare og deskriptive metoder. Videre er studenten i stand til å kommunisere med fagstatistikere om mer kompliserte situasjoner."}
{"norwegian_name":"Statistikk","code":"TMA4245","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Deskriptiv statistikk. Sannsynlighet for hendelser og stokastiske variabler. Uavhengige og\r\navhengige stokastiske variabler. Betinget sannsynlighet. En- og flerdimensjonale sannsynlighetsfordelinger. De viktigste klasser av endimensjonale sannsynlighetsfordelinger. Ekstremvariabler. Parameterestimering, intervallestimering og hypotesetesting for et- og to-utvalgsdata. Enkel lineær regresjon.\r\n","learning_goal":"1. Kunnskap. Studenten kjenner de grunnleggende begrepene og prinsippene for sannsynlighetsregning og statistisk inferens. Videre kjenner studenten til enkle statistiske modeller og prosesser ofte brukt innen teknologi og naturvitenskap, og vet hvordan slike situasjoner best kan analyseres. Studenten forstår også begreper innen statistikk og sannsynlighetsregning tilstrekkelig til å kunne kommunisere med fagstatistikere om mer kompliserte situasjoner.\r\n\r\n2. Ferdigheter. Studenten kan regne ut sannsynligheter for hendelser i enkle situasjoner. Studenten kan videre anvende sin kunnskap om sannsynlighetsregning og statistikk til å gjenkjenne og analysere data fra enkle statistiske situasjoner innen teknologi og naturvitenskap, om nødvendig med bruk av matematisk programvare og deskriptive metoder. Videre er studenten i stand til å kommunisere med fagstatistikere om mer kompliserte situasjoner."}
{"norwegian_name":"Romlig statistikk","code":"TMA4250","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Parameterestimering, simulering og anvendelser av gaussiske felt, punktfelt og diskrete markovfelt.\r\nEksempler blir hentet fra bildeanalyse, miljø- og naturressursproblematikk.\r\n","learning_goal":"1. Kunnskap. Studenten har kunnskap om de sentrale begreper i teorien om gaussiske felt, inkludert romlig interpolasjon ved hjelp av ulike former for kriging, og teknikker for ubetinget og betinget simulering. Studenten har videre kunnskap om de sentrale begreper i teorien om punktmodeller, inkludert K- og L-funksjonene, romlige poisson-, cox- og hard-core-prosesser, samt simulering av slike punktmodeller. Studenten har kunnskap om de sentrale begreper i teorien om diskrete markovfelt, inkludert begreper som naboskap, klikker, potensialfunksjoner og Hammersley-Clifford teorem, samt simulering av markovfelt ved hjelp av MCMC-algoritmer. Studenten har dessuten kjennskap til parameterestimering i romlige felt.\r\n\r\n2. Ferdigheter. Studenten kan formulere statistiske modeller for enkle romlige fenomener, samt utføre parameterestimering for disse modellene ved hjelp av passende programvare. Videre kan studenten evaluere betingede romlige modeller ved bruk av simulering."}
{"norwegian_name":"Anvendt statistikk","code":"TMA4255","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Hypotesetesting. Enkel og multippel lineær regresjon. Modellvalg. Forsøksplanlegging med\r\nto-nivå faktorielle forsøk. Feilforplantningsformelen. Variansanalyse.\r\nProsesskontroll. Kontingenstabeller. Ikke-parametriske metoder. Bruk av statistisk programpakke.\r\n","learning_goal":"1. Kunnskap. Studenten har god forståelse av de grunnleggende statistiske modeller og metoder som benyttes innen naturvitenskap og teknologi. Dette inkluderer hypotesetesting, lineær regresjon, forsøksplanlegging, variansanalyse, feilforplantningsformelen, prosesskontroll, analyse av kontingenstabeller og ikke-parametriske metoder.\r\n\r\n2. Ferdigheter. Studenten kan planlegge et eksperiment for å studere et gitt fenomen. Videre har han eller hun kunnskap om innsamling av informative data av høy kvalitet og analyse av dataene ved hjelp av statistisk programvare. Studenten er i stand til å presentere resultater fra statistiske analyser for kolleger innenfor sitt fagområde, og til å bruke resultatene til å trekke konklusjoner om fenomenet som studeres."}
{"norwegian_name":"Stokastisk modellering","code":"TMA4265","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Viktige modeller for multivariate stokastiske variable: Markovkjeder, poissonprosesser, fødsels- og dødsprosesser i kontinuerlig tid, brownske bevegelser og gaussiske prosesser. Prosedyrer for simulering av stokastiske modeller.\r\n","learning_goal":"1. Kunnskap. Studenten har basiskunnskaper om multivariat statistisk modellering og stokastiske prosesser med referanse i tid. \r\nStudenten har mer detaljert kunnskap om markovkjeder, poissonprosesser, fødsels- og dødsprosesser, og gaussiske prosesser. Studenten kan kjenner også til de grunnleggende prinsippene for simulering av stokastiske prosesser.\r\n2. Ferdigheter. Studenten kan formulere enkle stokastiske prosesser med referanse i tid og kan analysere slike prosesser kvantitativt og kvalitativt. Studenten kan bruke simulering til å studere egenskapene til multivariate statistiske modeller.\r\n"}
{"norwegian_name":"Lineære statistiske modeller","code":"TMA4267","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Multippel lineær regresjon. Variansanalyse. Multivariabel normalfordeling. \r\nForsøksplanlegging. Generalisert lineær regresjon.","learning_goal":"1. Kunnskap. Studenten har gode teoretiske kunnskaper om de mest populære statistiske modeller og metoder som benyttes i vitenskap og teknologi, dette inkluderer spesielt regresjonsmodeller. De statistiske egenskapene til multivariabel normalfordeling er godt kjent for studenten, og studenten er fortrolig med rollen til den multivariate normafordeingen i lineære statistiske modeller. \r\n2. Ferdigheter. Studenten vet hvordan han\/hun kan planlegge et eksperiment og hvordan han\/hun kan samle inn informative data av høy kvalitet. Videre kan studenten velge en egnet statistisk modell og metode, og utføre statstiske analyser ved hjelp av statistisk programvare. Studenten vet hvordan resultatene fra de statistiske analysene skal presenteres, og kan trekke konklusjoner.\r\n"}
{"norwegian_name":"Statistisk læring","code":"TMA4268","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Statistisk læring, multippel lineær regresjon, klassifikasjon, resamplingmetoder, modellseleksjon\/regularisering, ikke-linearitet, trebaserte metoder.","learning_goal":"1. Kunnskap. Studenten kjenner godt til de mest populære statistiske modeller og metoder som benyttes i prediksjon i vitenskap og teknologi, dette inkluderer spesielt regresjons- og klassifikasjonsmodeller.\r\n2. Ferdigheter. Studenten vet hvordan han\/hun for et eksisterende datasett kan velge en egnet statistisk modell og metode, og utføre statistiske analyser ved hjelp av statistisk programvare. Studenten vet hvordan resultatene fra de statistiske analysene skal presenteres, og hvilke konklusjoner som kan trekkes fra analysene.\r\n"}
{"norwegian_name":"Levetidsanalyse","code":"TMA4275","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Grunnleggende begreper i levetidsmodellering. Sensurerte observasjoner. Ikke-parametrisk estimering og grafisk plotting for levetidsdata (Kaplan-Meier plott, Nelson-plott). Estimering og\r\ntesting i parametriske levetidsfordelinger. Analyse av levetider med kovariater (Cox-regresjon,\r\nakselerert levetidstesting). Modellering og analyse av rekurrente hendelser. Ikke-homogene\r\npoissonprosesser. Nelson-Aalen estimatorer.\r\n","learning_goal":"1. Kunnskap. Studenten har grundig kjennskap til den grunnleggende teorien for stokastisk modellering og statistisk analyse av levetidsdata, med vekt på tilhørende grafiske teknikker. Dette inkluderer så vel parametrisk som ikke-parametrisk analyse av sensurerte levetidsdata og data for rekurrente hendelser, samt tilhørende regresjonsmodeller, for eksempel Cox-regresjon.\r\nDe grafiske teknikker omfatter Kaplan-Meier plott, Nelson-Aalen plott og enkle plott for sjekk av modelltilpasning.\r\n\r\n2. Ferdigheter. Studenten er i stand til å anvende sin kunnskap på ulike problemstillinger fra teknisk pålitelighetsanalyse, risikoanalyse, medisin og andre relevante anvendelsesområder,\r\nder begrepet overlevelse i vid forstand inngår. Slike anvendelser omfatter etablering av modell, løsning ved hjelp av statistisk programvare, samt formulering av konklusjoner i form av estimater, prediksjoner og anbefalinger."}
{"norwegian_name":"Superdatamaskiner, innføring i bruk ","code":"TMA4280","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Litt om moderne datamaskinarkitektur, innføring i bruk av MPI \r\n(Message Passing Interface) for parallelle beregninger, numeriske metoder for partielle differensialligninger (med fokus på Poisson-problemet), direkte og interativ løsning av store ligningssystemer, modellering av ytelse på en og flere prosessorer, samt litt om Monte Carlo metoder, parallell IO og OpenMP. \r\n","learning_goal":"1. Kunnskap. Studenten har en grunnleggende forståelse for moderne datamaskinarkitektur og trender innen utviking av nye beregningssystemer. Spesielt har studenten en forståelse av hva som kan påvirke ytelsen av numeriske beregninger (dvs, antall flyttallsoperasjoner per sekund), og hva en kan gjøre for å optimalisere ytelsen. Studenten kan identifisere hvordan en kan dekomponere et globalt beregningsproblem i delproblemer som vil være passende for parallell prosessering, og kan modellere ytelse for utvalgte algoritmer.  Studenten er kjent med sammenhengen mellom moderne maskinarkitektur og utvikling av effektive numerisk algoritmer for vitenskapelige og tekniske beregninger. \r\n\r\n2. Ferdigheter. Studenten er i stand til å implementere numeriske algoritmer i et høynivåspråk,  og med relevans for vitenskap og teknologi, både på en prosessor og flere prosessorer.  Studenten kan bruke funksjoner fra kommunikasjonsbiblioteket MPI til å utføre lokale og globale kommunikasjonsbehov. Videre kan studenten måle ytelse av en algoritme og analysere ytelsesdataene med hensyn på skalerbarhet når en varierer problemstørrelse og antall prosessorer en bruker. Studenten kjenner til ulike hjelpeprogrammer, som automatiske partisjoneringsverktøy og optimaliserte rutiner for basis lineær algebra operasjoner (BLAS). \r\n"}
{"norwegian_name":"Tidsrekkemodeller","code":"TMA4285","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Autoregressive og moving-average baserte modeller for stasjonære og ikke-stasjonære tidsrekker. Parameterestimering. Modellidentifisering. Prognoser. ARCH- og GARCH-modeller\r\nfor volatilitet. State-space-modeller (lineære dynamiske modeller) og kalmanfilteret.\r\n","learning_goal":"1. Kunnskap. Studenten har kunnskap om det teoretiske grunnlaget for å kunne modellere og analysere tidsrekker med anvendelser innen ingeniørfag og finans. Dette inkluderer kunnskap om autoregressive og moving-average baserte modeller for stasjonære og ikke-stasjonære tidsrekker, samt kunnskap om hvordan man utfører modellidentifisering og parameterestimering og lager prognoser i slike modeller. Det inkluderer også kjennskap til ARCH- og GARCH-modeller for volatilitet, samt state-space-modeller (lineære dynamiske modeller) og kalmanfilteret.\r\n\r\n2. Ferdigheter. Studenten er i stand til å benytte sin kunnskap om ulike tidsrekkemodeller til å tilpasse modeller til observerte tidsrekkedata hentet fra ingeniørfag og finans, samt lage\r\nprognoser basert på disse dataene.\r\n"}
{"norwegian_name":"Statistisk inferens","code":"TMA4295","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Transformasjoner og momenter av tilfeldige variabler. Definisjon av fordelingsklasser. Ulikheter og konvergensteoremer. Suffisiente observatorer. Frekventistiske og bayesianske estimatorer. Metoder for konstruksjon av punktestimatorer, intervallestimatorer og hypotesetester, samt optimalitet av disse. Asymptotiske egenskaper for estimatorer og hypotesetester.\r\n","learning_goal":"1. Kunnskap. Studenten har solide teoretiske kunnskaper om generelle prinsipper for statistisk\r\ninferens. Studenten har kunnskap om hvordan punkt- og intervallestimatorer, samt hypotesetester konstrueres, og om hvordan disse estimatorene og testene evalueres. Studenten har\r\ninnsikt i hvordan optimale estimatorer og tester konstrueres. Studenten har også noe kjennskap\r\ntil asymptotisk teori for statistisk inferens.\r\n2. Ferdigheter. Studenten kan utføre punktestimering, hypotesetesting og intervallestimering under et stort mangfold av diskrete og kontinuerlige sannsynlighetsmodeller. Studenten\r\nkan videre evaluere egenskapene til disse estimatorene og testene, såvel for endelige utvalgsstørrelser som asymptotisk når utvalgsstørreelsen vokser, samt velge optimale estimatorer\r\nog tester.\r\n"}
{"norwegian_name":"Beregningskrevende statistiske metoder","code":"TMA4300","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Klassiske og markovkjedeteknikker for Monte Carlo-simulering. Hierarkiske bayesianske modeller og inferens i disse. EM-algoritmen (Expectation maximization). Bootstrapping, kryssvalidering og ikke-parametriske metoder. Klassifikasjon.\r\n","learning_goal":"1. Kunnskap. Studenten har kjennskap til beregningskrevende teknikker for å gjøre statistisk inferens. Dette inkluderer direkte- og MCMC-teknikker for Monte Carlo-simulering, samt EM-algoritmen og bootstrapping. Videre har studenten basiskunnskap om hvordan komplekse\r\nstatistiske problemer kan formuleres og løses ved hjelp av hierarkiske bayesianske modeller.Studenten har dessuten kunnskap om en del klassifikasjonsteknikker.\r\n\r\n2. Ferdigheter. Studenten kan anvende beregningskrevende teknikker, slik som Monte Carlo-simulering, EM-algoritmen og bootstrapping, til å løse enkle anvendte problemer.\r\n\r\n3. Generell kompetanse. Studenten er i stand til å gi en faglig muntlig presentasjon.\r\n"}
{"norwegian_name":"Partielle differensialligninger","code":"TMA4305","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Kurset gir en grundig innføring i den matematiske teorien bak partielle differensialligninger, både den klassiske teorien til Laplace, Cauchy, Fourier, Gauss etc. og den moderne teorien som baserer seg på funksjonalanalytiske metoder. Emner som dekkes er første ordens ligninger, Cauchy-problemer, karakteristikker, lineære andre ordens ligninger, klassifisering, randverdiproblemer for elliptiske ligninger, rand- og initialverdiproblemer for hyperbolske og parabolske ligninger, fundamentalløsninger, maksimumsprinsipper, svake løsninger og funksjonalanalytiske metoder.\r\n","learning_goal":"1. Kunnskap. Studenten behersker grunnleggende prinsipper og metoder for analyse av partielle differensiallikninger, inkludert første ordens likninger, Cauchy-problemer, karakteristikker, lineære andre ordens likninger, klassifisering, randverdiproblemer for elliptiske likninger, rand- og initialverdiproblemer for hyperbolske og parabolske likninger, fundamentalløsninger, maksimumsprinsipper, svake løsninger og funksjonalanalytiske metoder.\r\n\r\n2. Ferdigheter. Studenten er i stand til å anvende teknikkene til å studere konkrete eksempler, forstå bevisene og kunne anvende sentrale bevisteknikker på beslektede problemer.\r\n"}
{"norwegian_name":"Matematiske emner, videregående kurs","code":"TMA4310","credits":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Et videregående emne innen matematikk eller statistikk.","learning_goal":"Gi en innføring i et sentralt videregående matematisk emne som ikke dekkes gjennom den øvrige studieplan. Styrke faglig basis for fordypningsemnet i 9. semester."}
{"norwegian_name":"Generaliserte lineære modeller","code":"TMA4315","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Prinsipper for statistisk modellering, inferens og evaluering for generaliserte lineære modeller, med anvendelser blant annet på regresjonsmodeller for normalfordelte data, logistisk\r\nregresjon for binære og multinomiske data, Poisson-regresjon og log-lineære modeller for kontingenstabeller. Utvidelser av GLM-teori til, for eksempel, modeller for overdispersjon, kvasi-likelihoodestimering og generaliserte lineære miksa modeller.\r\n","learning_goal":"1. Kunnskap. Studenten har solide kunnskaper om generaliserte lineære modeller og tilhørende inferens og evalueringsmetoder. Dette inkluderer regresjonsmodeller for normalfordelte data, logistisk regresjon for binære og multinomiske data, poissonregresjon og log-lineære modeller for kontingenstabeller.\r\n\r\n2. Ferdigheter. Studenten kan vurdere om en generalisert lineær modell kan brukes i en gitt situasjon, og kan videre utføre og evaluere en slik statistisk analyse.\r\n"}
{"norwegian_name":"Introduksjon til vitenskapelige beregninger","code":"TMA4320","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kurset består av to jevnstore deler, en teoretisk og en beregnings-orientert. Den teoretiske delen gir en en introduksjon til numerisk matematikk og forbereder studentene for den beregningsorienterte delen, som består av tre obligatoriske prosjekter, hentet fra fysikk,\r\nbiofysikk og matematikk. Aktuelle temaer for forelesningene kan være metoder for beregning av integraler, løsning av systemer av\r\ndifferensial og algebraiske ligninger og egenverdi-beregninger. ","learning_goal":"Studenten som møter alle læringsmålene for kurset skal kunne: (1) formulere enkelte problemer fra fysikk og biofysikk matematisk; (2) forklare og bruke enkelte beregningsmetoder til å løse disse problemer numerisk;  (3) implementere utvalgte numeriske algoritmer på en datamaskin; (4) foreta en kritisk vurdering av resultatene; (5) kommunisere dette i form av en skriftlig rapport."}
{"norwegian_name":"Industriell matematikk, fordypningsprosjekt","code":"TMA4500","credits":15.0,"taught_in_spring":false,"taught_in_autumn":true,"content":"Prosjektarbeid på 15 sp i valgt tema.","learning_goal":"Studenten skal tilegne seg en vitenskapelig arbeidsmetode ved å fordype seg i et spesifikt tema. Dette omfatter å innhente informasjon gjennom litteraturstudier og annet kildesøk, samt kombinere denne med egen kunnskap. Videre skal studenten lære å gjennomføre et større selvstendig prosjektarbeid, inklusive utarbeide en prosjektplan med milepæler sammen med veileder, rapportere del-resultater, og skrive en prosjektrapport i følge vedtatte standarder."}
{"norwegian_name":"Industriell matematikk, fordypningsemne","code":"TMA4505","credits":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Studenten kan velge mellom to tema (3,75 sp), eller et ordinært emne (7,5 sp) innen fagområdene som dekkes av industriell matematikk. \r\nHvilke 3,75 sp temaer som tilbys varierer fra år til år. For å ta et ordinært emne som fordypningsemne kreves godkjenning av foreleser.  ","learning_goal":"Emnet skal gi fordypning i matematiske eller statistiske problemstillinger som er aktuelle for det valgte fordypningsprosjektet (TMA4500)."}
{"norwegian_name":"Eksperter i team - Matematikk innen anvendelser","code":"TMA4850","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
{"norwegian_name":"Eksperter i team - Big Data","code":"TMA4851","credits":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"For mer informasjon om Eksperter i Team, se www.ntnu.no\/eit","learning_goal":""}
{"norwegian_name":"Industriell matematikk, masteroppgave","code":"TMA4900","credits":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"","learning_goal":"1. Kunnskap: Studenten kan demonstrere inngående kunnskap om og innsikt i et avgrenset tema innenfor fagområdene som dekkes av industriell matematikk ved å kunne forklare og anvende de underliggende teoretiske begrep og teknikker.\r\n\r\n2. Ferdigheter: Studenten er i stand til å utføre et selvstendig vitenskapelig arbeid med problemstillinger i matematiske fag, relevante for industri og næringsliv. Arbeidet skal være forskningsbasert, og kan være både av teoretisk og anvendt karakter.\r\n\r\n3. Generell kompetanse: Studenten skal kunne gjennomføre et større selvstendig prosjektarbeid, inklusive å utarbeide en prosjektplan med milepæler. Studenten skal kunne formidle resultatene fra arbeidet i vitenskapelig rapport.\r\n"}
{"norwegian_name":"Statistikk, masteroppgave","code":"TMA4905","credits":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"","learning_goal":""}
{"norwegian_name":"Numerikk, masteroppgave","code":"TMA4910","credits":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"","learning_goal":""}
