{"norwegian_name":"Kommunikasjon - Tjenester og nett","code":"TTM4100","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Multimediekomponenter og teletjenester, svitsjingprinsipper, nettyper og Internet. Referansemodeller (f.eks. OSI og TCP\/IP)og generisk protokollfunksjonalitet. Funksjonalitet i applikasjonsnivå, transportnivå , nettnivå, linknivå, og (delvis) fysisk nivå. Innen applikasjonsnivået vil det legges vekt på arkitektur og protokoller for DNS (Domain Name System), E-mail og WWW (World Wide Web). Beskrivelse av multimediasystemer. Beskrivelse av trådløs og mobil nettverk. Grunnleggende kommunikasjonssikkerhet.","learning_goal":"A. Kunnskaper:\r\nEmnet skal gi kunnskap om og grunnleggende forståelse av:\r\n1) De mest fundamentale konsepter, prinsipper og teknologier som er grunnlaget  for kommunikasjonsnett og tjenester. Dette inkluderer arkitektur og prinsipper som omhandler nettbaserte tjenester, svitsjeteknikker, funksjonalitet og protokoller i nettets fem ulike kommunikasjonslag, og bruken av transportlagsprotokoller i design av nettapplikasjoner.\r\n2) Trådløse og mobile nett.\r\n3) Multimedia over nett.\r\n4) Kommunikasjonssikkerhet.\r\n\r\nB. Ferdigheter:\r\nEmnet skal gi ferdigheter i:\r\n1) Å  kunne resonere og drøfte  arkitektur, prinsipper, og teknologier ved  design  og implementering av kommunikasjonsnett og tjenester.\r\n2) Å kunne forklare hvordan og hvorfor nettets fem lag fungerer.\r\n3) Å kunne kommunisere, resonere og drøfte trådløse og mobile nett, og bruk av multimedia over nettet.\r\n4) Å kunne designe og implementere elementære nettapplikasjoner som utnytter transportlagsprotokollen.\r\n5) Å kunne sørge for grunnleggende sikkerhet i kommunikasjon over nett."}
{"norwegian_name":"Aksess- og transportnett","code":"TTM4105","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet beskriver teknologier og konsepter som anvendes i aksess- og transportnett. Det dekkes både generelle prinsipper på et overordnet nivå, og et utvalg spesifikke teknologier og konsepter i mer detalj.\r\n\r\nInnledning:\r\n\r\n- Den prinsipielle oppbygning av kommunikasjonsnettverk, med fokus på offentlige nett som f.eks cellular og Internet.\r\n- Aktører, roller og ansvar ifm kommunikasjonsnettverk.\r\n- Begreper: synkronisering, multipleksing, routing, svitsjing, signalering, mobilitet, sikkerhet.\r\n- Applikasjoner og krav til nett. Internet som tjenesteplattform.\r\n- Kapasitet og transmisjonsegenskaper til ulike medier.\r\n\r\nAksessnett:\r\n\r\n+ Trådløs aksess\r\n- Generelt om radio som kommunikasjonsmedium (frekvensbånd, modulering, multiplexing, antenneteknologi, dekning, propagasjon).\r\n- medium aksesskontroll\r\n- Wireless LAN.\r\n- mobilnett: GSM, UMTS, WiMAX, LTE, etc.\r\n- Trådløs personlig kommunikasjon og tingenes internett.\r\n\r\n+ Fast aksess\r\n- Generelt om faste (kablede) kommunikasjonsmedium (egenskaper, tilgjengelighet).\r\n- Digital Subscriber Line teknologi (e.g. Basic Rate ISDN, ADSL, VDSL).\r\n- Fiber basert aksess, aktiv \/ passiv FTTH.\r\n- Hybrid Fiber-Coaxial Cable (DOCSIS).\r\n\r\nTransportnett (metro og kjerne):\r\n\r\n- Optiske nettverkskomponenter.\r\n- Optisk svitsjing (ROADM, WSS).\r\n- Kontroll og trafikkstyring i optiske nett.\r\n- Mekanismer for feilhåndtering.\r\n- Optiske transportnett (OTN).\r\n- Carrier Ethernet.\r\n- Optisk linjesvitsjing (OCS), burstsvitsjing (OBS) og pakkesvitsjing (OPS).\r\n","learning_goal":"A. Kunnskap: \r\n1) Å forstå hvilke komponenter, funksjoner og prinsipper som trengs for å realisere aksess- og transportnett. \r\n2) Å oppnå en dyp innsikt i et utvalg av de mest aktuelle teknologiene som benyttes i dag. \r\n3) Å forstå hvordan disse komponentene, teknologiene og prinsippene anvendes i forskjellige typer nett. \r\n\r\nB. Ferdigheter: \r\n1) Å kunne beskrive og modellere et nettverk for et bestemt formål. \r\n2) Å kunne gjenbruke ideer, teknologier og komponenter fra andre nett ved konstruksjon av nye nett. \r\n\r\nC. Generell kompetanse: \r\n1) Å forstå oppbygningen av offentlige kommunikasjonsnett og hvilke egenskaper som ligger til grunn for teknologiske valg."}
{"norwegian_name":"Pålitelighet og ytelse med simulering","code":"TTM4110","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Basis: Mål for pålitelighet, ytelse og tjenestekvalitet; ressurser og ressursutnyttelse, feilårsaker og feilavhjelpning, analytiske modeller, diskrete og kontinuerlige fordelinger, grunnleggende om stokastiske prosesser. Poissonprosessen, diskret rom - kontinuerlig tid, Markov modeller og analyse. Simulering: Prosessorientert simulering, generering av tilfeldige variabler, primitiver i Demos, analyse av resultater. Ytelse og trafikk: Erlang og Engsets avvisningsmodeller, M\/M\/1 og Erlang-kømodeller, Jackson kønett. Pålitelighet: funksjonssannsynlighet, tilgjengelighet, systemtider i enkle redundanstrukturer bestemt ved hjelp av Markovmodeller; blokkdiagram, feiltrær, strukturfunksjoner, stier og kuttesett. Målinger: observasjonsstrategier, punkt- og intervallestimering, eksperimentoppsett.","learning_goal":"A. Kunnskap:\r\n1) Å få en grunnleggende forståelse for betydningen av ikke-fuksjonelle krav ved tjeneste- og systemdesign.\r\n2) Å få en grunnleggende forståelse av prinsipper for pålitelighet og ytelsesevaluering og dimensjonering av data- og kommunikasjonssystemer (IKT).\r\n3) Å få en grunnleggende forståelse av modellering, analyse og målinger for evaluering og dimesjonering.\r\n4) Å få en grunnleggende forståelse av sannsynlighetsregning, statistikk, og stokastiske prosesser for modelleing av IKT systemoppførsel.\r\n5) Å få en grunnleggende forståelse av Markovmodellering og løsning av disse.\r\n6) Å få en grunnleggende forståelse av prosessorientert modelling og simulering.\r\n7) Å få en grunnleggende forståelse av simulerings- og målemetoder.\r\n\r\nB. Ferdighet:\r\n1) Å bli i stand til å spesifisere ytelses- og påliteligshetskrav.\r\n2) Å bli i stand til å beskrive systemegenskaper ved hjelp av en Markovmodell.\r\n3) Å bli i stand til å bestemme systemegenskaper symbolsk og nummerisk fra en Markov modell.\r\n4) Å bli i stand til å beskrive en simuleringsmodell, implementere en simulator og gjennomføre et simuleringseksperiment.\r\n5) Å bli i stand til å avlede systemegenskaper fra målinger, analytiske- og simuleringsresultater."}
{"norwegian_name":"Design av reaktive systemer 1","code":"TTM4115","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Emnet dreier seg om metoder og språk for å utvikle reaktive systemer. Hovedtemaene er: \r\n- Utvikling av systemer i henhold til krav og use cases fra brukere\r\n- Språk for å modellere systemer, med vekt på beskrivelse av oppførsel\r\n- Utviklingsmetodikk, blant annet agile metoder\r\n- Metoder og paradigmer for å sikre kvalitet av systemdesigns.","learning_goal":"A. Kunnskap:\r\n1) Klassifisere ulike typer av krav, og forklare de viktigste aktivitetene i en utviklingsprosess. Nevne potensielle problemer under kravspesifikasjon. \r\n2) Gjenkjenne modelleringselementer i UML, forklare semantikken av dem, og finne den rette måten å implementere dem i kode. Dette omfatter use case-, sekvens-, tilstandsmaskin-, aktivitets- og deployment-diagrammer. \r\n3) Forstå og beskrive hovedtrekkene ved applikasjonsprotokoller som HTTP, CoAP og MQTT, og bruke dem på korrekt måte i kontekst av en systemarkitektur. \r\n4) Liste opp og forklare hovedelementene i en smidig utviklingsmetode som for eksempel Scrum, og reflektere over deres anvendelse i et gitt utviklingssammenheng.\r\n\r\nB. Ferdigheter:\r\n1) Fange opp brukerkrav og syntetisere relevante use cases med rett detaljnivå. \r\n2) Skrive prosjektleveranser som beskriver systemkrav, egenskaper og løsninger. \r\n3) Planlegge og koordinere utvikling av større programvareprodukter (som består av mer enn én applikasjon) i et team av utviklere. \r\n4) Bruke smidige utviklingsmetoder og reflektere over bruk innenfor en prosjektramme. \r\n5) Gjøre riktige designvalg for systemarkitektur og dokumentere dem på en hensiktsmessig måte."}
{"norwegian_name":"Nett- og tjenesteadministrasjon","code":"TTM4128","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Emnet omfatter: Arkitekturer og prinsipper for SNMP-basert og WEB-basert nettadministrasjon. WEB-basert nettadministrasjon omfatter WBEM (WEB-based Enterprise Management), WS-management (WEB Services for Management) og NETCONF (Network Configuration Protocol).","learning_goal":"A. Kunnskap:\r\n1) Å få en grunnelggende forståelse av prinsipper og arkitekturer for bruk i nett- og tjenesteadministrasjon.\r\n2) Å få en dyp forståelse av SNMP som arkitektur og plattform for nettadministrasjon.\r\n3) Å få en dyp forståelse av Web-basert nettadministrasjon.\r\n\r\nB. Ferdigheter:\r\n1) Å bli istand til å kommuniserer, ressonere samt tenke kreativt om nettadministrasjon.\r\n2) Å kunne forstå og bruke abstrakte spesifikasjoner for SNMP-basert og web-basert nettadministrasjon \r\n3) Å bli istand til å designe, implementere og bruke web-baserte plattformer for nettadministrasjon.\r\n4) Å kunne konfigurere og bruke Net-SNMP til nettadministrasjon."}
{"norwegian_name":"Mobile nett og tjenester","code":"TTM4133","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Introduksjon til kommunikasjon: naturlig kommunikasjon, kunstig kommunikasjon, telekommunikasjon og mobilkommunikasjon. Grunnleggende aspekter av mobilkommunikasjon: kommunikasjonsmodell, komponenter, telekommunikasjonssystem og singnalering, cellekonseptet. Administrasjon av mobilitet. Mobile systemer: GSM, GPRS, UMTS, LTE. Kommunikasjonstjenester over IP nett: SIP, IMS, Over-the-top services.","learning_goal":"A. Kunnskap:\r\n1) Å få en dyp forståelse av konsepter og prinsipper innen mobilitet og mobilkommunikasjon\r\n2) Å få en dyp forståelse av de grunnleggende funksjonene knyttet til mobilitet\r\n3) Å få en dyp forståelse av signalering og IP nett signalering\r\n4) Å få en grunnleggende forståelse av aktuelle mobilkommunikasjonssystemer\r\n5) Å få en grunnleggende forståelse av IP kommunikasjonstjenester\r\n\r\nB. Ferdigheter:\r\n1) Å være i stand til å kommunisere og analysere begrepene mobilitet og mobilkommunikasjon\r\n2) Å være i stand til å designe, implementere og bruke mobilkommunikasjonssystemer\r\n3) Å være i stand til å kommunisere og analysere signalering og IP nett signalering\r\n4) Å være i stand til å designe, implementere og bruke IP kommunikasjonstjenester."}
{"norwegian_name":"Informasjonssikkerhet","code":"TTM4135","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Kryptografi; symmetriske og offentlig-nøkkel, kryptografiske protokoller, nøkkeldistribusjon, autentisering, digitale signaturer. Nettverkssikkerhet; tilgangskontroll, tjenester og mekanismer for autentisering, nettverkssikkerhetsprotokoller, applikasjonslaget sikkerhet og sikker nettverksadministrasjon.\r\nSystemsikkerhet; innbruddsdeteksjon, ondsinnet programvare, brannmurer, identifikasjon.","learning_goal":"A. Kunnskap:\r\nÅ få en grunnleggende forståelse av prinsipper i kryptografi og nettverkssikkerhet, med kunnskap innen fire områder:\r\n1) kryptografiske algoritmer;\r\n2) teknikker og algoritmer for nøkkelhåndtering, nøkkeldistribusjon og autentisering.\r\n3) bruk av kryptografiske algoritmer i nettverksprotokoller og applikasjoner;\r\n4) teknikker for sikring av datamaskiner mot inntrengere og ondsinnet programvare.\r\n\r\nB. Ferdigheter:\r\n1) Å kunne evaluere sikkerhet i systemer med hensyn til formålstjenlig bruk av sikkerhetstjenester og mekanismer.\r\n2) Å være i stand til å designe grunnleggende sikkerhetsarkitekturer ved å velge og integrere relevante sikkerhetskomponenter.\r\n"}
{"norwegian_name":"Informasjonssikkerhet i trådløse nett","code":"TTM4137","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Funksjoner, protokoller og konfigurasjoner for å oppnå autentisering, nøkkeldistribusjon, integritet, konfidensialitet og anonymitet i trådløse aksess- og mobil-nett.  Emnet presenterer sikkerhetsløsninger for eksisterende systemer som WPAN, WLAN, UMTS, IMS, og studerer også nye teknologier slik som ad-hoc nett. Digitale spor i trådløse systemer.","learning_goal":"A. Kunnskap:\r\n1) Emnet skal gi kunnskap om teknologi og metoder for sikring av informasjon i kommunikasjonssystemer som yter tjenester til mobile brukere ved hjelp av trådløse aksessnett.\r\n2) Kunnskap om oppbygning av sikkerhetsmekanismer og -protokoller i mobile radioaksess nett, f.eks. WLAN IEEE 802.11, WAN 802.16,  GSM\/UMTS\/LTE, Adhoc- og sensor-nett. \r\n3) Kunnskap om designprinsipper, mekanismer og løsninger i autentiserings- og nøkkeltransport-protokoller i trådløse aksessnett.\r\n\r\nB. Ferdigheter:\r\n1) Emnet skal gi ferdigheter for teknisk inngående analyse av informasjonssikkerhetsegenskaper i kommunikasjonssystemer som yter tjenester til mobile brukere ved hjelp av trådløse aksessnett.\r\n2) Gjennomføre gruppearbeid en ukes labprosjekt på WLAN sikkerhetsanalyse og konstruksjon, med labjournalføring og lab-rapport.\r\n3) Hver student velger etter egen interesse og motivasjon, under veiledning, et teknisk emne innenfor trådløs sikkerhet. Emnet skal\r\nligge utenfor forelest pensum.  Målet er å skrive et kort og konsist teknisk essay (~4 sider) som presenterer det valgte emneområdet.\r\n\r\nC. Generell kompetanse:\r\n1) Praksis i å utføre, journalføre og rapportere fra et eksperimentelt labarbeide.\r\n2) Skrive et kortfattet og konsist teknisk essay utformet med LaTeX verktøy."}
{"norwegian_name":"Nettarkitektur i internett ","code":"TTM4150","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Internett nettverksarkitektur,  inkluderer blant annet nettverks arkitektur, adressering, multicast, Content Delivery Networks (CDN), Software Defined Networking (SDN), ruting (IGP\/EGP), tjenestekvalitet, Multiprotocol Label Switching (MPLS), ressursallokering\/metningskontroll, og virtuelle private nett. ","learning_goal":"A. Kunnskap:\r\n1) Få en dyp forståelse av filosofien bak Internett-arkitekturen.\r\n2) Få en dyp forståelse for  motivasjon, krav, funksjonalitet, muligheter og begrensninger i sentrale arkitekturer og protokoller i  Internett. Fokus er på protokoller og arkitektur for multicast, tjenestekvalitet, SDN, CDN, ruting, virtuelle private nett, ressursallokering og metningskontroll.\r\n3) Få en dyp forsåelse av addressering i Internett.\r\n\r\nB. Ferdigheter:\r\n1) Å bli istand til å kommuniserer, ressonere samt tenke kreativt om de viktigste prinsipper og  nett og protokoller som inngår i TCP\/IP-baserte nett. Disse  er beskrevet i A2.\r\n2) Kunne  identifisere og analysere styrker og svakheter av ulike mekanismer som brukes i Internett-protokoller.\r\n3) Kunne identifisere alternativer løsninger.\r\n4) Kunne sette opp enkle nettverk inklusive konfigurasjon av nettverksnodene.\r\n5) Kunne utføre og analysere trafikkmålinger på Internett."}
{"norwegian_name":"Pålitelighets- og ytelsesdesign","code":"TTM4158","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset gir en bred innføring i design og kvantitativ evaluering av informasjons- og kommunikasjons- (IKT) systemer, med fokus på pålitelighet av slike systemer og ytelse av data- og telekommunikasjonsnett. Følgende tema er behandlet: \r\n- Pålitelighetsbegreper: attributter (tilgjengelighet, pålitelighet); feil-prosess, -typer (årsak, tilstand, ytring), -semantikk, -håndtering og vedlikehold; \r\n- Feiltoleranse: typer av redundans, designprinsipper og mekanismer; \r\n- Metoder for pålitelighetsmodellering og analyse med fokus på tilstandsdiagrammer; \r\n- Programvarefeil: modellering og innflytelse; \r\n- Robusthetsdesign og pålitelighetsevaluering av nett \r\n- Trafikk- og ytelsesbegreper: trafikk, forsinkelse\/latens, jitter, tap, sperr, Kendalls notasjon; \r\n- Klassiske  køteori modeller og metoder: M\/M\/1; tilstandsdiagram, M\/M\/n\/n; Erlangs formler, Jackson kønett; M\/G\/1; Pollaczek Khinchines formel; loven om bevaring av arbeid; \r\n- Tjenestekvalitet (QoS) i Internett: trafikk- og tjeneste spesifikasjoner, arkitekturer, mekanismer og  analyse av garantert tjenestekvalitet.","learning_goal":"A. Kunnskap:\r\n1) Terminologi og begreper som brukes i spesifikasjon, design, drift og evaluering av informasjons- og kommunikasjons- (IKT) systemer, med fokus på pålitelighet og ytelse.\r\n2) Prinsipper, arkitekturer og mekanismer for feiltolerant\/robust design og drift av tjenersystemer og nett.\r\n3) Grunnleggende modeller og metoder for kvantitativ trafikk- og ytelsesevaluering av data- og telekommunikasjonnett\/systemer.\r\n4)Arkitekturer, mekanismer og grunnleggende analyse av tjenestekvalitet i Internett.\r\n\r\nB. Ferdigheter:\r\n1) Å designe systemer med formålstjenlig bruk av feiltoleranse, gjenopprettingsmekanismer og redundans for å møte krav om driftssikkerhet.\r\n2) Å kunne kvantitativt evaluere tilgjengelighet og pålitelighet av IKT systemer ved hjelp av Markov modeller.\r\n3) Å kunne modellere og kvantitativt evaluere data- og telekommunikasjonnett\/systemer med hensyn på trafikkhåndteringsevne og ytelse.\r\n\r\nC. Generell kompetanse:\r\n1) Bevisstgjøring av pålitelighet som en viktig faktor i bruken og økonomien ved IKT systemer, herunder den potensielle virkningen av feil på kommersielle anvendelser, på samfunnet, samt for sikkerheten til mennesker og miljø.\r\n2) Evne til å kommunisere, gjennomføre grunnleggende resonnement og kreativt tenkning  omkring trafikk- og ytelsesutfordinger med data- og telekommunikasjonsnett\/systemer i en videre sammenheng."}
{"norwegian_name":"Design av reaktive systemer 2","code":"TTM4160","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset dreier seg om hvordan man konstruerer effektive og pålitelige programvareløsninger for distribuerte reaktive systemer generelt og telematikksystemer spesielt, med utgangspunkt i en formell spesifikasjon uttrykt med språket UML.\r\nDet er seks hovedtemaer i kurs: 1) Implementering av tilstandsmaskin: Syntaks, semantikk og realiseringsaspekter av eksekverbare tilstandsmaskin diskuteres. 2) Implementasjonsdesign: Her lærer man om hvordan eksisterende spesifikasjoner kan bli overført til tekniske komponenter. I tillegg skal man forstå hvordan systemspesifikasjoner kan tilpasses slik at behov av spesiell maskinvare blir oppfylt. 3) Programvaredesign: Mønster of metoder som er nødvendig for å lagre eventdreven programvare undervises. Det inkluderer intern organisasjon og grensesnittaspekter av programvarekomponenter. 4) Systemutvikling med Reactive Blocks: Studenten skal lære seg å forstå systemer på forskjellige spesifikasjonstrinn, bruk av applikasjonsmønstere i programvareutvikling og modelbasert programvareutvikling i praksis.\r\n5) Applikasjonsdesign: Strukturen av moderne systemer i Internet of Things området blir diskutert. Det behandles særlig relevante aspekter som tidsnok reaksjon og kommunikasjon. 6) Testing: Studentene skal lære om hovedidéene og metoder for å teste systemer.","learning_goal":"A. Kunnskap:\r\n1) Den generelle karakteren av distribuerte og reaktive systemer, hvordan systemene kan modelleres, og rollen modellering spiller for å garantere at utviklingsprosessen er ferdig i tide og leder til systemer av høy kvalitet.\r\n2) Utvalgte modelleringspråk, metoder og verktøy, spesielt språk brukt i industriell praksis som UML og TTCN.\r\n3) Generelle prinsipp for å tilfredsstille sanntids-, pålitelighets- og ytelserestriksjoner.\r\n4) Systemvalidering gjennom testing.\r\n5) Implementasjonsdesign: De prinsipielle forskjellene mellom spesifikasjons- og designmodeller og deres realisering i maskin- og programvare, inkludert vesentlige vekselvirkninger mellom design og implementering og deres løsninger.\r\n6) Verktøy for spesifikasjon, design, implementering og analyse: Modellbasert utvikling fra abstrakte systemmodeller via designsyntese til kodegenerering og eksekvering.\r\n\r\nB. Ferdigheter:\r\n1) Analyse av eksisterende systemer, nettbaserte tjenester og applikasjoner.\r\n2) Spesifikasjon, design og implementering av nye systemer, nettbaserte tjenester og applikasjoner som oppfyller fastlagte krav.\r\n3) Praktisk utvikling, eksekvering og bruk av utvalgte tjenester som Javabaserte plattformer for distribuerte mobile tjenester.\r\n\r\nC. Generell kompetanse:\r\n1) Anvendelse av prinsippene for programvaredesign av distribuerte sanntidssystemer.\r\n2) Grunnleggende forståelse for mekanismene i støttesystemer og plattformer og konkret erfaring i realisering av et telesystem ved hjelp av en UML-basert utviklingsteknikk og et Java rammeverk."}
{"norwegian_name":"Digital økonomi","code":"TTM4165","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Digitaliseringen av økonomien er en av de viktigste samfunnsendringene i vår tid. Digitale teknologier har forandret forretningsvirksomhet så vel som hvordan personer lever og samhandler med hverandre og med omgivelsene. Dette emnet omhandler den digitale økonomien og hvordan den digitale økonomien samspiller med marked, samfunn og organisasjoner. Vi vil lære om hvordan Internet, delingsøkonomi, sosial nettverkstjenester, BigData og mobilkommunikasjon har forandret den globale forretningsvirksomheten og hvordan man skaper verdi for mennesker og bedrifter i det digitale samfunnet. \r\n\r\nEmnet består av to hoveddeler:\r\n1) Grunnleggende teori innen digital økonomi, inkludert: verdiskapningsmodeller, digitale forretningsmodeller, markedsmodellering og markedsregulering. \r\n2) Digital økonomi i kontekst og hvordan den digitale økonomien samspiller med samfunnet som helhet, miljø, fattigdomsbekjempelse, personvern, strategi, finansielle operasjoner og byutvkling. ","learning_goal":"A. Kunnskap:\r\n1) Å få kunnskap innen digital økonomi\r\n2) Å få kunnskap i hvordan den digitale økonomien samspiller med omgivelsene.\r\n\r\nB. Ferdigheter:\r\n1) Å kunne gjennomføre analyser av verdinettverk.\r\n2) Å kunne analyser og konstruere en forretningsmodell.\r\n3) Å bli i stand til å skrive en selvstendig kronikk om egenvalgt tema innenfor emnets fagområder. \r\n"}
{"norwegian_name":"Kommunikasjonsteknologi, introduksjon","code":"TTM4175","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Dette er et introduksjonsemne til fagområdet kommunikasjonsteknologi. Emnet har et fokus på praktisk lab-arbeid. Emnet består av tre deler:\r\n1. Introduksjon til grunnleggende kommunikasjonsteknologi, inkludert en introduksjon til teknisk rapportskriving.\r\n2. Lab-oppgave i etisk hacking\r\n3. Lab-oppgave innenfor tingenes internett\r\n","learning_goal":"Hovedlæringsmålet for emnet er å gi studentene grunnleggende kunnskap innen fagområdet kommunikasjonsteknologi, erfaring og ferdigheter innen laboratorie-arbeid, og motivere for videre studier innen kommunikasjonsteknologi.\r\n\r\nDetaljerte læringsmål er som følger:\r\nA. Kunnskap:\r\n1) Å få en grunnleggende og overordnet forståelse av fagområdet kommunikasjonsteknologi.\r\n2) Å få en grunnleggende forståelse for sikkerhetsmekanismer.\r\n3) Å få en grunnleggende forståelse for hvordan en applikasjon kan bygges opp av eksisterende komponenter, og hvordan disse komponentene samhandler.\r\n\r\nB. Ferdigheter:\r\n1) Å bli i stand til å skrive en teknisk rapport basert på et praktisk lab-arbeid.\r\n2) Å bli i stand til å bruke verktøy innen sikkerhet.\r\n3) Å bli i stand til å utvikle applikasjoner fra eksisterende komponenter. \r\n4) Å bruke utviklingsverktøy.\r\n5) Å finne relevant informasjon på nettet.\r\n"}
{"norwegian_name":"Nettverkshåndtering","code":"TTM4180","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Overordnet fokus er på signalering og kontroll i Internett. Kurset er delt i to, et micro nivå med fokus  på kontroll av en enkelt nettverksnode gjennom programmering og et macro nivå med fokus på Internett som system med hovedvekt på interdomene komponenter. På micro nivå er det fokus på programmering av ulike kontroll oppgaver ved hjelp av konseptet Software Defined Networking (SDN). Emner som kan inngå i macro delen av kurset er «Business models» og «interchange» avtaler, BGP, BGP som en informasjonsbærer, og ruting.  ","learning_goal":"A Kunnskap:\r\n- Dybdekunnskap i Internett som system, med fokus på inter-domene komponentene\r\n- Basiskunnskap om inter-domene rutingprotokollen BGP\r\n- Basiskunnskap om hvordan BGP kan brukes som signalerings\/ informasjonsutvekslings protokoll\r\n- Basis forståelse av ruting tjenester\r\n- Basiskunnskap om konseptet Software Defined Networking (SDN)\r\n- Basis kunnskap i programmering i en nettverkssammenheng\r\n\r\nB Ferdigheter:\r\n- Å kunne formidle og  diskutere systemet som tilsammen sørger for basis kommunikasjonstjenestene i Internett\r\n- Å kunne konstruere, implementere,  kode, og feilrette enkle nettverk kontroll program\r\n-Bruk av nettverksemuleringsverktøy\r\n"}
{"norwegian_name":"Sikkerhet og robusthet i IKT system","code":"TTM4185","credit":7.5,"taught_in_spring":true,"taught_in_autumn":true,"content":"Kurset vil fokusere på informasjonssystem og kommunikasjonsnett som kritisk infrastruktur, hvor sentrale funksjoner (basis, drift, ivaretakelse av tjenestekvalitet), og egenskaper som autonomi og heterogenitet beskrives.\r\nDet vektlegges å vise hvordan kommunikasjonsnett er integrert med andre system, som for eksempel Content Delivery Networks, P2P, Virtual Networks, Clouds,  Emergency (wireless) networks, Sensor networks, Business critical systems, Smart Grids, og å diskutere hva som kan skje ved angrep og feil. Det vil bli innført en beskrivende taksonomi (kun engelske begrep), som inkluderer Information security, privacy, safety, dependability, survivability, performability, og en klassifisering av uønskede hendelser (trusler). Trusler inkluderer både menneskeskapte (både intensjonelle, inkompetanse, ignoranse, uhell, uoverskuelige), og tilfeldige og naturskapte (omgivelse\/natur, vær, slitasje).\r\nDet finnes en rekke mottiltak, og i dette kurset vil man få en oversikt over virkemidler som er teknologiske (sikkerhetsmekanismer, feilunngåelse og feiltolerant design, målinger\/overvåkning, standarder), organisatoriske (beredskap, rolleavklaring, kommunikasjon mellom operasjonelle enheter), og politiske, inklusive lover og regulativer (e-Governance).  Kurset legger vekt på kvalitative vurderinger og vil gi enkelt innføring i metodikk som risk management og anvendelse av grafteori.\r\n","learning_goal":"A. Kunnskap: \r\nÅ få grunnleggende forståelse for:\r\n- hvordan informasjonssystem og kommunikasjonsnett understøtter og samvirker med andre samfunnskritiske system\r\n- informasjonssystems og kommunikasjonsnetts kritikalitet, kompleksitet og mangfold (teknologisk, organisatorisk, samspill aktører)\r\n- måter å representere informasjonssystem og kommunikasjonsnett på for evaluering av best mulig design\r\n- ulik taksonomi for å beskrive sikkerhets og robusthetsegenskaper, -trusler, og -mottiltak\r\n- det brede trusselbildet gjennom ulike risikoer (alt fra menneskeskapte til tilfeldige, ondsinnede til uheldig kombinasjon av tilfeldige hendelser)\r\n- forskjellige mottiltak for å sikre informasjonssystem og kommunikasjonsnett mot slike trusler (herunder teknologiske, organisatoriske, reguleringer og lover, økonomiske, politiske)\r\n- at det er et kompromiss mellom krav til kvalitet og trygghet (sikkerhet, pålitelighet, ytelse), kostnad (OPEX\/CAPEX), miljøhensyn (energi-effektivisering),\r\n- bruk av kontrakter og avtaler (f.eks. Terms of Service, Service Level Agreements, privacy policies, etc) for å beskrivende dette\r\n\r\nB. Ferdigheter: \r\n- å lære metodisk tilnærming til analyse av risikoer\/trusler\r\n- å bli i stand til å gjennomføre enkle risikoanalyser\r\n- å bli i stand til å bruke grafer for å representere kompleksitet og kvalitativ analyse av effekt av trusler\r\n- å bli i stand til å identifisere og prioritere passende mottiltak mot trusler"}
{"norwegian_name":"Kommunikasjonsteknologi for SmartGrid","code":"TTM4190","credit":7.5,"taught_in_spring":true,"taught_in_autumn":false,"content":"Dette emnet vil gi en grunnleggende innføring i kommunikasjonsteknologi, informasjonssikkerhet og digitalteknikk i kontekst av SmartGrid. Emnet er delt inn i tre deler med følgende innhold:\r\n1. Kommunikasjonsteknologi: Kommunikasjonsnett og -tjenester, internett, mobile nett, TCP\/IP, lagdeling. \r\n2. Informasjonssikkerhet: Grunnleggende begreper. Kryptering. Trusler og risiko. Tekniske, menneskelige og organisatoriske perspektiver. \r\n3. Digitalteknikk: Tallsystemer og binær aritmetikk. Boolsk algebra, logiske porter og forenklingsmetoder. Kombinatoriske kretser og enkle minnekomponenter, vipper, tellere, skiftregistre, og enkle aritmetikkretser.\r\n\r\n\r\n","learning_goal":"A. Kunnskap:\r\nStudentene skal \r\n1) Forstå ulike tallsystemer og forstå hvordan binær aritmetikk utføres. \r\n2) Kjenne til digitale kretselementer som porter og vipper og forstå hvordan disse kan brukes til å bygge opp kombinatoriske kretser, aritmetiske kretser og enkle minnekretser. \r\n3) Forstå Boolsk algebra og ulike forenklingsmetoder som kan benyttes ved design av digitale kretser og systemer. \r\n4) Kjenne de mest fundamentale konsepter, prinsipper og teknologier som er grunnlaget for kommunikasjonsnett og tjenester. Dette inkluderer arkitektur, prinsipper som omhandler nettbaserte tjenester, svitsje teknikker, sikkerhetsmekanismer, funksjonalitet og protokoller i nettets fem ulike kommunikasjonslag.\r\n5) Ha grunnleggende kjennskap til risikobilde, trusler og mottiltak for å sikre informasjonssikkerhet.\r\n\r\nB. Ferdighet:\r\nStudentene skal \r\n1)  Kunne utnytte Boolsk algebra og forenklingsmetoder til å analysere og konstruere digitale kretser og systemer bygget opp av digitale kretselementer som porter og vipper. \r\n2) Kunne resonere og drøfte arkitektur, prinsipper, og teknologier ved design og implementering av kommunikasjonsnett og tjenester. \r\n3) Kunne forklare hvordan og hvorfor nettets fem lag fungerer. \r\n4) Kunne resonere og drøfte informasjonssikkerhet på et grunnleggende nivå og vurdere risiko for kommunikasjonssytemer.\r\n"}
{"norwegian_name":"Telematikk, fordypningsprosjekt","code":"TTM4502","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Forberedende prosjekt til masteroppgaven. Studenten skal velge en forskningsoppgave og undersøke den med tanke på: motivasjon, bakgrunnsmateriale, metode, utvikling av hypoteser, testing av verktøy og generell forberedelse for å gjennomføre forskningsoppgaven som en del av masteroppgaven.","learning_goal":"Studenten skal forberede seg til masteroppgaven gjennom å arbeide med en forskningsoppgave knyttet til valgt hovedprofil. \r\n\r\nA. Kunnskap: Inngående bakgrunnskunnskap til valgt problemstilling og motivasjon for valgt oppgave.\r\n\r\nB. Ferdigheter: Test og evaluere metodeverktøy for bruk til å analyses valgt problemstilling. \r\n\r\nC. Generell kompetanse: Anvendelse av vitenskapelige arbeidsmetoder, bl.a. å innhente kompletterende kunnskap gjennom litteraturstudier og annet kildesøk og kombinere dette med egen kunnskap. Videre skal studenten gi en kortfattet muntlig presentasjon av arbeid og resultater, samt å skrive en prosjektrapport i hht. normen for slike."}
{"norwegian_name":"Nett og tjenestekvalitet, fordypningsemne","code":"TTM4516","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"- Studie av eksempelsystem. \r\n- Bruk av diskret hendelsessimulering (DES) og analytiske metoder for å vurdere løsninger og forstå fenomener i IKT-systemer .\r\n- Utvikling av en DES-modell for et system\r\n- Simulator-utvikling og -validering\r\n- Dataanalyse og evaluering av systemegenskaper.\r\n- Bruk av (forenklede) analytiske modeller.\r\n- Resultatdiskusjon. \r\n- Dokumentasjon av metode og resultater.\r\n- Presentasjon muntlig og i labrapport.","learning_goal":"A. Kunnskap:\r\n- Metoder for å evaluere tjenestekvalitet (QoS), f.eks. pålitelighet og ytelse, i kommunikasjonssystemer. \r\n- Få forståelse av samspillet mellom systemløsning og tjenestekvaliteten systemet leverer.\r\n\r\nB. Ferdigheter:\r\n- Fra en system-beskrivelse, velge riktig abstraksjonsnivå for en evaluering mhp QoS.\r\n- Etablere modeller som basis evalueringinger.\r\n- Utvikle diskrete hendelses simulatorer, basert på generiske primitiver.\r\n- Bruke\/utvikle enkle analytiske modeller.\r\n- Bruke simulering, og teoretiske verktøy og metoder for å studere tjenestekvalitet, f.eks trafikk- og\/eller pålitelighets-egenskaper.\r\n\r\nC. Generell kompetanse: \r\n- Presentere\/rapportere muntlig og skriftlig.\r\n- Delta i tekniske diskusjoner. \r\n- Ansvar for plan og fremdrift."}
{"norwegian_name":"Tjenester og systemutvikling, fordypningsemne","code":"TTM4526","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Aktuelle og avanserte tema innen modell-basert konstruksjon av fordelte systemer som utvikling av selvadaptive systemer, særlig med OSGi, og aspekter av å gjøre systemene sikre, pålitelige og høytytende.\r\n","learning_goal":"Det obligatoriske temaet har følgende mål:\r\nA. Kunnskap:\r\n1) Forståelse for grunnleggende teknikker og prinsipper for selvadapsjon.\r\n2) Inngående forståelse for utvalgte teknikker og løsninger.\r\n3) Kjennskap til noen tekniske systemer.\r\n\r\nB. Ferdigheter:\r\nPraktisk utvikling av et utvalgt applikasjonsekesmpel.\r\n\r\nC. Generell kompetanse:\r\nErfaring med å skrive et state-of-the-art essay basert på litteraturstudie."}
{"norwegian_name":"Etisk hacking - Informasjonssikkerhet, fordypningsemne","code":"TTM4536","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Kurset dekker de viktigste teknikkene som brukes av hackere og penetrasjonstestere for å oppnå bedre forsvar mot inntrengere og sikkerhetsbrudd i kjørende systemer, inklusive lav-nivå kjerne- og maskinvaretemaer, teknikker for web-applikasjoner, exploit teknikker, rootkits og noen undersøkelsesteknikker som brukes i digital etterforskning.","learning_goal":"A. Kunnskap: Studentene skal lære de underliggende prinsipper og teknikker forbundet med cybersikkerhet praksis kjent som penetrasjonstesting eller etisk hacking. De vil lære om hele penetrasjonstesting prosessen, som inkluderer planlegging, rekognosering, skanning, utnytting, post-utnyttelse og resultatrapportering.  B. Ferdigheter: For hver offensiv penetrasjonsteknikk skal studentene lære det tilsvarende avbøtende tiltaket. På denne måten skal studentene utvikle en praktisk forståelse av dagens cybersikkerhet problemstillinger og hvordan feilene some gjøres av brukere, administratorer, og programmerere kan føre til usikkerheter som kan bli utnyttet."}
{"norwegian_name":"Blokkjede-teknologier og kryptovalutaer - Informasjonssikkerhet, fordypningsemne","code":"TTM4537","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Emnet dekker den kryptografiske teorien som understøtter Bitcoin og andre kryptovalutaer, samt de praktiske aspektene av hvordan en kryptovaluta er designet. Fordelene og ulempene ved ulike tilnærminger vil bli utforsket. Flere generelle bruksområder av blokkjede-teknologier vil også bli inkludert.","learning_goal":"A. Kunnskap: Studentene skal lære de underliggende prinsippene og teknikkene knyttet til blokkjede-teknologier. De vil bli kjent med de kryptografiske byggeklossene og hvordan de brukes i en typisk kryptovaluta som Bitcoin. \r\n\r\nB. Ferdigheter: Studentene skal utvikle en praktisk forståelse av hvordan kryptovalutaer er implementert og de praktiske begrensningene av eksiterende blokkjede- og kryptovalutasystemer."}
{"norwegian_name":"Digital økonomi, fordypningsemne","code":"TTM4546","credit":7.5,"taught_in_spring":false,"taught_in_autumn":true,"content":"Aktuelle og avanserte tema innen digital økonomi, som forretningsmodeller og verdiskapning for digitale tjenester, økonomi knyttet til operasjonalisering og drift av IKT infrastruktur. Prising av IKT tjenester. Kostnadsanalyser av IKT systemer.","learning_goal":"A. Kunnskap:\r\n1) Å få en dyp forståelse for avanserte tema innen teleøkonomien, inkludert: verdiskapning i teleindustrien, forretningsmodeller, kostanalyser av telenett og nettbaserte tjenester og modellering av telemarkeder.\r\n\r\nB. Ferdigheter:\r\n1) Å bli i stand til å identifisere og beregne konkurranse scenarioer i IKT markeder.\r\n2) Å bli i stand til å gjennomføre kostanalyser av telenett og nettbaserte tjenester."}
{"norwegian_name":"Telematikk, masteroppgave","code":"TTM4905","credit":30.0,"taught_in_spring":true,"taught_in_autumn":false,"content":"Det faglige innholdet er avhengig av valgt hovedprofil.","learning_goal":"A. Kunnskap:\r\n1) Å få dyp kunnskap om ingeniørvitenskap brukt som verktøy innen kommunikasjonsteknologiområdet, innen valgt hovedprofil. \r\n2) Å få bred kunnskap om de delene av vitenskap og teknologi som er felles for hele kommunikasjonsteknologiområdet.\r\n\r\nB. Ferdigheter: \r\n1) Å kunne gjennomføre analyse, modellering, simulering og design ved å benytte verktøy om ingeniørvitenskap innen kommunikasjonsteknologiområdet på et avansert nivå innen valgt hovedprofil."}